#[allow(non_upper_case_globals)]
/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {

pub const F_UNLCK: u32 = 2;
pub const F_EXLCK: u32 = 4;
pub const F_SHLCK: u32 = 8;
pub const LOCK_SH: u32 = 1;
pub const LOCK_EX: u32 = 2;
pub const LOCK_NB: u32 = 4;
pub const LOCK_UN: u32 = 8;
pub const FAPPEND: u32 = 8;
pub const FFSYNC: u32 = 16400;
pub const FASYNC: u32 = 4096;
pub const FNONBLOCK: u32 = 128;
pub const FNDELAY: u32 = 128;
pub const __POSIX_FADV_DONTNEED: u32 = 4;
pub const __POSIX_FADV_NOREUSE: u32 = 5;
pub const POSIX_FADV_NORMAL: u32 = 0;
pub const POSIX_FADV_RANDOM: u32 = 1;
pub const POSIX_FADV_SEQUENTIAL: u32 = 2;
pub const POSIX_FADV_WILLNEED: u32 = 3;
pub const POSIX_FADV_DONTNEED: u32 = 4;
pub const POSIX_FADV_NOREUSE: u32 = 5;
pub const AT_FDCWD: i32 = -100;
pub const AT_SYMLINK_NOFOLLOW: u32 = 256;
pub const AT_REMOVEDIR: u32 = 512;
pub const AT_SYMLINK_FOLLOW: u32 = 1024;
pub const AT_EACCESS: u32 = 512;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const MAXSUPCHNMUN: u32 = 2;
pub const MAXISPOSDPIC: u32 = 8;
pub const INVHANDLE: i32 = -1;
pub const MAX_AUDIO_FRAME_NUM: u32 = 50;
pub const REINIT: i32 = -10;
pub const INIT_FAILED: i32 = -11;
pub const FAILED_GETHANDLE: i32 = -12;
pub const INVALID_PARA: i32 = -13;
pub const SET_PARA_FAILED: i32 = -14;
pub const FAILURE: i32 = -15;
pub const SET_DATALEN_ERR: i32 = -16;
pub const EXIT_ERR: i32 = -17;
pub const UNINIT: i32 = -18;
pub const FAILED_DESHANDLE: i32 = -19;
pub const DEVICE_ID_MAGIC: &[u8; 5] = b"53ef\0";
pub const DEVICE_ID_MAGIC_LEN: u32 = 4;
pub const DEVICE_ID_LEN: u32 = 32;
pub const MAX_INFO_LEN: u32 = 64;
pub type __u_char = libc::c_uchar;
pub type __u_short = libc::c_ushort;
pub type __u_int = libc::c_uint;
pub type __u_long = libc::c_ulong;
pub type __int8_t = libc::c_schar;
pub type __uint8_t = libc::c_uchar;
pub type __int16_t = libc::c_short;
pub type __uint16_t = libc::c_ushort;
pub type __int32_t = libc::c_int;
pub type __uint32_t = libc::c_uint;
pub type __int64_t = libc::c_longlong;
pub type __uint64_t = libc::c_ulonglong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = libc::c_longlong;
pub type __u_quad_t = libc::c_ulonglong;
pub type __intmax_t = libc::c_longlong;
pub type __uintmax_t = libc::c_ulonglong;
pub type __dev_t = __uint64_t;
pub type __uid_t = libc::c_uint;
pub type __gid_t = libc::c_uint;
pub type __ino_t = libc::c_ulong;
pub type __ino64_t = __uint64_t;
pub type __mode_t = libc::c_uint;
pub type __nlink_t = libc::c_uint;
pub type __off_t = libc::c_long;
pub type __off64_t = __int64_t;
pub type __pid_t = libc::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [libc::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::core::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::core::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::core::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = libc::c_long;
pub type __rlim_t = libc::c_ulong;
pub type __rlim64_t = __uint64_t;
pub type __id_t = libc::c_uint;
pub type __time_t = libc::c_long;
pub type __useconds_t = libc::c_uint;
pub type __suseconds_t = libc::c_long;
pub type __daddr_t = libc::c_int;
pub type __key_t = libc::c_int;
pub type __clockid_t = libc::c_int;
pub type __timer_t = *mut libc::c_void;
pub type __blksize_t = libc::c_long;
pub type __blkcnt_t = libc::c_long;
pub type __blkcnt64_t = __int64_t;
pub type __fsblkcnt_t = libc::c_ulong;
pub type __fsblkcnt64_t = __uint64_t;
pub type __fsfilcnt_t = libc::c_ulong;
pub type __fsfilcnt64_t = __uint64_t;
pub type __fsword_t = libc::c_int;
pub type __ssize_t = libc::c_int;
pub type __syscall_slong_t = libc::c_long;
pub type __syscall_ulong_t = libc::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut libc::c_char;
pub type __intptr_t = libc::c_int;
pub type __socklen_t = libc::c_uint;
pub type __sig_atomic_t = libc::c_int;
pub type __time64_t = __int64_t;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = libc::c_schar;
pub type int_fast16_t = libc::c_int;
pub type int_fast32_t = libc::c_int;
pub type int_fast64_t = libc::c_longlong;
pub type uint_fast8_t = libc::c_uchar;
pub type uint_fast16_t = libc::c_uint;
pub type uint_fast32_t = libc::c_uint;
pub type uint_fast64_t = libc::c_ulonglong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bitmapinfo {
    pub width: u32,
    pub pdata: *mut u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bitmapinfo"][::core::mem::size_of::<bitmapinfo>() - 8usize];
    ["Alignment of bitmapinfo"][::core::mem::align_of::<bitmapinfo>() - 4usize];
    ["Offset of field: bitmapinfo::width"][::core::mem::offset_of!(bitmapinfo, width) - 0usize];
    ["Offset of field: bitmapinfo::pdata"][::core::mem::offset_of!(bitmapinfo, pdata) - 4usize];
};
impl Default for bitmapinfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type bitmapinfo_t = bitmapinfo;
pub const gBgramapHight: libc::c_int = 34;
pub const gBgramapWidthMax: libc::c_int = 32;
extern "C" {
    pub static mut num0_bgra: [u32; 544usize];
}
extern "C" {
    pub static mut num1_bgra: [u32; 544usize];
}
extern "C" {
    pub static mut num2_bgra: [u32; 544usize];
}
extern "C" {
    pub static mut num3_bgra: [u32; 544usize];
}
extern "C" {
    pub static mut num4_bgra: [u32; 544usize];
}
extern "C" {
    pub static mut num5_bgra: [u32; 544usize];
}
extern "C" {
    pub static mut num6_bgra: [u32; 544usize];
}
extern "C" {
    pub static mut num7_bgra: [u32; 544usize];
}
extern "C" {
    pub static mut num8_bgra: [u32; 544usize];
}
extern "C" {
    pub static mut num9_bgra: [u32; 544usize];
}
extern "C" {
    pub static mut minus_bgra: [u32; 544usize];
}
extern "C" {
    pub static mut blank_bgra: [u32; 544usize];
}
extern "C" {
    pub static mut colon_bgra: [u32; 544usize];
}
extern "C" {
    pub static mut gBgramap: [bitmapinfo_t; 13usize];
}
pub const gBgramapHight_sec: libc::c_int = 18;
pub const gBgramapWidthMax_sec: libc::c_int = 16;
extern "C" {
    pub static mut num0_sec_bgra: [u32; 144usize];
}
extern "C" {
    pub static mut num1_sec_bgra: [u32; 144usize];
}
extern "C" {
    pub static mut num2_sec_bgra: [u32; 144usize];
}
extern "C" {
    pub static mut num3_sec_bgra: [u32; 144usize];
}
extern "C" {
    pub static mut num4_sec_bgra: [u32; 144usize];
}
extern "C" {
    pub static mut num5_sec_bgra: [u32; 144usize];
}
extern "C" {
    pub static mut num6_sec_bgra: [u32; 144usize];
}
extern "C" {
    pub static mut num7_sec_bgra: [u32; 144usize];
}
extern "C" {
    pub static mut num8_sec_bgra: [u32; 144usize];
}
extern "C" {
    pub static mut num9_sec_bgra: [u32; 144usize];
}
extern "C" {
    pub static mut minus_sec_bgra: [u32; 144usize];
}
extern "C" {
    pub static mut blank_sec_bgra: [u32; 144usize];
}
extern "C" {
    pub static mut colon_sec_bgra: [u32; 144usize];
}
extern "C" {
    pub static mut gBgramap_sec: [bitmapinfo_t; 13usize];
}
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::core::mem::size_of::<timespec>() - 8usize];
    ["Alignment of timespec"][::core::mem::align_of::<timespec>() - 4usize];
    ["Offset of field: timespec::tv_sec"][::core::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::core::mem::offset_of!(timespec, tv_nsec) - 4usize];
};
pub type pid_t = __pid_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct sched_param {
    pub sched_priority: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sched_param"][::core::mem::size_of::<sched_param>() - 4usize];
    ["Alignment of sched_param"][::core::mem::align_of::<sched_param>() - 4usize];
    ["Offset of field: sched_param::sched_priority"]
        [::core::mem::offset_of!(sched_param, sched_priority) - 0usize];
};
pub type __cpu_mask = libc::c_ulong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct cpu_set_t {
    pub __bits: [__cpu_mask; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_set_t"][::core::mem::size_of::<cpu_set_t>() - 128usize];
    ["Alignment of cpu_set_t"][::core::mem::align_of::<cpu_set_t>() - 4usize];
    ["Offset of field: cpu_set_t::__bits"][::core::mem::offset_of!(cpu_set_t, __bits) - 0usize];
};
extern "C" {
    pub fn __sched_cpucount(__setsize: usize, __setp: *const cpu_set_t) -> libc::c_int;
}
extern "C" {
    pub fn __sched_cpualloc(__count: usize) -> *mut cpu_set_t;
}
extern "C" {
    pub fn __sched_cpufree(__set: *mut cpu_set_t);
}
extern "C" {
    pub fn sched_setparam(__pid: __pid_t, __param: *const sched_param) -> libc::c_int;
}
extern "C" {
    pub fn sched_getparam(__pid: __pid_t, __param: *mut sched_param) -> libc::c_int;
}
extern "C" {
    pub fn sched_setscheduler(
        __pid: __pid_t,
        __policy: libc::c_int,
        __param: *const sched_param,
    ) -> libc::c_int;
}
extern "C" {
    pub fn sched_getscheduler(__pid: __pid_t) -> libc::c_int;
}
extern "C" {
    pub fn sched_yield() -> libc::c_int;
}
extern "C" {
    pub fn sched_get_priority_max(__algorithm: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn sched_get_priority_min(__algorithm: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn sched_rr_get_interval(__pid: __pid_t, __t: *mut timespec) -> libc::c_int;
}
pub type clock_t = __clock_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: libc::c_int,
    pub tm_min: libc::c_int,
    pub tm_hour: libc::c_int,
    pub tm_mday: libc::c_int,
    pub tm_mon: libc::c_int,
    pub tm_year: libc::c_int,
    pub tm_wday: libc::c_int,
    pub tm_yday: libc::c_int,
    pub tm_isdst: libc::c_int,
    pub tm_gmtoff: libc::c_long,
    pub tm_zone: *const libc::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::core::mem::size_of::<tm>() - 44usize];
    ["Alignment of tm"][::core::mem::align_of::<tm>() - 4usize];
    ["Offset of field: tm::tm_sec"][::core::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::core::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::core::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::core::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::core::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::core::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::core::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::core::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::core::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"][::core::mem::offset_of!(tm, tm_gmtoff) - 36usize];
    ["Offset of field: tm::tm_zone"][::core::mem::offset_of!(tm, tm_zone) - 40usize];
};
impl Default for tm {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerspec"][::core::mem::size_of::<itimerspec>() - 16usize];
    ["Alignment of itimerspec"][::core::mem::align_of::<itimerspec>() - 4usize];
    ["Offset of field: itimerspec::it_interval"]
        [::core::mem::offset_of!(itimerspec, it_interval) - 0usize];
    ["Offset of field: itimerspec::it_value"]
        [::core::mem::offset_of!(itimerspec, it_value) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const libc::c_ushort,
    pub __ctype_tolower: *const libc::c_int,
    pub __ctype_toupper: *const libc::c_int,
    pub __names: [*const libc::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::core::mem::size_of::<__locale_struct>() - 116usize];
    ["Alignment of __locale_struct"][::core::mem::align_of::<__locale_struct>() - 4usize];
    ["Offset of field: __locale_struct::__locales"]
        [::core::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::core::mem::offset_of!(__locale_struct, __ctype_b) - 52usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::core::mem::offset_of!(__locale_struct, __ctype_tolower) - 56usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::core::mem::offset_of!(__locale_struct, __ctype_toupper) - 60usize];
    ["Offset of field: __locale_struct::__names"]
        [::core::mem::offset_of!(__locale_struct, __names) - 64usize];
};
impl Default for __locale_struct {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        __s: *mut libc::c_char,
        __maxsize: usize,
        __format: *const libc::c_char,
        __tp: *const tm,
    ) -> usize;
}
extern "C" {
    pub fn strftime_l(
        __s: *mut libc::c_char,
        __maxsize: usize,
        __format: *const libc::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut libc::c_char;
}
extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut libc::c_char;
}
extern "C" {
    pub fn asctime_r(__tp: *const tm, __buf: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn ctime_r(__timer: *const time_t, __buf: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub static mut __tzname: [*mut libc::c_char; 2usize];
}
extern "C" {
    pub static mut __daylight: libc::c_int;
}
extern "C" {
    pub static mut __timezone: libc::c_long;
}
extern "C" {
    pub static mut tzname: [*mut libc::c_char; 2usize];
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    pub static mut daylight: libc::c_int;
}
extern "C" {
    pub static mut timezone: libc::c_long;
}
extern "C" {
    pub fn stime(__when: *const time_t) -> libc::c_int;
}
extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn dysize(__year: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn nanosleep(__requested_time: *const timespec, __remaining: *mut timespec) -> libc::c_int;
}
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> libc::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> libc::c_int;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> libc::c_int;
}
extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: libc::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> libc::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> libc::c_int;
}
extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> libc::c_int;
}
extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: libc::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> libc::c_int;
}
extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> libc::c_int;
}
extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> libc::c_int;
}
extern "C" {
    pub fn timespec_get(__ts: *mut timespec, __base: libc::c_int) -> libc::c_int;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: libc::c_uint,
    pub __writers: libc::c_uint,
    pub __wrphase_futex: libc::c_uint,
    pub __writers_futex: libc::c_uint,
    pub __pad3: libc::c_uint,
    pub __pad4: libc::c_uint,
    pub __flags: libc::c_uchar,
    pub __shared: libc::c_uchar,
    pub __pad1: libc::c_uchar,
    pub __pad2: libc::c_uchar,
    pub __cur_writer: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"]
        [::core::mem::size_of::<__pthread_rwlock_arch_t>() - 32usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::core::mem::align_of::<__pthread_rwlock_arch_t>() - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 25usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 26usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 27usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::core::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::core::mem::size_of::<__pthread_internal_slist>() - 4usize];
    ["Alignment of __pthread_internal_slist"]
        [::core::mem::align_of::<__pthread_internal_slist>() - 4usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::core::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
impl Default for __pthread_internal_slist {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: libc::c_int,
    pub __count: libc::c_uint,
    pub __owner: libc::c_int,
    pub __kind: libc::c_int,
    pub __nusers: libc::c_uint,
    pub __anon1: __pthread_mutex_s__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_mutex_s__bindgen_ty_1 {
    pub __spins: libc::c_int,
    pub __list: __pthread_slist_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s__bindgen_ty_1"]
        [::core::mem::size_of::<__pthread_mutex_s__bindgen_ty_1>() - 4usize];
    ["Alignment of __pthread_mutex_s__bindgen_ty_1"]
        [::core::mem::align_of::<__pthread_mutex_s__bindgen_ty_1>() - 4usize];
    ["Offset of field: __pthread_mutex_s__bindgen_ty_1::__spins"]
        [::core::mem::offset_of!(__pthread_mutex_s__bindgen_ty_1, __spins) - 0usize];
    ["Offset of field: __pthread_mutex_s__bindgen_ty_1::__list"]
        [::core::mem::offset_of!(__pthread_mutex_s__bindgen_ty_1, __list) - 0usize];
};
impl Default for __pthread_mutex_s__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::core::mem::size_of::<__pthread_mutex_s>() - 24usize];
    ["Alignment of __pthread_mutex_s"][::core::mem::align_of::<__pthread_mutex_s>() - 4usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::core::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::core::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::core::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::core::mem::offset_of!(__pthread_mutex_s, __kind) - 12usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::core::mem::offset_of!(__pthread_mutex_s, __nusers) - 16usize];
};
impl Default for __pthread_mutex_s {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __anon1: __pthread_cond_s__bindgen_ty_1,
    pub __anon2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [libc::c_uint; 2usize],
    pub __g_size: [libc::c_uint; 2usize],
    pub __g1_orig_size: libc::c_uint,
    pub __wrefs: libc::c_uint,
    pub __g_signals: [libc::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: libc::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: libc::c_uint,
    pub __high: libc::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of __pthread_cond_s__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1::__low"]
        [::core::mem::offset_of!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1::__high"]
        [::core::mem::offset_of!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s__bindgen_ty_1"]
        [::core::mem::size_of::<__pthread_cond_s__bindgen_ty_1>() - 8usize];
    ["Alignment of __pthread_cond_s__bindgen_ty_1"]
        [::core::mem::align_of::<__pthread_cond_s__bindgen_ty_1>() - 8usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_1::__wseq"]
        [::core::mem::offset_of!(__pthread_cond_s__bindgen_ty_1, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_1::__wseq32"]
        [::core::mem::offset_of!(__pthread_cond_s__bindgen_ty_1, __wseq32) - 0usize];
};
impl Default for __pthread_cond_s__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: libc::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: libc::c_uint,
    pub __high: libc::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>() - 8usize];
    ["Alignment of __pthread_cond_s__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>() - 4usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1::__low"]
        [::core::mem::offset_of!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1::__high"]
        [::core::mem::offset_of!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s__bindgen_ty_2"]
        [::core::mem::size_of::<__pthread_cond_s__bindgen_ty_2>() - 8usize];
    ["Alignment of __pthread_cond_s__bindgen_ty_2"]
        [::core::mem::align_of::<__pthread_cond_s__bindgen_ty_2>() - 8usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_2::__g1_start"]
        [::core::mem::offset_of!(__pthread_cond_s__bindgen_ty_2, __g1_start) - 0usize];
    ["Offset of field: __pthread_cond_s__bindgen_ty_2::__g1_start32"]
        [::core::mem::offset_of!(__pthread_cond_s__bindgen_ty_2, __g1_start32) - 0usize];
};
impl Default for __pthread_cond_s__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::core::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::core::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::core::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::core::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::core::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::core::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::core::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
impl Default for __pthread_cond_s {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type pthread_t = libc::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [libc::c_char; 4usize],
    pub __align: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::core::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::core::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::core::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::core::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
impl Default for pthread_mutexattr_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [libc::c_char; 4usize],
    pub __align: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::core::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::core::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::core::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::core::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
impl Default for pthread_condattr_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type pthread_key_t = libc::c_uint;
pub type pthread_once_t = libc::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [libc::c_char; 36usize],
    pub __align: libc::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::core::mem::size_of::<pthread_attr_t>() - 36usize];
    ["Alignment of pthread_attr_t"][::core::mem::align_of::<pthread_attr_t>() - 4usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::core::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::core::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
impl Default for pthread_attr_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [libc::c_char; 24usize],
    pub __align: libc::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::core::mem::size_of::<pthread_mutex_t>() - 24usize];
    ["Alignment of pthread_mutex_t"][::core::mem::align_of::<pthread_mutex_t>() - 4usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::core::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::core::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::core::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
impl Default for pthread_mutex_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [libc::c_char; 48usize],
    pub __align: libc::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::core::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::core::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::core::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::core::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::core::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
impl Default for pthread_cond_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [libc::c_char; 32usize],
    pub __align: libc::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::core::mem::size_of::<pthread_rwlock_t>() - 32usize];
    ["Alignment of pthread_rwlock_t"][::core::mem::align_of::<pthread_rwlock_t>() - 4usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::core::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::core::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::core::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
impl Default for pthread_rwlock_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [libc::c_char; 8usize],
    pub __align: libc::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::core::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::core::mem::align_of::<pthread_rwlockattr_t>() - 4usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::core::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::core::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
impl Default for pthread_rwlockattr_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type pthread_spinlock_t = libc::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [libc::c_char; 20usize],
    pub __align: libc::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::core::mem::size_of::<pthread_barrier_t>() - 20usize];
    ["Alignment of pthread_barrier_t"][::core::mem::align_of::<pthread_barrier_t>() - 4usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::core::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::core::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
impl Default for pthread_barrier_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [libc::c_char; 4usize],
    pub __align: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::core::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::core::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::core::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::core::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
impl Default for pthread_barrierattr_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __jmp_buf_internal_tag {
    pub __pc: *mut libc::c_void,
    pub __sp: *mut libc::c_void,
    pub __regs: [libc::c_int; 8usize],
    pub __fp: *mut libc::c_void,
    pub __gp: *mut libc::c_void,
    pub __glibc_reserved1: libc::c_int,
    pub __fpregs: [f64; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __jmp_buf_internal_tag"][::core::mem::size_of::<__jmp_buf_internal_tag>() - 104usize];
    ["Alignment of __jmp_buf_internal_tag"]
        [::core::mem::align_of::<__jmp_buf_internal_tag>() - 8usize];
    ["Offset of field: __jmp_buf_internal_tag::__pc"]
        [::core::mem::offset_of!(__jmp_buf_internal_tag, __pc) - 0usize];
    ["Offset of field: __jmp_buf_internal_tag::__sp"]
        [::core::mem::offset_of!(__jmp_buf_internal_tag, __sp) - 4usize];
    ["Offset of field: __jmp_buf_internal_tag::__regs"]
        [::core::mem::offset_of!(__jmp_buf_internal_tag, __regs) - 8usize];
    ["Offset of field: __jmp_buf_internal_tag::__fp"]
        [::core::mem::offset_of!(__jmp_buf_internal_tag, __fp) - 40usize];
    ["Offset of field: __jmp_buf_internal_tag::__gp"]
        [::core::mem::offset_of!(__jmp_buf_internal_tag, __gp) - 44usize];
    ["Offset of field: __jmp_buf_internal_tag::__glibc_reserved1"]
        [::core::mem::offset_of!(__jmp_buf_internal_tag, __glibc_reserved1) - 48usize];
    ["Offset of field: __jmp_buf_internal_tag::__fpregs"]
        [::core::mem::offset_of!(__jmp_buf_internal_tag, __fpregs) - 56usize];
};
impl Default for __jmp_buf_internal_tag {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __jmp_buf = [__jmp_buf_internal_tag; 1usize];
pub const PTHREAD_CREATE_JOINABLE: _bindgen_ty_1 = _bindgen_ty_1::PTHREAD_CREATE_JOINABLE;
pub const PTHREAD_CREATE_DETACHED: _bindgen_ty_1 = _bindgen_ty_1::PTHREAD_CREATE_DETACHED;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_1 {
    PTHREAD_CREATE_JOINABLE = 0,
    PTHREAD_CREATE_DETACHED = 1,
}
pub const PTHREAD_MUTEX_TIMED_NP: _bindgen_ty_2 = _bindgen_ty_2::PTHREAD_MUTEX_TIMED_NP;
pub const PTHREAD_MUTEX_RECURSIVE_NP: _bindgen_ty_2 = _bindgen_ty_2::PTHREAD_MUTEX_RECURSIVE_NP;
pub const PTHREAD_MUTEX_ERRORCHECK_NP: _bindgen_ty_2 = _bindgen_ty_2::PTHREAD_MUTEX_ERRORCHECK_NP;
pub const PTHREAD_MUTEX_ADAPTIVE_NP: _bindgen_ty_2 = _bindgen_ty_2::PTHREAD_MUTEX_ADAPTIVE_NP;
pub const PTHREAD_MUTEX_NORMAL: _bindgen_ty_2 = _bindgen_ty_2::PTHREAD_MUTEX_TIMED_NP;
pub const PTHREAD_MUTEX_RECURSIVE: _bindgen_ty_2 = _bindgen_ty_2::PTHREAD_MUTEX_RECURSIVE_NP;
pub const PTHREAD_MUTEX_ERRORCHECK: _bindgen_ty_2 = _bindgen_ty_2::PTHREAD_MUTEX_ERRORCHECK_NP;
pub const PTHREAD_MUTEX_DEFAULT: _bindgen_ty_2 = _bindgen_ty_2::PTHREAD_MUTEX_TIMED_NP;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_2 {
    PTHREAD_MUTEX_TIMED_NP = 0,
    PTHREAD_MUTEX_RECURSIVE_NP = 1,
    PTHREAD_MUTEX_ERRORCHECK_NP = 2,
    PTHREAD_MUTEX_ADAPTIVE_NP = 3,
}
pub const PTHREAD_MUTEX_STALLED: _bindgen_ty_3 = _bindgen_ty_3::PTHREAD_MUTEX_STALLED;
pub const PTHREAD_MUTEX_STALLED_NP: _bindgen_ty_3 = _bindgen_ty_3::PTHREAD_MUTEX_STALLED;
pub const PTHREAD_MUTEX_ROBUST: _bindgen_ty_3 = _bindgen_ty_3::PTHREAD_MUTEX_ROBUST;
pub const PTHREAD_MUTEX_ROBUST_NP: _bindgen_ty_3 = _bindgen_ty_3::PTHREAD_MUTEX_ROBUST;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_3 {
    PTHREAD_MUTEX_STALLED = 0,
    PTHREAD_MUTEX_ROBUST = 1,
}
pub const PTHREAD_PRIO_NONE: _bindgen_ty_4 = _bindgen_ty_4::PTHREAD_PRIO_NONE;
pub const PTHREAD_PRIO_INHERIT: _bindgen_ty_4 = _bindgen_ty_4::PTHREAD_PRIO_INHERIT;
pub const PTHREAD_PRIO_PROTECT: _bindgen_ty_4 = _bindgen_ty_4::PTHREAD_PRIO_PROTECT;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_4 {
    PTHREAD_PRIO_NONE = 0,
    PTHREAD_PRIO_INHERIT = 1,
    PTHREAD_PRIO_PROTECT = 2,
}
pub const PTHREAD_RWLOCK_PREFER_READER_NP: _bindgen_ty_5 =
    _bindgen_ty_5::PTHREAD_RWLOCK_PREFER_READER_NP;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NP: _bindgen_ty_5 =
    _bindgen_ty_5::PTHREAD_RWLOCK_PREFER_WRITER_NP;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP: _bindgen_ty_5 =
    _bindgen_ty_5::PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP;
pub const PTHREAD_RWLOCK_DEFAULT_NP: _bindgen_ty_5 = _bindgen_ty_5::PTHREAD_RWLOCK_PREFER_READER_NP;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_5 {
    PTHREAD_RWLOCK_PREFER_READER_NP = 0,
    PTHREAD_RWLOCK_PREFER_WRITER_NP = 1,
    PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP = 2,
}
pub const PTHREAD_INHERIT_SCHED: _bindgen_ty_6 = _bindgen_ty_6::PTHREAD_INHERIT_SCHED;
pub const PTHREAD_EXPLICIT_SCHED: _bindgen_ty_6 = _bindgen_ty_6::PTHREAD_EXPLICIT_SCHED;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_6 {
    PTHREAD_INHERIT_SCHED = 0,
    PTHREAD_EXPLICIT_SCHED = 1,
}
pub const PTHREAD_SCOPE_SYSTEM: _bindgen_ty_7 = _bindgen_ty_7::PTHREAD_SCOPE_SYSTEM;
pub const PTHREAD_SCOPE_PROCESS: _bindgen_ty_7 = _bindgen_ty_7::PTHREAD_SCOPE_PROCESS;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_7 {
    PTHREAD_SCOPE_SYSTEM = 0,
    PTHREAD_SCOPE_PROCESS = 1,
}
pub const PTHREAD_PROCESS_PRIVATE: _bindgen_ty_8 = _bindgen_ty_8::PTHREAD_PROCESS_PRIVATE;
pub const PTHREAD_PROCESS_SHARED: _bindgen_ty_8 = _bindgen_ty_8::PTHREAD_PROCESS_SHARED;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_8 {
    PTHREAD_PROCESS_PRIVATE = 0,
    PTHREAD_PROCESS_SHARED = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_cleanup_buffer {
    pub __routine: ::core::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
    pub __arg: *mut libc::c_void,
    pub __canceltype: libc::c_int,
    pub __prev: *mut _pthread_cleanup_buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_cleanup_buffer"]
        [::core::mem::size_of::<_pthread_cleanup_buffer>() - 16usize];
    ["Alignment of _pthread_cleanup_buffer"]
        [::core::mem::align_of::<_pthread_cleanup_buffer>() - 4usize];
    ["Offset of field: _pthread_cleanup_buffer::__routine"]
        [::core::mem::offset_of!(_pthread_cleanup_buffer, __routine) - 0usize];
    ["Offset of field: _pthread_cleanup_buffer::__arg"]
        [::core::mem::offset_of!(_pthread_cleanup_buffer, __arg) - 4usize];
    ["Offset of field: _pthread_cleanup_buffer::__canceltype"]
        [::core::mem::offset_of!(_pthread_cleanup_buffer, __canceltype) - 8usize];
    ["Offset of field: _pthread_cleanup_buffer::__prev"]
        [::core::mem::offset_of!(_pthread_cleanup_buffer, __prev) - 12usize];
};
impl Default for _pthread_cleanup_buffer {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const PTHREAD_CANCEL_ENABLE: _bindgen_ty_9 = _bindgen_ty_9::PTHREAD_CANCEL_ENABLE;
pub const PTHREAD_CANCEL_DISABLE: _bindgen_ty_9 = _bindgen_ty_9::PTHREAD_CANCEL_DISABLE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_9 {
    PTHREAD_CANCEL_ENABLE = 0,
    PTHREAD_CANCEL_DISABLE = 1,
}
pub const PTHREAD_CANCEL_DEFERRED: _bindgen_ty_10 = _bindgen_ty_10::PTHREAD_CANCEL_DEFERRED;
pub const PTHREAD_CANCEL_ASYNCHRONOUS: _bindgen_ty_10 = _bindgen_ty_10::PTHREAD_CANCEL_ASYNCHRONOUS;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_10 {
    PTHREAD_CANCEL_DEFERRED = 0,
    PTHREAD_CANCEL_ASYNCHRONOUS = 1,
}
extern "C" {
    pub fn pthread_create(
        __newthread: *mut pthread_t,
        __attr: *const pthread_attr_t,
        __start_routine: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut libc::c_void) -> *mut libc::c_void,
        >,
        __arg: *mut libc::c_void,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_exit(__retval: *mut libc::c_void) -> !;
}
extern "C" {
    pub fn pthread_join(__th: pthread_t, __thread_return: *mut *mut libc::c_void) -> libc::c_int;
}
extern "C" {
    pub fn pthread_detach(__th: pthread_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_self() -> pthread_t;
}
extern "C" {
    pub fn pthread_equal(__thread1: pthread_t, __thread2: pthread_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_init(__attr: *mut pthread_attr_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_destroy(__attr: *mut pthread_attr_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getdetachstate(
        __attr: *const pthread_attr_t,
        __detachstate: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setdetachstate(
        __attr: *mut pthread_attr_t,
        __detachstate: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getguardsize(
        __attr: *const pthread_attr_t,
        __guardsize: *mut usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setguardsize(
        __attr: *mut pthread_attr_t,
        __guardsize: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getschedparam(
        __attr: *const pthread_attr_t,
        __param: *mut sched_param,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setschedparam(
        __attr: *mut pthread_attr_t,
        __param: *const sched_param,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getschedpolicy(
        __attr: *const pthread_attr_t,
        __policy: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setschedpolicy(
        __attr: *mut pthread_attr_t,
        __policy: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getinheritsched(
        __attr: *const pthread_attr_t,
        __inherit: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setinheritsched(
        __attr: *mut pthread_attr_t,
        __inherit: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getscope(
        __attr: *const pthread_attr_t,
        __scope: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setscope(__attr: *mut pthread_attr_t, __scope: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getstackaddr(
        __attr: *const pthread_attr_t,
        __stackaddr: *mut *mut libc::c_void,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setstackaddr(
        __attr: *mut pthread_attr_t,
        __stackaddr: *mut libc::c_void,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getstacksize(
        __attr: *const pthread_attr_t,
        __stacksize: *mut usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setstacksize(
        __attr: *mut pthread_attr_t,
        __stacksize: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_getstack(
        __attr: *const pthread_attr_t,
        __stackaddr: *mut *mut libc::c_void,
        __stacksize: *mut usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_attr_setstack(
        __attr: *mut pthread_attr_t,
        __stackaddr: *mut libc::c_void,
        __stacksize: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_setschedparam(
        __target_thread: pthread_t,
        __policy: libc::c_int,
        __param: *const sched_param,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_getschedparam(
        __target_thread: pthread_t,
        __policy: *mut libc::c_int,
        __param: *mut sched_param,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_setschedprio(__target_thread: pthread_t, __prio: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn pthread_once(
        __once_control: *mut pthread_once_t,
        __init_routine: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_setcancelstate(
        __state: libc::c_int,
        __oldstate: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_setcanceltype(__type: libc::c_int, __oldtype: *mut libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn pthread_cancel(__th: pthread_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_testcancel();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_unwind_buf_t {
    pub __cancel_jmp_buf: [__pthread_unwind_buf_t__bindgen_ty_1; 1usize],
    pub __pad: [*mut libc::c_void; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_unwind_buf_t__bindgen_ty_1 {
    pub __cancel_jmp_buf: __jmp_buf,
    pub __mask_was_saved: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_unwind_buf_t__bindgen_ty_1"]
        [::core::mem::size_of::<__pthread_unwind_buf_t__bindgen_ty_1>() - 112usize];
    ["Alignment of __pthread_unwind_buf_t__bindgen_ty_1"]
        [::core::mem::align_of::<__pthread_unwind_buf_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: __pthread_unwind_buf_t__bindgen_ty_1::__cancel_jmp_buf"]
        [::core::mem::offset_of!(__pthread_unwind_buf_t__bindgen_ty_1, __cancel_jmp_buf) - 0usize];
    ["Offset of field: __pthread_unwind_buf_t__bindgen_ty_1::__mask_was_saved"][::core::mem::offset_of!(
        __pthread_unwind_buf_t__bindgen_ty_1,
        __mask_was_saved
    ) - 104usize];
};
impl Default for __pthread_unwind_buf_t__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_unwind_buf_t"][::core::mem::size_of::<__pthread_unwind_buf_t>() - 128usize];
    ["Alignment of __pthread_unwind_buf_t"]
        [::core::mem::align_of::<__pthread_unwind_buf_t>() - 8usize];
    ["Offset of field: __pthread_unwind_buf_t::__cancel_jmp_buf"]
        [::core::mem::offset_of!(__pthread_unwind_buf_t, __cancel_jmp_buf) - 0usize];
    ["Offset of field: __pthread_unwind_buf_t::__pad"]
        [::core::mem::offset_of!(__pthread_unwind_buf_t, __pad) - 112usize];
};
impl Default for __pthread_unwind_buf_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cleanup_frame {
    pub __cancel_routine: ::core::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
    pub __cancel_arg: *mut libc::c_void,
    pub __do_it: libc::c_int,
    pub __cancel_type: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cleanup_frame"]
        [::core::mem::size_of::<__pthread_cleanup_frame>() - 16usize];
    ["Alignment of __pthread_cleanup_frame"]
        [::core::mem::align_of::<__pthread_cleanup_frame>() - 4usize];
    ["Offset of field: __pthread_cleanup_frame::__cancel_routine"]
        [::core::mem::offset_of!(__pthread_cleanup_frame, __cancel_routine) - 0usize];
    ["Offset of field: __pthread_cleanup_frame::__cancel_arg"]
        [::core::mem::offset_of!(__pthread_cleanup_frame, __cancel_arg) - 4usize];
    ["Offset of field: __pthread_cleanup_frame::__do_it"]
        [::core::mem::offset_of!(__pthread_cleanup_frame, __do_it) - 8usize];
    ["Offset of field: __pthread_cleanup_frame::__cancel_type"]
        [::core::mem::offset_of!(__pthread_cleanup_frame, __cancel_type) - 12usize];
};
impl Default for __pthread_cleanup_frame {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn __pthread_register_cancel(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn __pthread_unregister_cancel(__buf: *mut __pthread_unwind_buf_t);
}
extern "C" {
    pub fn __pthread_unwind_next(__buf: *mut __pthread_unwind_buf_t) -> !;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __jmp_buf_tag {
    _unused: [u8; 0],
}
extern "C" {
    pub fn __sigsetjmp(__env: *mut __jmp_buf_tag, __savemask: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_init(
        __mutex: *mut pthread_mutex_t,
        __mutexattr: *const pthread_mutexattr_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_destroy(__mutex: *mut pthread_mutex_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_trylock(__mutex: *mut pthread_mutex_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_lock(__mutex: *mut pthread_mutex_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_timedlock(
        __mutex: *mut pthread_mutex_t,
        __abstime: *const timespec,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_unlock(__mutex: *mut pthread_mutex_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_getprioceiling(
        __mutex: *const pthread_mutex_t,
        __prioceiling: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_setprioceiling(
        __mutex: *mut pthread_mutex_t,
        __prioceiling: libc::c_int,
        __old_ceiling: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutex_consistent(__mutex: *mut pthread_mutex_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_init(__attr: *mut pthread_mutexattr_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_destroy(__attr: *mut pthread_mutexattr_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getpshared(
        __attr: *const pthread_mutexattr_t,
        __pshared: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setpshared(
        __attr: *mut pthread_mutexattr_t,
        __pshared: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_gettype(
        __attr: *const pthread_mutexattr_t,
        __kind: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_settype(
        __attr: *mut pthread_mutexattr_t,
        __kind: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getprotocol(
        __attr: *const pthread_mutexattr_t,
        __protocol: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setprotocol(
        __attr: *mut pthread_mutexattr_t,
        __protocol: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getprioceiling(
        __attr: *const pthread_mutexattr_t,
        __prioceiling: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setprioceiling(
        __attr: *mut pthread_mutexattr_t,
        __prioceiling: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_getrobust(
        __attr: *const pthread_mutexattr_t,
        __robustness: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_mutexattr_setrobust(
        __attr: *mut pthread_mutexattr_t,
        __robustness: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_rwlock_init(
        __rwlock: *mut pthread_rwlock_t,
        __attr: *const pthread_rwlockattr_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_rwlock_destroy(__rwlock: *mut pthread_rwlock_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_rwlock_rdlock(__rwlock: *mut pthread_rwlock_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_rwlock_tryrdlock(__rwlock: *mut pthread_rwlock_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_rwlock_timedrdlock(
        __rwlock: *mut pthread_rwlock_t,
        __abstime: *const timespec,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_rwlock_wrlock(__rwlock: *mut pthread_rwlock_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_rwlock_trywrlock(__rwlock: *mut pthread_rwlock_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_rwlock_timedwrlock(
        __rwlock: *mut pthread_rwlock_t,
        __abstime: *const timespec,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_rwlock_unlock(__rwlock: *mut pthread_rwlock_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_init(__attr: *mut pthread_rwlockattr_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_destroy(__attr: *mut pthread_rwlockattr_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_getpshared(
        __attr: *const pthread_rwlockattr_t,
        __pshared: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_setpshared(
        __attr: *mut pthread_rwlockattr_t,
        __pshared: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_getkind_np(
        __attr: *const pthread_rwlockattr_t,
        __pref: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_rwlockattr_setkind_np(
        __attr: *mut pthread_rwlockattr_t,
        __pref: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_cond_init(
        __cond: *mut pthread_cond_t,
        __cond_attr: *const pthread_condattr_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_cond_destroy(__cond: *mut pthread_cond_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_cond_signal(__cond: *mut pthread_cond_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_cond_broadcast(__cond: *mut pthread_cond_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_cond_wait(
        __cond: *mut pthread_cond_t,
        __mutex: *mut pthread_mutex_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_cond_timedwait(
        __cond: *mut pthread_cond_t,
        __mutex: *mut pthread_mutex_t,
        __abstime: *const timespec,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_condattr_init(__attr: *mut pthread_condattr_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_condattr_destroy(__attr: *mut pthread_condattr_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_condattr_getpshared(
        __attr: *const pthread_condattr_t,
        __pshared: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_condattr_setpshared(
        __attr: *mut pthread_condattr_t,
        __pshared: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_condattr_getclock(
        __attr: *const pthread_condattr_t,
        __clock_id: *mut __clockid_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_condattr_setclock(
        __attr: *mut pthread_condattr_t,
        __clock_id: __clockid_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_spin_init(
        __lock: *mut pthread_spinlock_t,
        __pshared: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_spin_destroy(__lock: *mut pthread_spinlock_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_spin_lock(__lock: *mut pthread_spinlock_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_spin_trylock(__lock: *mut pthread_spinlock_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_spin_unlock(__lock: *mut pthread_spinlock_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_barrier_init(
        __barrier: *mut pthread_barrier_t,
        __attr: *const pthread_barrierattr_t,
        __count: libc::c_uint,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_barrier_destroy(__barrier: *mut pthread_barrier_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_barrier_wait(__barrier: *mut pthread_barrier_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_barrierattr_init(__attr: *mut pthread_barrierattr_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_barrierattr_destroy(__attr: *mut pthread_barrierattr_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_barrierattr_getpshared(
        __attr: *const pthread_barrierattr_t,
        __pshared: *mut libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_barrierattr_setpshared(
        __attr: *mut pthread_barrierattr_t,
        __pshared: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_key_create(
        __key: *mut pthread_key_t,
        __destr_function: ::core::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_key_delete(__key: pthread_key_t) -> libc::c_int;
}
extern "C" {
    pub fn pthread_getspecific(__key: pthread_key_t) -> *mut libc::c_void;
}
extern "C" {
    pub fn pthread_setspecific(__key: pthread_key_t, __pointer: *const libc::c_void)
        -> libc::c_int;
}
extern "C" {
    pub fn pthread_getcpuclockid(
        __thread_id: pthread_t,
        __clock_id: *mut __clockid_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pthread_atfork(
        __prepare: ::core::option::Option<unsafe extern "C" fn()>,
        __parent: ::core::option::Option<unsafe extern "C" fn()>,
        __child: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> libc::c_int;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::core::mem::size_of::<timeval>() - 8usize];
    ["Alignment of timeval"][::core::mem::align_of::<timeval>() - 4usize];
    ["Offset of field: timeval::tv_sec"][::core::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::core::mem::offset_of!(timeval, tv_usec) - 4usize];
};
pub type suseconds_t = __suseconds_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [libc::c_ulong; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::core::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::core::mem::align_of::<__sigset_t>() - 4usize];
    ["Offset of field: __sigset_t::__val"][::core::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
pub type __fd_mask = libc::c_long;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::core::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::core::mem::align_of::<fd_set>() - 4usize];
    ["Offset of field: fd_set::__fds_bits"][::core::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: libc::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: libc::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> libc::c_int;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: libc::c_int,
    pub tz_dsttime: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timezone"][::core::mem::size_of::<timezone>() - 8usize];
    ["Alignment of timezone"][::core::mem::align_of::<timezone>() - 4usize];
    ["Offset of field: timezone::tz_minuteswest"]
        [::core::mem::offset_of!(timezone, tz_minuteswest) - 0usize];
    ["Offset of field: timezone::tz_dsttime"]
        [::core::mem::offset_of!(timezone, tz_dsttime) - 4usize];
};
pub type __timezone_ptr_t = *mut timezone;
extern "C" {
    pub fn gettimeofday(__tv: *mut timeval, __tz: __timezone_ptr_t) -> libc::c_int;
}
extern "C" {
    pub fn settimeofday(__tv: *const timeval, __tz: *const timezone) -> libc::c_int;
}
extern "C" {
    pub fn adjtime(__delta: *const timeval, __olddelta: *mut timeval) -> libc::c_int;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum __itimer_which {
    ITIMER_REAL = 0,
    ITIMER_VIRTUAL = 1,
    ITIMER_PROF = 2,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerval"][::core::mem::size_of::<itimerval>() - 16usize];
    ["Alignment of itimerval"][::core::mem::align_of::<itimerval>() - 4usize];
    ["Offset of field: itimerval::it_interval"]
        [::core::mem::offset_of!(itimerval, it_interval) - 0usize];
    ["Offset of field: itimerval::it_value"][::core::mem::offset_of!(itimerval, it_value) - 8usize];
};
pub type __itimer_which_t = libc::c_int;
extern "C" {
    pub fn getitimer(__which: __itimer_which_t, __value: *mut itimerval) -> libc::c_int;
}
extern "C" {
    pub fn setitimer(
        __which: __itimer_which_t,
        __new: *const itimerval,
        __old: *mut itimerval,
    ) -> libc::c_int;
}
extern "C" {
    pub fn utimes(__file: *const libc::c_char, __tvp: *const timeval) -> libc::c_int;
}
extern "C" {
    pub fn lutimes(__file: *const libc::c_char, __tvp: *const timeval) -> libc::c_int;
}
extern "C" {
    pub fn futimes(__fd: libc::c_int, __tvp: *const timeval) -> libc::c_int;
}
pub type __s8 = libc::c_schar;
pub type __u8 = libc::c_uchar;
pub type __s16 = libc::c_short;
pub type __u16 = libc::c_ushort;
pub type __s32 = libc::c_int;
pub type __u32 = libc::c_uint;
pub type __s64 = libc::c_longlong;
pub type __u64 = libc::c_ulonglong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [libc::c_ulong; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fd_set"][::core::mem::size_of::<__kernel_fd_set>() - 128usize];
    ["Alignment of __kernel_fd_set"][::core::mem::align_of::<__kernel_fd_set>() - 4usize];
    ["Offset of field: __kernel_fd_set::fds_bits"]
        [::core::mem::offset_of!(__kernel_fd_set, fds_bits) - 0usize];
};
pub type __kernel_sighandler_t = ::core::option::Option<unsafe extern "C" fn(arg1: libc::c_int)>;
pub type __kernel_key_t = libc::c_int;
pub type __kernel_mqd_t = libc::c_int;
pub type __kernel_daddr_t = libc::c_long;
pub type __kernel_long_t = libc::c_long;
pub type __kernel_ulong_t = libc::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = libc::c_uint;
pub type __kernel_pid_t = libc::c_int;
pub type __kernel_ipc_pid_t = libc::c_int;
pub type __kernel_uid_t = libc::c_uint;
pub type __kernel_gid_t = libc::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_uid32_t = libc::c_uint;
pub type __kernel_gid32_t = libc::c_uint;
pub type __kernel_old_uid_t = __kernel_uid_t;
pub type __kernel_old_gid_t = __kernel_gid_t;
pub type __kernel_old_dev_t = libc::c_uint;
pub type __kernel_size_t = libc::c_uint;
pub type __kernel_ssize_t = libc::c_int;
pub type __kernel_ptrdiff_t = libc::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [libc::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fsid_t"][::core::mem::size_of::<__kernel_fsid_t>() - 8usize];
    ["Alignment of __kernel_fsid_t"][::core::mem::align_of::<__kernel_fsid_t>() - 4usize];
    ["Offset of field: __kernel_fsid_t::val"]
        [::core::mem::offset_of!(__kernel_fsid_t, val) - 0usize];
};
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = libc::c_longlong;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = libc::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = libc::c_int;
pub type __kernel_clockid_t = libc::c_int;
pub type __kernel_caddr_t = *mut libc::c_char;
pub type __kernel_uid16_t = libc::c_ushort;
pub type __kernel_gid16_t = libc::c_ushort;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = libc::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct v4l2_edid {
    pub pad: __u32,
    pub start_block: __u32,
    pub blocks: __u32,
    pub reserved: [__u32; 5usize],
    pub edid: *mut __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_edid"][::core::mem::size_of::<v4l2_edid>() - 36usize];
    ["Alignment of v4l2_edid"][::core::mem::align_of::<v4l2_edid>() - 4usize];
    ["Offset of field: v4l2_edid::pad"][::core::mem::offset_of!(v4l2_edid, pad) - 0usize];
    ["Offset of field: v4l2_edid::start_block"]
        [::core::mem::offset_of!(v4l2_edid, start_block) - 4usize];
    ["Offset of field: v4l2_edid::blocks"][::core::mem::offset_of!(v4l2_edid, blocks) - 8usize];
    ["Offset of field: v4l2_edid::reserved"]
        [::core::mem::offset_of!(v4l2_edid, reserved) - 12usize];
    ["Offset of field: v4l2_edid::edid"][::core::mem::offset_of!(v4l2_edid, edid) - 32usize];
};
impl Default for v4l2_edid {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_power_line_frequency {
    V4L2_CID_POWER_LINE_FREQUENCY_DISABLED = 0,
    V4L2_CID_POWER_LINE_FREQUENCY_50HZ = 1,
    V4L2_CID_POWER_LINE_FREQUENCY_60HZ = 2,
    V4L2_CID_POWER_LINE_FREQUENCY_AUTO = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_colorfx {
    V4L2_COLORFX_NONE = 0,
    V4L2_COLORFX_BW = 1,
    V4L2_COLORFX_SEPIA = 2,
    V4L2_COLORFX_NEGATIVE = 3,
    V4L2_COLORFX_EMBOSS = 4,
    V4L2_COLORFX_SKETCH = 5,
    V4L2_COLORFX_SKY_BLUE = 6,
    V4L2_COLORFX_GRASS_GREEN = 7,
    V4L2_COLORFX_SKIN_WHITEN = 8,
    V4L2_COLORFX_VIVID = 9,
    V4L2_COLORFX_AQUA = 10,
    V4L2_COLORFX_ART_FREEZE = 11,
    V4L2_COLORFX_SILHOUETTE = 12,
    V4L2_COLORFX_SOLARIZATION = 13,
    V4L2_COLORFX_ANTIQUE = 14,
    V4L2_COLORFX_SET_CBCR = 15,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_stream_type {
    V4L2_MPEG_STREAM_TYPE_MPEG2_PS = 0,
    V4L2_MPEG_STREAM_TYPE_MPEG2_TS = 1,
    V4L2_MPEG_STREAM_TYPE_MPEG1_SS = 2,
    V4L2_MPEG_STREAM_TYPE_MPEG2_DVD = 3,
    V4L2_MPEG_STREAM_TYPE_MPEG1_VCD = 4,
    V4L2_MPEG_STREAM_TYPE_MPEG2_SVCD = 5,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_stream_vbi_fmt {
    V4L2_MPEG_STREAM_VBI_FMT_NONE = 0,
    V4L2_MPEG_STREAM_VBI_FMT_IVTV = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_audio_sampling_freq {
    V4L2_MPEG_AUDIO_SAMPLING_FREQ_44100 = 0,
    V4L2_MPEG_AUDIO_SAMPLING_FREQ_48000 = 1,
    V4L2_MPEG_AUDIO_SAMPLING_FREQ_32000 = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_audio_encoding {
    V4L2_MPEG_AUDIO_ENCODING_LAYER_1 = 0,
    V4L2_MPEG_AUDIO_ENCODING_LAYER_2 = 1,
    V4L2_MPEG_AUDIO_ENCODING_LAYER_3 = 2,
    V4L2_MPEG_AUDIO_ENCODING_AAC = 3,
    V4L2_MPEG_AUDIO_ENCODING_AC3 = 4,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_audio_l1_bitrate {
    V4L2_MPEG_AUDIO_L1_BITRATE_32K = 0,
    V4L2_MPEG_AUDIO_L1_BITRATE_64K = 1,
    V4L2_MPEG_AUDIO_L1_BITRATE_96K = 2,
    V4L2_MPEG_AUDIO_L1_BITRATE_128K = 3,
    V4L2_MPEG_AUDIO_L1_BITRATE_160K = 4,
    V4L2_MPEG_AUDIO_L1_BITRATE_192K = 5,
    V4L2_MPEG_AUDIO_L1_BITRATE_224K = 6,
    V4L2_MPEG_AUDIO_L1_BITRATE_256K = 7,
    V4L2_MPEG_AUDIO_L1_BITRATE_288K = 8,
    V4L2_MPEG_AUDIO_L1_BITRATE_320K = 9,
    V4L2_MPEG_AUDIO_L1_BITRATE_352K = 10,
    V4L2_MPEG_AUDIO_L1_BITRATE_384K = 11,
    V4L2_MPEG_AUDIO_L1_BITRATE_416K = 12,
    V4L2_MPEG_AUDIO_L1_BITRATE_448K = 13,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_audio_l2_bitrate {
    V4L2_MPEG_AUDIO_L2_BITRATE_32K = 0,
    V4L2_MPEG_AUDIO_L2_BITRATE_48K = 1,
    V4L2_MPEG_AUDIO_L2_BITRATE_56K = 2,
    V4L2_MPEG_AUDIO_L2_BITRATE_64K = 3,
    V4L2_MPEG_AUDIO_L2_BITRATE_80K = 4,
    V4L2_MPEG_AUDIO_L2_BITRATE_96K = 5,
    V4L2_MPEG_AUDIO_L2_BITRATE_112K = 6,
    V4L2_MPEG_AUDIO_L2_BITRATE_128K = 7,
    V4L2_MPEG_AUDIO_L2_BITRATE_160K = 8,
    V4L2_MPEG_AUDIO_L2_BITRATE_192K = 9,
    V4L2_MPEG_AUDIO_L2_BITRATE_224K = 10,
    V4L2_MPEG_AUDIO_L2_BITRATE_256K = 11,
    V4L2_MPEG_AUDIO_L2_BITRATE_320K = 12,
    V4L2_MPEG_AUDIO_L2_BITRATE_384K = 13,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_audio_l3_bitrate {
    V4L2_MPEG_AUDIO_L3_BITRATE_32K = 0,
    V4L2_MPEG_AUDIO_L3_BITRATE_40K = 1,
    V4L2_MPEG_AUDIO_L3_BITRATE_48K = 2,
    V4L2_MPEG_AUDIO_L3_BITRATE_56K = 3,
    V4L2_MPEG_AUDIO_L3_BITRATE_64K = 4,
    V4L2_MPEG_AUDIO_L3_BITRATE_80K = 5,
    V4L2_MPEG_AUDIO_L3_BITRATE_96K = 6,
    V4L2_MPEG_AUDIO_L3_BITRATE_112K = 7,
    V4L2_MPEG_AUDIO_L3_BITRATE_128K = 8,
    V4L2_MPEG_AUDIO_L3_BITRATE_160K = 9,
    V4L2_MPEG_AUDIO_L3_BITRATE_192K = 10,
    V4L2_MPEG_AUDIO_L3_BITRATE_224K = 11,
    V4L2_MPEG_AUDIO_L3_BITRATE_256K = 12,
    V4L2_MPEG_AUDIO_L3_BITRATE_320K = 13,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_audio_mode {
    V4L2_MPEG_AUDIO_MODE_STEREO = 0,
    V4L2_MPEG_AUDIO_MODE_JOINT_STEREO = 1,
    V4L2_MPEG_AUDIO_MODE_DUAL = 2,
    V4L2_MPEG_AUDIO_MODE_MONO = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_audio_mode_extension {
    V4L2_MPEG_AUDIO_MODE_EXTENSION_BOUND_4 = 0,
    V4L2_MPEG_AUDIO_MODE_EXTENSION_BOUND_8 = 1,
    V4L2_MPEG_AUDIO_MODE_EXTENSION_BOUND_12 = 2,
    V4L2_MPEG_AUDIO_MODE_EXTENSION_BOUND_16 = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_audio_emphasis {
    V4L2_MPEG_AUDIO_EMPHASIS_NONE = 0,
    V4L2_MPEG_AUDIO_EMPHASIS_50_DIV_15_uS = 1,
    V4L2_MPEG_AUDIO_EMPHASIS_CCITT_J17 = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_audio_crc {
    V4L2_MPEG_AUDIO_CRC_NONE = 0,
    V4L2_MPEG_AUDIO_CRC_CRC16 = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_audio_ac3_bitrate {
    V4L2_MPEG_AUDIO_AC3_BITRATE_32K = 0,
    V4L2_MPEG_AUDIO_AC3_BITRATE_40K = 1,
    V4L2_MPEG_AUDIO_AC3_BITRATE_48K = 2,
    V4L2_MPEG_AUDIO_AC3_BITRATE_56K = 3,
    V4L2_MPEG_AUDIO_AC3_BITRATE_64K = 4,
    V4L2_MPEG_AUDIO_AC3_BITRATE_80K = 5,
    V4L2_MPEG_AUDIO_AC3_BITRATE_96K = 6,
    V4L2_MPEG_AUDIO_AC3_BITRATE_112K = 7,
    V4L2_MPEG_AUDIO_AC3_BITRATE_128K = 8,
    V4L2_MPEG_AUDIO_AC3_BITRATE_160K = 9,
    V4L2_MPEG_AUDIO_AC3_BITRATE_192K = 10,
    V4L2_MPEG_AUDIO_AC3_BITRATE_224K = 11,
    V4L2_MPEG_AUDIO_AC3_BITRATE_256K = 12,
    V4L2_MPEG_AUDIO_AC3_BITRATE_320K = 13,
    V4L2_MPEG_AUDIO_AC3_BITRATE_384K = 14,
    V4L2_MPEG_AUDIO_AC3_BITRATE_448K = 15,
    V4L2_MPEG_AUDIO_AC3_BITRATE_512K = 16,
    V4L2_MPEG_AUDIO_AC3_BITRATE_576K = 17,
    V4L2_MPEG_AUDIO_AC3_BITRATE_640K = 18,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_audio_dec_playback {
    V4L2_MPEG_AUDIO_DEC_PLAYBACK_AUTO = 0,
    V4L2_MPEG_AUDIO_DEC_PLAYBACK_STEREO = 1,
    V4L2_MPEG_AUDIO_DEC_PLAYBACK_LEFT = 2,
    V4L2_MPEG_AUDIO_DEC_PLAYBACK_RIGHT = 3,
    V4L2_MPEG_AUDIO_DEC_PLAYBACK_MONO = 4,
    V4L2_MPEG_AUDIO_DEC_PLAYBACK_SWAPPED_STEREO = 5,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_encoding {
    V4L2_MPEG_VIDEO_ENCODING_MPEG_1 = 0,
    V4L2_MPEG_VIDEO_ENCODING_MPEG_2 = 1,
    V4L2_MPEG_VIDEO_ENCODING_MPEG_4_AVC = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_aspect {
    V4L2_MPEG_VIDEO_ASPECT_1x1 = 0,
    V4L2_MPEG_VIDEO_ASPECT_4x3 = 1,
    V4L2_MPEG_VIDEO_ASPECT_16x9 = 2,
    V4L2_MPEG_VIDEO_ASPECT_221x100 = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_bitrate_mode {
    V4L2_MPEG_VIDEO_BITRATE_MODE_VBR = 0,
    V4L2_MPEG_VIDEO_BITRATE_MODE_CBR = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_header_mode {
    V4L2_MPEG_VIDEO_HEADER_MODE_SEPARATE = 0,
    V4L2_MPEG_VIDEO_HEADER_MODE_JOINED_WITH_1ST_FRAME = 1,
}
impl v4l2_mpeg_video_multi_slice_mode {
    pub const V4L2_MPEG_VIDEO_MULTI_SICE_MODE_MAX_MB: v4l2_mpeg_video_multi_slice_mode =
        v4l2_mpeg_video_multi_slice_mode::V4L2_MPEG_VIDEO_MULTI_SLICE_MODE_MAX_MB;
}
impl v4l2_mpeg_video_multi_slice_mode {
    pub const V4L2_MPEG_VIDEO_MULTI_SICE_MODE_MAX_BYTES: v4l2_mpeg_video_multi_slice_mode =
        v4l2_mpeg_video_multi_slice_mode::V4L2_MPEG_VIDEO_MULTI_SLICE_MODE_MAX_BYTES;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_multi_slice_mode {
    V4L2_MPEG_VIDEO_MULTI_SLICE_MODE_SINGLE = 0,
    V4L2_MPEG_VIDEO_MULTI_SLICE_MODE_MAX_MB = 1,
    V4L2_MPEG_VIDEO_MULTI_SLICE_MODE_MAX_BYTES = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_mpeg2_level {
    V4L2_MPEG_VIDEO_MPEG2_LEVEL_LOW = 0,
    V4L2_MPEG_VIDEO_MPEG2_LEVEL_MAIN = 1,
    V4L2_MPEG_VIDEO_MPEG2_LEVEL_HIGH_1440 = 2,
    V4L2_MPEG_VIDEO_MPEG2_LEVEL_HIGH = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_mpeg2_profile {
    V4L2_MPEG_VIDEO_MPEG2_PROFILE_SIMPLE = 0,
    V4L2_MPEG_VIDEO_MPEG2_PROFILE_MAIN = 1,
    V4L2_MPEG_VIDEO_MPEG2_PROFILE_SNR_SCALABLE = 2,
    V4L2_MPEG_VIDEO_MPEG2_PROFILE_SPATIALLY_SCALABLE = 3,
    V4L2_MPEG_VIDEO_MPEG2_PROFILE_HIGH = 4,
    V4L2_MPEG_VIDEO_MPEG2_PROFILE_MULTIVIEW = 5,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_h264_entropy_mode {
    V4L2_MPEG_VIDEO_H264_ENTROPY_MODE_CAVLC = 0,
    V4L2_MPEG_VIDEO_H264_ENTROPY_MODE_CABAC = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_h264_level {
    V4L2_MPEG_VIDEO_H264_LEVEL_1_0 = 0,
    V4L2_MPEG_VIDEO_H264_LEVEL_1B = 1,
    V4L2_MPEG_VIDEO_H264_LEVEL_1_1 = 2,
    V4L2_MPEG_VIDEO_H264_LEVEL_1_2 = 3,
    V4L2_MPEG_VIDEO_H264_LEVEL_1_3 = 4,
    V4L2_MPEG_VIDEO_H264_LEVEL_2_0 = 5,
    V4L2_MPEG_VIDEO_H264_LEVEL_2_1 = 6,
    V4L2_MPEG_VIDEO_H264_LEVEL_2_2 = 7,
    V4L2_MPEG_VIDEO_H264_LEVEL_3_0 = 8,
    V4L2_MPEG_VIDEO_H264_LEVEL_3_1 = 9,
    V4L2_MPEG_VIDEO_H264_LEVEL_3_2 = 10,
    V4L2_MPEG_VIDEO_H264_LEVEL_4_0 = 11,
    V4L2_MPEG_VIDEO_H264_LEVEL_4_1 = 12,
    V4L2_MPEG_VIDEO_H264_LEVEL_4_2 = 13,
    V4L2_MPEG_VIDEO_H264_LEVEL_5_0 = 14,
    V4L2_MPEG_VIDEO_H264_LEVEL_5_1 = 15,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_h264_loop_filter_mode {
    V4L2_MPEG_VIDEO_H264_LOOP_FILTER_MODE_ENABLED = 0,
    V4L2_MPEG_VIDEO_H264_LOOP_FILTER_MODE_DISABLED = 1,
    V4L2_MPEG_VIDEO_H264_LOOP_FILTER_MODE_DISABLED_AT_SLICE_BOUNDARY = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_h264_profile {
    V4L2_MPEG_VIDEO_H264_PROFILE_BASELINE = 0,
    V4L2_MPEG_VIDEO_H264_PROFILE_CONSTRAINED_BASELINE = 1,
    V4L2_MPEG_VIDEO_H264_PROFILE_MAIN = 2,
    V4L2_MPEG_VIDEO_H264_PROFILE_EXTENDED = 3,
    V4L2_MPEG_VIDEO_H264_PROFILE_HIGH = 4,
    V4L2_MPEG_VIDEO_H264_PROFILE_HIGH_10 = 5,
    V4L2_MPEG_VIDEO_H264_PROFILE_HIGH_422 = 6,
    V4L2_MPEG_VIDEO_H264_PROFILE_HIGH_444_PREDICTIVE = 7,
    V4L2_MPEG_VIDEO_H264_PROFILE_HIGH_10_INTRA = 8,
    V4L2_MPEG_VIDEO_H264_PROFILE_HIGH_422_INTRA = 9,
    V4L2_MPEG_VIDEO_H264_PROFILE_HIGH_444_INTRA = 10,
    V4L2_MPEG_VIDEO_H264_PROFILE_CAVLC_444_INTRA = 11,
    V4L2_MPEG_VIDEO_H264_PROFILE_SCALABLE_BASELINE = 12,
    V4L2_MPEG_VIDEO_H264_PROFILE_SCALABLE_HIGH = 13,
    V4L2_MPEG_VIDEO_H264_PROFILE_SCALABLE_HIGH_INTRA = 14,
    V4L2_MPEG_VIDEO_H264_PROFILE_STEREO_HIGH = 15,
    V4L2_MPEG_VIDEO_H264_PROFILE_MULTIVIEW_HIGH = 16,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_h264_vui_sar_idc {
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_UNSPECIFIED = 0,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_1x1 = 1,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_12x11 = 2,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_10x11 = 3,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_16x11 = 4,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_40x33 = 5,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_24x11 = 6,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_20x11 = 7,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_32x11 = 8,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_80x33 = 9,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_18x11 = 10,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_15x11 = 11,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_64x33 = 12,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_160x99 = 13,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_4x3 = 14,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_3x2 = 15,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_2x1 = 16,
    V4L2_MPEG_VIDEO_H264_VUI_SAR_IDC_EXTENDED = 17,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_h264_sei_fp_arrangement_type {
    V4L2_MPEG_VIDEO_H264_SEI_FP_ARRANGEMENT_TYPE_CHECKERBOARD = 0,
    V4L2_MPEG_VIDEO_H264_SEI_FP_ARRANGEMENT_TYPE_COLUMN = 1,
    V4L2_MPEG_VIDEO_H264_SEI_FP_ARRANGEMENT_TYPE_ROW = 2,
    V4L2_MPEG_VIDEO_H264_SEI_FP_ARRANGEMENT_TYPE_SIDE_BY_SIDE = 3,
    V4L2_MPEG_VIDEO_H264_SEI_FP_ARRANGEMENT_TYPE_TOP_BOTTOM = 4,
    V4L2_MPEG_VIDEO_H264_SEI_FP_ARRANGEMENT_TYPE_TEMPORAL = 5,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_h264_fmo_map_type {
    V4L2_MPEG_VIDEO_H264_FMO_MAP_TYPE_INTERLEAVED_SLICES = 0,
    V4L2_MPEG_VIDEO_H264_FMO_MAP_TYPE_SCATTERED_SLICES = 1,
    V4L2_MPEG_VIDEO_H264_FMO_MAP_TYPE_FOREGROUND_WITH_LEFT_OVER = 2,
    V4L2_MPEG_VIDEO_H264_FMO_MAP_TYPE_BOX_OUT = 3,
    V4L2_MPEG_VIDEO_H264_FMO_MAP_TYPE_RASTER_SCAN = 4,
    V4L2_MPEG_VIDEO_H264_FMO_MAP_TYPE_WIPE_SCAN = 5,
    V4L2_MPEG_VIDEO_H264_FMO_MAP_TYPE_EXPLICIT = 6,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_h264_fmo_change_dir {
    V4L2_MPEG_VIDEO_H264_FMO_CHANGE_DIR_RIGHT = 0,
    V4L2_MPEG_VIDEO_H264_FMO_CHANGE_DIR_LEFT = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_h264_hierarchical_coding_type {
    V4L2_MPEG_VIDEO_H264_HIERARCHICAL_CODING_B = 0,
    V4L2_MPEG_VIDEO_H264_HIERARCHICAL_CODING_P = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_mpeg4_level {
    V4L2_MPEG_VIDEO_MPEG4_LEVEL_0 = 0,
    V4L2_MPEG_VIDEO_MPEG4_LEVEL_0B = 1,
    V4L2_MPEG_VIDEO_MPEG4_LEVEL_1 = 2,
    V4L2_MPEG_VIDEO_MPEG4_LEVEL_2 = 3,
    V4L2_MPEG_VIDEO_MPEG4_LEVEL_3 = 4,
    V4L2_MPEG_VIDEO_MPEG4_LEVEL_3B = 5,
    V4L2_MPEG_VIDEO_MPEG4_LEVEL_4 = 6,
    V4L2_MPEG_VIDEO_MPEG4_LEVEL_5 = 7,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_mpeg4_profile {
    V4L2_MPEG_VIDEO_MPEG4_PROFILE_SIMPLE = 0,
    V4L2_MPEG_VIDEO_MPEG4_PROFILE_ADVANCED_SIMPLE = 1,
    V4L2_MPEG_VIDEO_MPEG4_PROFILE_CORE = 2,
    V4L2_MPEG_VIDEO_MPEG4_PROFILE_SIMPLE_SCALABLE = 3,
    V4L2_MPEG_VIDEO_MPEG4_PROFILE_ADVANCED_CODING_EFFICIENCY = 4,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_vp8_num_partitions {
    V4L2_CID_MPEG_VIDEO_VPX_1_PARTITION = 0,
    V4L2_CID_MPEG_VIDEO_VPX_2_PARTITIONS = 1,
    V4L2_CID_MPEG_VIDEO_VPX_4_PARTITIONS = 2,
    V4L2_CID_MPEG_VIDEO_VPX_8_PARTITIONS = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_vp8_num_ref_frames {
    V4L2_CID_MPEG_VIDEO_VPX_1_REF_FRAME = 0,
    V4L2_CID_MPEG_VIDEO_VPX_2_REF_FRAME = 1,
    V4L2_CID_MPEG_VIDEO_VPX_3_REF_FRAME = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_vp8_golden_frame_sel {
    V4L2_CID_MPEG_VIDEO_VPX_GOLDEN_FRAME_USE_PREV = 0,
    V4L2_CID_MPEG_VIDEO_VPX_GOLDEN_FRAME_USE_REF_PERIOD = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_vp8_profile {
    V4L2_MPEG_VIDEO_VP8_PROFILE_0 = 0,
    V4L2_MPEG_VIDEO_VP8_PROFILE_1 = 1,
    V4L2_MPEG_VIDEO_VP8_PROFILE_2 = 2,
    V4L2_MPEG_VIDEO_VP8_PROFILE_3 = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_vp9_profile {
    V4L2_MPEG_VIDEO_VP9_PROFILE_0 = 0,
    V4L2_MPEG_VIDEO_VP9_PROFILE_1 = 1,
    V4L2_MPEG_VIDEO_VP9_PROFILE_2 = 2,
    V4L2_MPEG_VIDEO_VP9_PROFILE_3 = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_hevc_hier_coding_type {
    V4L2_MPEG_VIDEO_HEVC_HIERARCHICAL_CODING_B = 0,
    V4L2_MPEG_VIDEO_HEVC_HIERARCHICAL_CODING_P = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_hevc_profile {
    V4L2_MPEG_VIDEO_HEVC_PROFILE_MAIN = 0,
    V4L2_MPEG_VIDEO_HEVC_PROFILE_MAIN_STILL_PICTURE = 1,
    V4L2_MPEG_VIDEO_HEVC_PROFILE_MAIN_10 = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_hevc_level {
    V4L2_MPEG_VIDEO_HEVC_LEVEL_1 = 0,
    V4L2_MPEG_VIDEO_HEVC_LEVEL_2 = 1,
    V4L2_MPEG_VIDEO_HEVC_LEVEL_2_1 = 2,
    V4L2_MPEG_VIDEO_HEVC_LEVEL_3 = 3,
    V4L2_MPEG_VIDEO_HEVC_LEVEL_3_1 = 4,
    V4L2_MPEG_VIDEO_HEVC_LEVEL_4 = 5,
    V4L2_MPEG_VIDEO_HEVC_LEVEL_4_1 = 6,
    V4L2_MPEG_VIDEO_HEVC_LEVEL_5 = 7,
    V4L2_MPEG_VIDEO_HEVC_LEVEL_5_1 = 8,
    V4L2_MPEG_VIDEO_HEVC_LEVEL_5_2 = 9,
    V4L2_MPEG_VIDEO_HEVC_LEVEL_6 = 10,
    V4L2_MPEG_VIDEO_HEVC_LEVEL_6_1 = 11,
    V4L2_MPEG_VIDEO_HEVC_LEVEL_6_2 = 12,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_video_hevc_tier {
    V4L2_MPEG_VIDEO_HEVC_TIER_MAIN = 0,
    V4L2_MPEG_VIDEO_HEVC_TIER_HIGH = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_cid_mpeg_video_hevc_loop_filter_mode {
    V4L2_MPEG_VIDEO_HEVC_LOOP_FILTER_MODE_DISABLED = 0,
    V4L2_MPEG_VIDEO_HEVC_LOOP_FILTER_MODE_ENABLED = 1,
    V4L2_MPEG_VIDEO_HEVC_LOOP_FILTER_MODE_DISABLED_AT_SLICE_BOUNDARY = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_cid_mpeg_video_hevc_refresh_type {
    V4L2_MPEG_VIDEO_HEVC_REFRESH_NONE = 0,
    V4L2_MPEG_VIDEO_HEVC_REFRESH_CRA = 1,
    V4L2_MPEG_VIDEO_HEVC_REFRESH_IDR = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_cid_mpeg_video_hevc_size_of_length_field {
    V4L2_MPEG_VIDEO_HEVC_SIZE_0 = 0,
    V4L2_MPEG_VIDEO_HEVC_SIZE_1 = 1,
    V4L2_MPEG_VIDEO_HEVC_SIZE_2 = 2,
    V4L2_MPEG_VIDEO_HEVC_SIZE_4 = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_cx2341x_video_spatial_filter_mode {
    V4L2_MPEG_CX2341X_VIDEO_SPATIAL_FILTER_MODE_MANUAL = 0,
    V4L2_MPEG_CX2341X_VIDEO_SPATIAL_FILTER_MODE_AUTO = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_cx2341x_video_luma_spatial_filter_type {
    V4L2_MPEG_CX2341X_VIDEO_LUMA_SPATIAL_FILTER_TYPE_OFF = 0,
    V4L2_MPEG_CX2341X_VIDEO_LUMA_SPATIAL_FILTER_TYPE_1D_HOR = 1,
    V4L2_MPEG_CX2341X_VIDEO_LUMA_SPATIAL_FILTER_TYPE_1D_VERT = 2,
    V4L2_MPEG_CX2341X_VIDEO_LUMA_SPATIAL_FILTER_TYPE_2D_HV_SEPARABLE = 3,
    V4L2_MPEG_CX2341X_VIDEO_LUMA_SPATIAL_FILTER_TYPE_2D_SYM_NON_SEPARABLE = 4,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_cx2341x_video_chroma_spatial_filter_type {
    V4L2_MPEG_CX2341X_VIDEO_CHROMA_SPATIAL_FILTER_TYPE_OFF = 0,
    V4L2_MPEG_CX2341X_VIDEO_CHROMA_SPATIAL_FILTER_TYPE_1D_HOR = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_cx2341x_video_temporal_filter_mode {
    V4L2_MPEG_CX2341X_VIDEO_TEMPORAL_FILTER_MODE_MANUAL = 0,
    V4L2_MPEG_CX2341X_VIDEO_TEMPORAL_FILTER_MODE_AUTO = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_cx2341x_video_median_filter_type {
    V4L2_MPEG_CX2341X_VIDEO_MEDIAN_FILTER_TYPE_OFF = 0,
    V4L2_MPEG_CX2341X_VIDEO_MEDIAN_FILTER_TYPE_HOR = 1,
    V4L2_MPEG_CX2341X_VIDEO_MEDIAN_FILTER_TYPE_VERT = 2,
    V4L2_MPEG_CX2341X_VIDEO_MEDIAN_FILTER_TYPE_HOR_VERT = 3,
    V4L2_MPEG_CX2341X_VIDEO_MEDIAN_FILTER_TYPE_DIAG = 4,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_mfc51_video_frame_skip_mode {
    V4L2_MPEG_MFC51_VIDEO_FRAME_SKIP_MODE_DISABLED = 0,
    V4L2_MPEG_MFC51_VIDEO_FRAME_SKIP_MODE_LEVEL_LIMIT = 1,
    V4L2_MPEG_MFC51_VIDEO_FRAME_SKIP_MODE_BUF_LIMIT = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_mpeg_mfc51_video_force_frame_type {
    V4L2_MPEG_MFC51_VIDEO_FORCE_FRAME_TYPE_DISABLED = 0,
    V4L2_MPEG_MFC51_VIDEO_FORCE_FRAME_TYPE_I_FRAME = 1,
    V4L2_MPEG_MFC51_VIDEO_FORCE_FRAME_TYPE_NOT_CODED = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_exposure_auto_type {
    V4L2_EXPOSURE_AUTO = 0,
    V4L2_EXPOSURE_MANUAL = 1,
    V4L2_EXPOSURE_SHUTTER_PRIORITY = 2,
    V4L2_EXPOSURE_APERTURE_PRIORITY = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_auto_n_preset_white_balance {
    V4L2_WHITE_BALANCE_MANUAL = 0,
    V4L2_WHITE_BALANCE_AUTO = 1,
    V4L2_WHITE_BALANCE_INCANDESCENT = 2,
    V4L2_WHITE_BALANCE_FLUORESCENT = 3,
    V4L2_WHITE_BALANCE_FLUORESCENT_H = 4,
    V4L2_WHITE_BALANCE_HORIZON = 5,
    V4L2_WHITE_BALANCE_DAYLIGHT = 6,
    V4L2_WHITE_BALANCE_FLASH = 7,
    V4L2_WHITE_BALANCE_CLOUDY = 8,
    V4L2_WHITE_BALANCE_SHADE = 9,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_iso_sensitivity_auto_type {
    V4L2_ISO_SENSITIVITY_MANUAL = 0,
    V4L2_ISO_SENSITIVITY_AUTO = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_exposure_metering {
    V4L2_EXPOSURE_METERING_AVERAGE = 0,
    V4L2_EXPOSURE_METERING_CENTER_WEIGHTED = 1,
    V4L2_EXPOSURE_METERING_SPOT = 2,
    V4L2_EXPOSURE_METERING_MATRIX = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_scene_mode {
    V4L2_SCENE_MODE_NONE = 0,
    V4L2_SCENE_MODE_BACKLIGHT = 1,
    V4L2_SCENE_MODE_BEACH_SNOW = 2,
    V4L2_SCENE_MODE_CANDLE_LIGHT = 3,
    V4L2_SCENE_MODE_DAWN_DUSK = 4,
    V4L2_SCENE_MODE_FALL_COLORS = 5,
    V4L2_SCENE_MODE_FIREWORKS = 6,
    V4L2_SCENE_MODE_LANDSCAPE = 7,
    V4L2_SCENE_MODE_NIGHT = 8,
    V4L2_SCENE_MODE_PARTY_INDOOR = 9,
    V4L2_SCENE_MODE_PORTRAIT = 10,
    V4L2_SCENE_MODE_SPORTS = 11,
    V4L2_SCENE_MODE_SUNSET = 12,
    V4L2_SCENE_MODE_TEXT = 13,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_auto_focus_range {
    V4L2_AUTO_FOCUS_RANGE_AUTO = 0,
    V4L2_AUTO_FOCUS_RANGE_NORMAL = 1,
    V4L2_AUTO_FOCUS_RANGE_MACRO = 2,
    V4L2_AUTO_FOCUS_RANGE_INFINITY = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_preemphasis {
    V4L2_PREEMPHASIS_DISABLED = 0,
    V4L2_PREEMPHASIS_50_uS = 1,
    V4L2_PREEMPHASIS_75_uS = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_flash_led_mode {
    V4L2_FLASH_LED_MODE_NONE = 0,
    V4L2_FLASH_LED_MODE_FLASH = 1,
    V4L2_FLASH_LED_MODE_TORCH = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_flash_strobe_source {
    V4L2_FLASH_STROBE_SOURCE_SOFTWARE = 0,
    V4L2_FLASH_STROBE_SOURCE_EXTERNAL = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_jpeg_chroma_subsampling {
    V4L2_JPEG_CHROMA_SUBSAMPLING_444 = 0,
    V4L2_JPEG_CHROMA_SUBSAMPLING_422 = 1,
    V4L2_JPEG_CHROMA_SUBSAMPLING_420 = 2,
    V4L2_JPEG_CHROMA_SUBSAMPLING_411 = 3,
    V4L2_JPEG_CHROMA_SUBSAMPLING_410 = 4,
    V4L2_JPEG_CHROMA_SUBSAMPLING_GRAY = 5,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_dv_tx_mode {
    V4L2_DV_TX_MODE_DVI_D = 0,
    V4L2_DV_TX_MODE_HDMI = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_dv_rgb_range {
    V4L2_DV_RGB_RANGE_AUTO = 0,
    V4L2_DV_RGB_RANGE_LIMITED = 1,
    V4L2_DV_RGB_RANGE_FULL = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_dv_it_content_type {
    V4L2_DV_IT_CONTENT_TYPE_GRAPHICS = 0,
    V4L2_DV_IT_CONTENT_TYPE_PHOTO = 1,
    V4L2_DV_IT_CONTENT_TYPE_CINEMA = 2,
    V4L2_DV_IT_CONTENT_TYPE_GAME = 3,
    V4L2_DV_IT_CONTENT_TYPE_NO_ITC = 4,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_deemphasis {
    V4L2_DEEMPHASIS_DISABLED = 0,
    V4L2_DEEMPHASIS_50_uS = 1,
    V4L2_DEEMPHASIS_75_uS = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_detect_md_mode {
    V4L2_DETECT_MD_MODE_DISABLED = 0,
    V4L2_DETECT_MD_MODE_GLOBAL = 1,
    V4L2_DETECT_MD_MODE_THRESHOLD_GRID = 2,
    V4L2_DETECT_MD_MODE_REGION_GRID = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_field {
    V4L2_FIELD_ANY = 0,
    V4L2_FIELD_NONE = 1,
    V4L2_FIELD_TOP = 2,
    V4L2_FIELD_BOTTOM = 3,
    V4L2_FIELD_INTERLACED = 4,
    V4L2_FIELD_SEQ_TB = 5,
    V4L2_FIELD_SEQ_BT = 6,
    V4L2_FIELD_ALTERNATE = 7,
    V4L2_FIELD_INTERLACED_TB = 8,
    V4L2_FIELD_INTERLACED_BT = 9,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_buf_type {
    V4L2_BUF_TYPE_VIDEO_CAPTURE = 1,
    V4L2_BUF_TYPE_VIDEO_OUTPUT = 2,
    V4L2_BUF_TYPE_VIDEO_OVERLAY = 3,
    V4L2_BUF_TYPE_VBI_CAPTURE = 4,
    V4L2_BUF_TYPE_VBI_OUTPUT = 5,
    V4L2_BUF_TYPE_SLICED_VBI_CAPTURE = 6,
    V4L2_BUF_TYPE_SLICED_VBI_OUTPUT = 7,
    V4L2_BUF_TYPE_VIDEO_OUTPUT_OVERLAY = 8,
    V4L2_BUF_TYPE_VIDEO_CAPTURE_MPLANE = 9,
    V4L2_BUF_TYPE_VIDEO_OUTPUT_MPLANE = 10,
    V4L2_BUF_TYPE_SDR_CAPTURE = 11,
    V4L2_BUF_TYPE_SDR_OUTPUT = 12,
    V4L2_BUF_TYPE_META_CAPTURE = 13,
    V4L2_BUF_TYPE_META_OUTPUT = 14,
    V4L2_BUF_TYPE_PRIVATE = 128,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_tuner_type {
    V4L2_TUNER_RADIO = 1,
    V4L2_TUNER_ANALOG_TV = 2,
    V4L2_TUNER_DIGITAL_TV = 3,
    V4L2_TUNER_SDR = 4,
    V4L2_TUNER_RF = 5,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_memory {
    V4L2_MEMORY_MMAP = 1,
    V4L2_MEMORY_USERPTR = 2,
    V4L2_MEMORY_OVERLAY = 3,
    V4L2_MEMORY_DMABUF = 4,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_colorspace {
    V4L2_COLORSPACE_DEFAULT = 0,
    V4L2_COLORSPACE_SMPTE170M = 1,
    V4L2_COLORSPACE_SMPTE240M = 2,
    V4L2_COLORSPACE_REC709 = 3,
    V4L2_COLORSPACE_BT878 = 4,
    V4L2_COLORSPACE_470_SYSTEM_M = 5,
    V4L2_COLORSPACE_470_SYSTEM_BG = 6,
    V4L2_COLORSPACE_JPEG = 7,
    V4L2_COLORSPACE_SRGB = 8,
    V4L2_COLORSPACE_OPRGB = 9,
    V4L2_COLORSPACE_BT2020 = 10,
    V4L2_COLORSPACE_RAW = 11,
    V4L2_COLORSPACE_DCI_P3 = 12,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_xfer_func {
    V4L2_XFER_FUNC_DEFAULT = 0,
    V4L2_XFER_FUNC_709 = 1,
    V4L2_XFER_FUNC_SRGB = 2,
    V4L2_XFER_FUNC_OPRGB = 3,
    V4L2_XFER_FUNC_SMPTE240M = 4,
    V4L2_XFER_FUNC_NONE = 5,
    V4L2_XFER_FUNC_DCI_P3 = 6,
    V4L2_XFER_FUNC_SMPTE2084 = 7,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_ycbcr_encoding {
    V4L2_YCBCR_ENC_DEFAULT = 0,
    V4L2_YCBCR_ENC_601 = 1,
    V4L2_YCBCR_ENC_709 = 2,
    V4L2_YCBCR_ENC_XV601 = 3,
    V4L2_YCBCR_ENC_XV709 = 4,
    V4L2_YCBCR_ENC_SYCC = 5,
    V4L2_YCBCR_ENC_BT2020 = 6,
    V4L2_YCBCR_ENC_BT2020_CONST_LUM = 7,
    V4L2_YCBCR_ENC_SMPTE240M = 8,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_hsv_encoding {
    V4L2_HSV_ENC_180 = 128,
    V4L2_HSV_ENC_256 = 129,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_quantization {
    V4L2_QUANTIZATION_DEFAULT = 0,
    V4L2_QUANTIZATION_FULL_RANGE = 1,
    V4L2_QUANTIZATION_LIM_RANGE = 2,
}
impl v4l2_priority {
    pub const V4L2_PRIORITY_DEFAULT: v4l2_priority = v4l2_priority::V4L2_PRIORITY_INTERACTIVE;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_priority {
    V4L2_PRIORITY_UNSET = 0,
    V4L2_PRIORITY_BACKGROUND = 1,
    V4L2_PRIORITY_INTERACTIVE = 2,
    V4L2_PRIORITY_RECORD = 3,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_rect {
    pub left: __s32,
    pub top: __s32,
    pub width: __u32,
    pub height: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_rect"][::core::mem::size_of::<v4l2_rect>() - 16usize];
    ["Alignment of v4l2_rect"][::core::mem::align_of::<v4l2_rect>() - 4usize];
    ["Offset of field: v4l2_rect::left"][::core::mem::offset_of!(v4l2_rect, left) - 0usize];
    ["Offset of field: v4l2_rect::top"][::core::mem::offset_of!(v4l2_rect, top) - 4usize];
    ["Offset of field: v4l2_rect::width"][::core::mem::offset_of!(v4l2_rect, width) - 8usize];
    ["Offset of field: v4l2_rect::height"][::core::mem::offset_of!(v4l2_rect, height) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_fract {
    pub numerator: __u32,
    pub denominator: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_fract"][::core::mem::size_of::<v4l2_fract>() - 8usize];
    ["Alignment of v4l2_fract"][::core::mem::align_of::<v4l2_fract>() - 4usize];
    ["Offset of field: v4l2_fract::numerator"]
        [::core::mem::offset_of!(v4l2_fract, numerator) - 0usize];
    ["Offset of field: v4l2_fract::denominator"]
        [::core::mem::offset_of!(v4l2_fract, denominator) - 4usize];
};
#[doc = " struct v4l2_capability - Describes V4L2 device caps returned by VIDIOC_QUERYCAP\n\n @driver:\t   name of the driver module (e.g. \"bttv\")\n @card:\t   name of the card (e.g. \"Hauppauge WinTV\")\n @bus_info:\t   name of the bus (e.g. \"PCI:\" + pci_name(pci_dev) )\n @version:\t   KERNEL_VERSION\n @capabilities: capabilities of the physical device as a whole\n @device_caps:  capabilities accessed via this particular device (node)\n @reserved:\t   reserved fields for future extensions"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_capability {
    pub driver: [__u8; 16usize],
    pub card: [__u8; 32usize],
    pub bus_info: [__u8; 32usize],
    pub version: __u32,
    pub capabilities: __u32,
    pub device_caps: __u32,
    pub reserved: [__u32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_capability"][::core::mem::size_of::<v4l2_capability>() - 104usize];
    ["Alignment of v4l2_capability"][::core::mem::align_of::<v4l2_capability>() - 4usize];
    ["Offset of field: v4l2_capability::driver"]
        [::core::mem::offset_of!(v4l2_capability, driver) - 0usize];
    ["Offset of field: v4l2_capability::card"]
        [::core::mem::offset_of!(v4l2_capability, card) - 16usize];
    ["Offset of field: v4l2_capability::bus_info"]
        [::core::mem::offset_of!(v4l2_capability, bus_info) - 48usize];
    ["Offset of field: v4l2_capability::version"]
        [::core::mem::offset_of!(v4l2_capability, version) - 80usize];
    ["Offset of field: v4l2_capability::capabilities"]
        [::core::mem::offset_of!(v4l2_capability, capabilities) - 84usize];
    ["Offset of field: v4l2_capability::device_caps"]
        [::core::mem::offset_of!(v4l2_capability, device_caps) - 88usize];
    ["Offset of field: v4l2_capability::reserved"]
        [::core::mem::offset_of!(v4l2_capability, reserved) - 92usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct v4l2_pix_format {
    pub width: __u32,
    pub height: __u32,
    pub pixelformat: __u32,
    pub field: __u32,
    pub bytesperline: __u32,
    pub sizeimage: __u32,
    pub colorspace: __u32,
    pub priv_: __u32,
    pub flags: __u32,
    pub __anon1: v4l2_pix_format__bindgen_ty_1,
    pub quantization: __u32,
    pub xfer_func: __u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_pix_format__bindgen_ty_1 {
    pub ycbcr_enc: __u32,
    pub hsv_enc: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_pix_format__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_pix_format__bindgen_ty_1>() - 4usize];
    ["Alignment of v4l2_pix_format__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_pix_format__bindgen_ty_1>() - 4usize];
    ["Offset of field: v4l2_pix_format__bindgen_ty_1::ycbcr_enc"]
        [::core::mem::offset_of!(v4l2_pix_format__bindgen_ty_1, ycbcr_enc) - 0usize];
    ["Offset of field: v4l2_pix_format__bindgen_ty_1::hsv_enc"]
        [::core::mem::offset_of!(v4l2_pix_format__bindgen_ty_1, hsv_enc) - 0usize];
};
impl Default for v4l2_pix_format__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_pix_format"][::core::mem::size_of::<v4l2_pix_format>() - 48usize];
    ["Alignment of v4l2_pix_format"][::core::mem::align_of::<v4l2_pix_format>() - 4usize];
    ["Offset of field: v4l2_pix_format::width"]
        [::core::mem::offset_of!(v4l2_pix_format, width) - 0usize];
    ["Offset of field: v4l2_pix_format::height"]
        [::core::mem::offset_of!(v4l2_pix_format, height) - 4usize];
    ["Offset of field: v4l2_pix_format::pixelformat"]
        [::core::mem::offset_of!(v4l2_pix_format, pixelformat) - 8usize];
    ["Offset of field: v4l2_pix_format::field"]
        [::core::mem::offset_of!(v4l2_pix_format, field) - 12usize];
    ["Offset of field: v4l2_pix_format::bytesperline"]
        [::core::mem::offset_of!(v4l2_pix_format, bytesperline) - 16usize];
    ["Offset of field: v4l2_pix_format::sizeimage"]
        [::core::mem::offset_of!(v4l2_pix_format, sizeimage) - 20usize];
    ["Offset of field: v4l2_pix_format::colorspace"]
        [::core::mem::offset_of!(v4l2_pix_format, colorspace) - 24usize];
    ["Offset of field: v4l2_pix_format::priv_"]
        [::core::mem::offset_of!(v4l2_pix_format, priv_) - 28usize];
    ["Offset of field: v4l2_pix_format::flags"]
        [::core::mem::offset_of!(v4l2_pix_format, flags) - 32usize];
    ["Offset of field: v4l2_pix_format::quantization"]
        [::core::mem::offset_of!(v4l2_pix_format, quantization) - 40usize];
    ["Offset of field: v4l2_pix_format::xfer_func"]
        [::core::mem::offset_of!(v4l2_pix_format, xfer_func) - 44usize];
};
impl Default for v4l2_pix_format {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_fmtdesc {
    pub index: __u32,
    pub type_: __u32,
    pub flags: __u32,
    pub description: [__u8; 32usize],
    pub pixelformat: __u32,
    pub reserved: [__u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_fmtdesc"][::core::mem::size_of::<v4l2_fmtdesc>() - 64usize];
    ["Alignment of v4l2_fmtdesc"][::core::mem::align_of::<v4l2_fmtdesc>() - 4usize];
    ["Offset of field: v4l2_fmtdesc::index"][::core::mem::offset_of!(v4l2_fmtdesc, index) - 0usize];
    ["Offset of field: v4l2_fmtdesc::type_"][::core::mem::offset_of!(v4l2_fmtdesc, type_) - 4usize];
    ["Offset of field: v4l2_fmtdesc::flags"][::core::mem::offset_of!(v4l2_fmtdesc, flags) - 8usize];
    ["Offset of field: v4l2_fmtdesc::description"]
        [::core::mem::offset_of!(v4l2_fmtdesc, description) - 12usize];
    ["Offset of field: v4l2_fmtdesc::pixelformat"]
        [::core::mem::offset_of!(v4l2_fmtdesc, pixelformat) - 44usize];
    ["Offset of field: v4l2_fmtdesc::reserved"]
        [::core::mem::offset_of!(v4l2_fmtdesc, reserved) - 48usize];
};
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_frmsizetypes {
    V4L2_FRMSIZE_TYPE_DISCRETE = 1,
    V4L2_FRMSIZE_TYPE_CONTINUOUS = 2,
    V4L2_FRMSIZE_TYPE_STEPWISE = 3,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_frmsize_discrete {
    pub width: __u32,
    pub height: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_frmsize_discrete"][::core::mem::size_of::<v4l2_frmsize_discrete>() - 8usize];
    ["Alignment of v4l2_frmsize_discrete"]
        [::core::mem::align_of::<v4l2_frmsize_discrete>() - 4usize];
    ["Offset of field: v4l2_frmsize_discrete::width"]
        [::core::mem::offset_of!(v4l2_frmsize_discrete, width) - 0usize];
    ["Offset of field: v4l2_frmsize_discrete::height"]
        [::core::mem::offset_of!(v4l2_frmsize_discrete, height) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_frmsize_stepwise {
    pub min_width: __u32,
    pub max_width: __u32,
    pub step_width: __u32,
    pub min_height: __u32,
    pub max_height: __u32,
    pub step_height: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_frmsize_stepwise"][::core::mem::size_of::<v4l2_frmsize_stepwise>() - 24usize];
    ["Alignment of v4l2_frmsize_stepwise"]
        [::core::mem::align_of::<v4l2_frmsize_stepwise>() - 4usize];
    ["Offset of field: v4l2_frmsize_stepwise::min_width"]
        [::core::mem::offset_of!(v4l2_frmsize_stepwise, min_width) - 0usize];
    ["Offset of field: v4l2_frmsize_stepwise::max_width"]
        [::core::mem::offset_of!(v4l2_frmsize_stepwise, max_width) - 4usize];
    ["Offset of field: v4l2_frmsize_stepwise::step_width"]
        [::core::mem::offset_of!(v4l2_frmsize_stepwise, step_width) - 8usize];
    ["Offset of field: v4l2_frmsize_stepwise::min_height"]
        [::core::mem::offset_of!(v4l2_frmsize_stepwise, min_height) - 12usize];
    ["Offset of field: v4l2_frmsize_stepwise::max_height"]
        [::core::mem::offset_of!(v4l2_frmsize_stepwise, max_height) - 16usize];
    ["Offset of field: v4l2_frmsize_stepwise::step_height"]
        [::core::mem::offset_of!(v4l2_frmsize_stepwise, step_height) - 20usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct v4l2_frmsizeenum {
    pub index: __u32,
    pub pixel_format: __u32,
    pub type_: __u32,
    pub __anon1: v4l2_frmsizeenum__bindgen_ty_1,
    pub reserved: [__u32; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_frmsizeenum__bindgen_ty_1 {
    pub discrete: v4l2_frmsize_discrete,
    pub stepwise: v4l2_frmsize_stepwise,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_frmsizeenum__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_frmsizeenum__bindgen_ty_1>() - 24usize];
    ["Alignment of v4l2_frmsizeenum__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_frmsizeenum__bindgen_ty_1>() - 4usize];
    ["Offset of field: v4l2_frmsizeenum__bindgen_ty_1::discrete"]
        [::core::mem::offset_of!(v4l2_frmsizeenum__bindgen_ty_1, discrete) - 0usize];
    ["Offset of field: v4l2_frmsizeenum__bindgen_ty_1::stepwise"]
        [::core::mem::offset_of!(v4l2_frmsizeenum__bindgen_ty_1, stepwise) - 0usize];
};
impl Default for v4l2_frmsizeenum__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_frmsizeenum"][::core::mem::size_of::<v4l2_frmsizeenum>() - 44usize];
    ["Alignment of v4l2_frmsizeenum"][::core::mem::align_of::<v4l2_frmsizeenum>() - 4usize];
    ["Offset of field: v4l2_frmsizeenum::index"]
        [::core::mem::offset_of!(v4l2_frmsizeenum, index) - 0usize];
    ["Offset of field: v4l2_frmsizeenum::pixel_format"]
        [::core::mem::offset_of!(v4l2_frmsizeenum, pixel_format) - 4usize];
    ["Offset of field: v4l2_frmsizeenum::type_"]
        [::core::mem::offset_of!(v4l2_frmsizeenum, type_) - 8usize];
    ["Offset of field: v4l2_frmsizeenum::reserved"]
        [::core::mem::offset_of!(v4l2_frmsizeenum, reserved) - 36usize];
};
impl Default for v4l2_frmsizeenum {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_frmivaltypes {
    V4L2_FRMIVAL_TYPE_DISCRETE = 1,
    V4L2_FRMIVAL_TYPE_CONTINUOUS = 2,
    V4L2_FRMIVAL_TYPE_STEPWISE = 3,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_frmival_stepwise {
    pub min: v4l2_fract,
    pub max: v4l2_fract,
    pub step: v4l2_fract,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_frmival_stepwise"][::core::mem::size_of::<v4l2_frmival_stepwise>() - 24usize];
    ["Alignment of v4l2_frmival_stepwise"]
        [::core::mem::align_of::<v4l2_frmival_stepwise>() - 4usize];
    ["Offset of field: v4l2_frmival_stepwise::min"]
        [::core::mem::offset_of!(v4l2_frmival_stepwise, min) - 0usize];
    ["Offset of field: v4l2_frmival_stepwise::max"]
        [::core::mem::offset_of!(v4l2_frmival_stepwise, max) - 8usize];
    ["Offset of field: v4l2_frmival_stepwise::step"]
        [::core::mem::offset_of!(v4l2_frmival_stepwise, step) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct v4l2_frmivalenum {
    pub index: __u32,
    pub pixel_format: __u32,
    pub width: __u32,
    pub height: __u32,
    pub type_: __u32,
    pub __anon1: v4l2_frmivalenum__bindgen_ty_1,
    pub reserved: [__u32; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_frmivalenum__bindgen_ty_1 {
    pub discrete: v4l2_fract,
    pub stepwise: v4l2_frmival_stepwise,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_frmivalenum__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_frmivalenum__bindgen_ty_1>() - 24usize];
    ["Alignment of v4l2_frmivalenum__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_frmivalenum__bindgen_ty_1>() - 4usize];
    ["Offset of field: v4l2_frmivalenum__bindgen_ty_1::discrete"]
        [::core::mem::offset_of!(v4l2_frmivalenum__bindgen_ty_1, discrete) - 0usize];
    ["Offset of field: v4l2_frmivalenum__bindgen_ty_1::stepwise"]
        [::core::mem::offset_of!(v4l2_frmivalenum__bindgen_ty_1, stepwise) - 0usize];
};
impl Default for v4l2_frmivalenum__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_frmivalenum"][::core::mem::size_of::<v4l2_frmivalenum>() - 52usize];
    ["Alignment of v4l2_frmivalenum"][::core::mem::align_of::<v4l2_frmivalenum>() - 4usize];
    ["Offset of field: v4l2_frmivalenum::index"]
        [::core::mem::offset_of!(v4l2_frmivalenum, index) - 0usize];
    ["Offset of field: v4l2_frmivalenum::pixel_format"]
        [::core::mem::offset_of!(v4l2_frmivalenum, pixel_format) - 4usize];
    ["Offset of field: v4l2_frmivalenum::width"]
        [::core::mem::offset_of!(v4l2_frmivalenum, width) - 8usize];
    ["Offset of field: v4l2_frmivalenum::height"]
        [::core::mem::offset_of!(v4l2_frmivalenum, height) - 12usize];
    ["Offset of field: v4l2_frmivalenum::type_"]
        [::core::mem::offset_of!(v4l2_frmivalenum, type_) - 16usize];
    ["Offset of field: v4l2_frmivalenum::reserved"]
        [::core::mem::offset_of!(v4l2_frmivalenum, reserved) - 44usize];
};
impl Default for v4l2_frmivalenum {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_timecode {
    pub type_: __u32,
    pub flags: __u32,
    pub frames: __u8,
    pub seconds: __u8,
    pub minutes: __u8,
    pub hours: __u8,
    pub userbits: [__u8; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_timecode"][::core::mem::size_of::<v4l2_timecode>() - 16usize];
    ["Alignment of v4l2_timecode"][::core::mem::align_of::<v4l2_timecode>() - 4usize];
    ["Offset of field: v4l2_timecode::type_"]
        [::core::mem::offset_of!(v4l2_timecode, type_) - 0usize];
    ["Offset of field: v4l2_timecode::flags"]
        [::core::mem::offset_of!(v4l2_timecode, flags) - 4usize];
    ["Offset of field: v4l2_timecode::frames"]
        [::core::mem::offset_of!(v4l2_timecode, frames) - 8usize];
    ["Offset of field: v4l2_timecode::seconds"]
        [::core::mem::offset_of!(v4l2_timecode, seconds) - 9usize];
    ["Offset of field: v4l2_timecode::minutes"]
        [::core::mem::offset_of!(v4l2_timecode, minutes) - 10usize];
    ["Offset of field: v4l2_timecode::hours"]
        [::core::mem::offset_of!(v4l2_timecode, hours) - 11usize];
    ["Offset of field: v4l2_timecode::userbits"]
        [::core::mem::offset_of!(v4l2_timecode, userbits) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct v4l2_jpegcompression {
    pub quality: libc::c_int,
    pub APPn: libc::c_int,
    pub APP_len: libc::c_int,
    pub APP_data: [libc::c_char; 60usize],
    pub COM_len: libc::c_int,
    pub COM_data: [libc::c_char; 60usize],
    pub jpeg_markers: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_jpegcompression"][::core::mem::size_of::<v4l2_jpegcompression>() - 140usize];
    ["Alignment of v4l2_jpegcompression"][::core::mem::align_of::<v4l2_jpegcompression>() - 4usize];
    ["Offset of field: v4l2_jpegcompression::quality"]
        [::core::mem::offset_of!(v4l2_jpegcompression, quality) - 0usize];
    ["Offset of field: v4l2_jpegcompression::APPn"]
        [::core::mem::offset_of!(v4l2_jpegcompression, APPn) - 4usize];
    ["Offset of field: v4l2_jpegcompression::APP_len"]
        [::core::mem::offset_of!(v4l2_jpegcompression, APP_len) - 8usize];
    ["Offset of field: v4l2_jpegcompression::APP_data"]
        [::core::mem::offset_of!(v4l2_jpegcompression, APP_data) - 12usize];
    ["Offset of field: v4l2_jpegcompression::COM_len"]
        [::core::mem::offset_of!(v4l2_jpegcompression, COM_len) - 72usize];
    ["Offset of field: v4l2_jpegcompression::COM_data"]
        [::core::mem::offset_of!(v4l2_jpegcompression, COM_data) - 76usize];
    ["Offset of field: v4l2_jpegcompression::jpeg_markers"]
        [::core::mem::offset_of!(v4l2_jpegcompression, jpeg_markers) - 136usize];
};
impl Default for v4l2_jpegcompression {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_requestbuffers {
    pub count: __u32,
    pub type_: __u32,
    pub memory: __u32,
    pub capabilities: __u32,
    pub reserved: [__u32; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_requestbuffers"][::core::mem::size_of::<v4l2_requestbuffers>() - 20usize];
    ["Alignment of v4l2_requestbuffers"][::core::mem::align_of::<v4l2_requestbuffers>() - 4usize];
    ["Offset of field: v4l2_requestbuffers::count"]
        [::core::mem::offset_of!(v4l2_requestbuffers, count) - 0usize];
    ["Offset of field: v4l2_requestbuffers::type_"]
        [::core::mem::offset_of!(v4l2_requestbuffers, type_) - 4usize];
    ["Offset of field: v4l2_requestbuffers::memory"]
        [::core::mem::offset_of!(v4l2_requestbuffers, memory) - 8usize];
    ["Offset of field: v4l2_requestbuffers::capabilities"]
        [::core::mem::offset_of!(v4l2_requestbuffers, capabilities) - 12usize];
    ["Offset of field: v4l2_requestbuffers::reserved"]
        [::core::mem::offset_of!(v4l2_requestbuffers, reserved) - 16usize];
};
#[doc = " struct v4l2_plane - plane info for multi-planar buffers\n @bytesused:\t\tnumber of bytes occupied by data in the plane (payload)\n @length:\t\tsize of this plane (NOT the payload) in bytes\n @mem_offset:\t\twhen memory in the associated struct v4l2_buffer is\n\t\t\tV4L2_MEMORY_MMAP, equals the offset from the start of\n\t\t\tthe device memory for this plane (or is a \"cookie\" that\n\t\t\tshould be passed to mmap() called on the video node)\n @userptr:\t\twhen memory is V4L2_MEMORY_USERPTR, a userspace pointer\n\t\t\tpointing to this plane\n @fd:\t\t\twhen memory is V4L2_MEMORY_DMABUF, a userspace file\n\t\t\tdescriptor associated with this plane\n @data_offset:\toffset in the plane to the start of data; usually 0,\n\t\t\tunless there is a header in front of the data\n\n Multi-planar buffers consist of one or more planes, e.g. an YCbCr buffer\n with two planes can have one plane for Y, and another for interleaved CbCr\n components. Each plane can reside in a separate memory buffer, or even in\n a completely separate memory node (e.g. in embedded devices)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct v4l2_plane {
    pub bytesused: __u32,
    pub length: __u32,
    pub m: v4l2_plane__bindgen_ty_1,
    pub data_offset: __u32,
    pub reserved: [__u32; 11usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_plane__bindgen_ty_1 {
    pub mem_offset: __u32,
    pub userptr: libc::c_ulong,
    pub fd: __s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_plane__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_plane__bindgen_ty_1>() - 4usize];
    ["Alignment of v4l2_plane__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_plane__bindgen_ty_1>() - 4usize];
    ["Offset of field: v4l2_plane__bindgen_ty_1::mem_offset"]
        [::core::mem::offset_of!(v4l2_plane__bindgen_ty_1, mem_offset) - 0usize];
    ["Offset of field: v4l2_plane__bindgen_ty_1::userptr"]
        [::core::mem::offset_of!(v4l2_plane__bindgen_ty_1, userptr) - 0usize];
    ["Offset of field: v4l2_plane__bindgen_ty_1::fd"]
        [::core::mem::offset_of!(v4l2_plane__bindgen_ty_1, fd) - 0usize];
};
impl Default for v4l2_plane__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_plane"][::core::mem::size_of::<v4l2_plane>() - 60usize];
    ["Alignment of v4l2_plane"][::core::mem::align_of::<v4l2_plane>() - 4usize];
    ["Offset of field: v4l2_plane::bytesused"]
        [::core::mem::offset_of!(v4l2_plane, bytesused) - 0usize];
    ["Offset of field: v4l2_plane::length"][::core::mem::offset_of!(v4l2_plane, length) - 4usize];
    ["Offset of field: v4l2_plane::m"][::core::mem::offset_of!(v4l2_plane, m) - 8usize];
    ["Offset of field: v4l2_plane::data_offset"]
        [::core::mem::offset_of!(v4l2_plane, data_offset) - 12usize];
    ["Offset of field: v4l2_plane::reserved"]
        [::core::mem::offset_of!(v4l2_plane, reserved) - 16usize];
};
impl Default for v4l2_plane {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " struct v4l2_buffer - video buffer info\n @index:\tid number of the buffer\n @type:\tenum v4l2_buf_type; buffer type (type == *_MPLANE for\n\t\tmultiplanar buffers);\n @bytesused:\tnumber of bytes occupied by data in the buffer (payload);\n\t\tunused (set to 0) for multiplanar buffers\n @flags:\tbuffer informational flags\n @field:\tenum v4l2_field; field order of the image in the buffer\n @timestamp:\tframe timestamp\n @timecode:\tframe timecode\n @sequence:\tsequence count of this frame\n @memory:\tenum v4l2_memory; the method, in which the actual video data is\n\t\tpassed\n @offset:\tfor non-multiplanar buffers with memory == V4L2_MEMORY_MMAP;\n\t\toffset from the start of the device memory for this plane,\n\t\t(or a \"cookie\" that should be passed to mmap() as offset)\n @userptr:\tfor non-multiplanar buffers with memory == V4L2_MEMORY_USERPTR;\n\t\ta userspace pointer pointing to this buffer\n @fd:\t\tfor non-multiplanar buffers with memory == V4L2_MEMORY_DMABUF;\n\t\ta userspace file descriptor associated with this buffer\n @planes:\tfor multiplanar buffers; userspace pointer to the array of plane\n\t\tinfo structs for this buffer\n @length:\tsize in bytes of the buffer (NOT its payload) for single-plane\n\t\tbuffers (when type != *_MPLANE); number of elements in the\n\t\tplanes array for multi-plane buffers\n @request_fd: fd of the request that this buffer should use\n\n Contains data exchanged by application and driver using one of the Streaming\n I/O methods."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct v4l2_buffer {
    pub index: __u32,
    pub type_: __u32,
    pub bytesused: __u32,
    pub flags: __u32,
    pub field: __u32,
    pub timestamp: timeval,
    pub timecode: v4l2_timecode,
    pub sequence: __u32,
    pub memory: __u32,
    pub m: v4l2_buffer__bindgen_ty_1,
    pub length: __u32,
    pub reserved2: __u32,
    pub __anon1: v4l2_buffer__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_buffer__bindgen_ty_1 {
    pub offset: __u32,
    pub userptr: libc::c_ulong,
    pub planes: *mut v4l2_plane,
    pub fd: __s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_buffer__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_buffer__bindgen_ty_1>() - 4usize];
    ["Alignment of v4l2_buffer__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_buffer__bindgen_ty_1>() - 4usize];
    ["Offset of field: v4l2_buffer__bindgen_ty_1::offset"]
        [::core::mem::offset_of!(v4l2_buffer__bindgen_ty_1, offset) - 0usize];
    ["Offset of field: v4l2_buffer__bindgen_ty_1::userptr"]
        [::core::mem::offset_of!(v4l2_buffer__bindgen_ty_1, userptr) - 0usize];
    ["Offset of field: v4l2_buffer__bindgen_ty_1::planes"]
        [::core::mem::offset_of!(v4l2_buffer__bindgen_ty_1, planes) - 0usize];
    ["Offset of field: v4l2_buffer__bindgen_ty_1::fd"]
        [::core::mem::offset_of!(v4l2_buffer__bindgen_ty_1, fd) - 0usize];
};
impl Default for v4l2_buffer__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_buffer__bindgen_ty_2 {
    pub request_fd: __s32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_buffer__bindgen_ty_2"]
        [::core::mem::size_of::<v4l2_buffer__bindgen_ty_2>() - 4usize];
    ["Alignment of v4l2_buffer__bindgen_ty_2"]
        [::core::mem::align_of::<v4l2_buffer__bindgen_ty_2>() - 4usize];
    ["Offset of field: v4l2_buffer__bindgen_ty_2::request_fd"]
        [::core::mem::offset_of!(v4l2_buffer__bindgen_ty_2, request_fd) - 0usize];
    ["Offset of field: v4l2_buffer__bindgen_ty_2::reserved"]
        [::core::mem::offset_of!(v4l2_buffer__bindgen_ty_2, reserved) - 0usize];
};
impl Default for v4l2_buffer__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_buffer"][::core::mem::size_of::<v4l2_buffer>() - 68usize];
    ["Alignment of v4l2_buffer"][::core::mem::align_of::<v4l2_buffer>() - 4usize];
    ["Offset of field: v4l2_buffer::index"][::core::mem::offset_of!(v4l2_buffer, index) - 0usize];
    ["Offset of field: v4l2_buffer::type_"][::core::mem::offset_of!(v4l2_buffer, type_) - 4usize];
    ["Offset of field: v4l2_buffer::bytesused"]
        [::core::mem::offset_of!(v4l2_buffer, bytesused) - 8usize];
    ["Offset of field: v4l2_buffer::flags"][::core::mem::offset_of!(v4l2_buffer, flags) - 12usize];
    ["Offset of field: v4l2_buffer::field"][::core::mem::offset_of!(v4l2_buffer, field) - 16usize];
    ["Offset of field: v4l2_buffer::timestamp"]
        [::core::mem::offset_of!(v4l2_buffer, timestamp) - 20usize];
    ["Offset of field: v4l2_buffer::timecode"]
        [::core::mem::offset_of!(v4l2_buffer, timecode) - 28usize];
    ["Offset of field: v4l2_buffer::sequence"]
        [::core::mem::offset_of!(v4l2_buffer, sequence) - 44usize];
    ["Offset of field: v4l2_buffer::memory"]
        [::core::mem::offset_of!(v4l2_buffer, memory) - 48usize];
    ["Offset of field: v4l2_buffer::m"][::core::mem::offset_of!(v4l2_buffer, m) - 52usize];
    ["Offset of field: v4l2_buffer::length"]
        [::core::mem::offset_of!(v4l2_buffer, length) - 56usize];
    ["Offset of field: v4l2_buffer::reserved2"]
        [::core::mem::offset_of!(v4l2_buffer, reserved2) - 60usize];
};
impl Default for v4l2_buffer {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " struct v4l2_exportbuffer - export of video buffer as DMABUF file descriptor\n\n @index:\tid number of the buffer\n @type:\tenum v4l2_buf_type; buffer type (type == *_MPLANE for\n\t\tmultiplanar buffers);\n @plane:\tindex of the plane to be exported, 0 for single plane queues\n @flags:\tflags for newly created file, currently only O_CLOEXEC is\n\t\tsupported, refer to manual of open syscall for more details\n @fd:\t\tfile descriptor associated with DMABUF (set by driver)\n\n Contains data used for exporting a video buffer as DMABUF file descriptor.\n The buffer is identified by a 'cookie' returned by VIDIOC_QUERYBUF\n (identical to the cookie used to mmap() the buffer to userspace). All\n reserved fields must be set to zero. The field reserved0 is expected to\n become a structure 'type' allowing an alternative layout of the structure\n content. Therefore this field should not be used for any other extensions."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_exportbuffer {
    pub type_: __u32,
    pub index: __u32,
    pub plane: __u32,
    pub flags: __u32,
    pub fd: __s32,
    pub reserved: [__u32; 11usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_exportbuffer"][::core::mem::size_of::<v4l2_exportbuffer>() - 64usize];
    ["Alignment of v4l2_exportbuffer"][::core::mem::align_of::<v4l2_exportbuffer>() - 4usize];
    ["Offset of field: v4l2_exportbuffer::type_"]
        [::core::mem::offset_of!(v4l2_exportbuffer, type_) - 0usize];
    ["Offset of field: v4l2_exportbuffer::index"]
        [::core::mem::offset_of!(v4l2_exportbuffer, index) - 4usize];
    ["Offset of field: v4l2_exportbuffer::plane"]
        [::core::mem::offset_of!(v4l2_exportbuffer, plane) - 8usize];
    ["Offset of field: v4l2_exportbuffer::flags"]
        [::core::mem::offset_of!(v4l2_exportbuffer, flags) - 12usize];
    ["Offset of field: v4l2_exportbuffer::fd"]
        [::core::mem::offset_of!(v4l2_exportbuffer, fd) - 16usize];
    ["Offset of field: v4l2_exportbuffer::reserved"]
        [::core::mem::offset_of!(v4l2_exportbuffer, reserved) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct v4l2_framebuffer {
    pub capability: __u32,
    pub flags: __u32,
    pub base: *mut libc::c_void,
    pub fmt: v4l2_framebuffer__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_framebuffer__bindgen_ty_1 {
    pub width: __u32,
    pub height: __u32,
    pub pixelformat: __u32,
    pub field: __u32,
    pub bytesperline: __u32,
    pub sizeimage: __u32,
    pub colorspace: __u32,
    pub priv_: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_framebuffer__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_framebuffer__bindgen_ty_1>() - 32usize];
    ["Alignment of v4l2_framebuffer__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_framebuffer__bindgen_ty_1>() - 4usize];
    ["Offset of field: v4l2_framebuffer__bindgen_ty_1::width"]
        [::core::mem::offset_of!(v4l2_framebuffer__bindgen_ty_1, width) - 0usize];
    ["Offset of field: v4l2_framebuffer__bindgen_ty_1::height"]
        [::core::mem::offset_of!(v4l2_framebuffer__bindgen_ty_1, height) - 4usize];
    ["Offset of field: v4l2_framebuffer__bindgen_ty_1::pixelformat"]
        [::core::mem::offset_of!(v4l2_framebuffer__bindgen_ty_1, pixelformat) - 8usize];
    ["Offset of field: v4l2_framebuffer__bindgen_ty_1::field"]
        [::core::mem::offset_of!(v4l2_framebuffer__bindgen_ty_1, field) - 12usize];
    ["Offset of field: v4l2_framebuffer__bindgen_ty_1::bytesperline"]
        [::core::mem::offset_of!(v4l2_framebuffer__bindgen_ty_1, bytesperline) - 16usize];
    ["Offset of field: v4l2_framebuffer__bindgen_ty_1::sizeimage"]
        [::core::mem::offset_of!(v4l2_framebuffer__bindgen_ty_1, sizeimage) - 20usize];
    ["Offset of field: v4l2_framebuffer__bindgen_ty_1::colorspace"]
        [::core::mem::offset_of!(v4l2_framebuffer__bindgen_ty_1, colorspace) - 24usize];
    ["Offset of field: v4l2_framebuffer__bindgen_ty_1::priv_"]
        [::core::mem::offset_of!(v4l2_framebuffer__bindgen_ty_1, priv_) - 28usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_framebuffer"][::core::mem::size_of::<v4l2_framebuffer>() - 44usize];
    ["Alignment of v4l2_framebuffer"][::core::mem::align_of::<v4l2_framebuffer>() - 4usize];
    ["Offset of field: v4l2_framebuffer::capability"]
        [::core::mem::offset_of!(v4l2_framebuffer, capability) - 0usize];
    ["Offset of field: v4l2_framebuffer::flags"]
        [::core::mem::offset_of!(v4l2_framebuffer, flags) - 4usize];
    ["Offset of field: v4l2_framebuffer::base"]
        [::core::mem::offset_of!(v4l2_framebuffer, base) - 8usize];
    ["Offset of field: v4l2_framebuffer::fmt"]
        [::core::mem::offset_of!(v4l2_framebuffer, fmt) - 12usize];
};
impl Default for v4l2_framebuffer {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct v4l2_clip {
    pub c: v4l2_rect,
    pub next: *mut v4l2_clip,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_clip"][::core::mem::size_of::<v4l2_clip>() - 20usize];
    ["Alignment of v4l2_clip"][::core::mem::align_of::<v4l2_clip>() - 4usize];
    ["Offset of field: v4l2_clip::c"][::core::mem::offset_of!(v4l2_clip, c) - 0usize];
    ["Offset of field: v4l2_clip::next"][::core::mem::offset_of!(v4l2_clip, next) - 16usize];
};
impl Default for v4l2_clip {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct v4l2_window {
    pub w: v4l2_rect,
    pub field: __u32,
    pub chromakey: __u32,
    pub clips: *mut v4l2_clip,
    pub clipcount: __u32,
    pub bitmap: *mut libc::c_void,
    pub global_alpha: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_window"][::core::mem::size_of::<v4l2_window>() - 40usize];
    ["Alignment of v4l2_window"][::core::mem::align_of::<v4l2_window>() - 4usize];
    ["Offset of field: v4l2_window::w"][::core::mem::offset_of!(v4l2_window, w) - 0usize];
    ["Offset of field: v4l2_window::field"][::core::mem::offset_of!(v4l2_window, field) - 16usize];
    ["Offset of field: v4l2_window::chromakey"]
        [::core::mem::offset_of!(v4l2_window, chromakey) - 20usize];
    ["Offset of field: v4l2_window::clips"][::core::mem::offset_of!(v4l2_window, clips) - 24usize];
    ["Offset of field: v4l2_window::clipcount"]
        [::core::mem::offset_of!(v4l2_window, clipcount) - 28usize];
    ["Offset of field: v4l2_window::bitmap"]
        [::core::mem::offset_of!(v4l2_window, bitmap) - 32usize];
    ["Offset of field: v4l2_window::global_alpha"]
        [::core::mem::offset_of!(v4l2_window, global_alpha) - 36usize];
};
impl Default for v4l2_window {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_captureparm {
    pub capability: __u32,
    pub capturemode: __u32,
    pub timeperframe: v4l2_fract,
    pub extendedmode: __u32,
    pub readbuffers: __u32,
    pub reserved: [__u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_captureparm"][::core::mem::size_of::<v4l2_captureparm>() - 40usize];
    ["Alignment of v4l2_captureparm"][::core::mem::align_of::<v4l2_captureparm>() - 4usize];
    ["Offset of field: v4l2_captureparm::capability"]
        [::core::mem::offset_of!(v4l2_captureparm, capability) - 0usize];
    ["Offset of field: v4l2_captureparm::capturemode"]
        [::core::mem::offset_of!(v4l2_captureparm, capturemode) - 4usize];
    ["Offset of field: v4l2_captureparm::timeperframe"]
        [::core::mem::offset_of!(v4l2_captureparm, timeperframe) - 8usize];
    ["Offset of field: v4l2_captureparm::extendedmode"]
        [::core::mem::offset_of!(v4l2_captureparm, extendedmode) - 16usize];
    ["Offset of field: v4l2_captureparm::readbuffers"]
        [::core::mem::offset_of!(v4l2_captureparm, readbuffers) - 20usize];
    ["Offset of field: v4l2_captureparm::reserved"]
        [::core::mem::offset_of!(v4l2_captureparm, reserved) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_outputparm {
    pub capability: __u32,
    pub outputmode: __u32,
    pub timeperframe: v4l2_fract,
    pub extendedmode: __u32,
    pub writebuffers: __u32,
    pub reserved: [__u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_outputparm"][::core::mem::size_of::<v4l2_outputparm>() - 40usize];
    ["Alignment of v4l2_outputparm"][::core::mem::align_of::<v4l2_outputparm>() - 4usize];
    ["Offset of field: v4l2_outputparm::capability"]
        [::core::mem::offset_of!(v4l2_outputparm, capability) - 0usize];
    ["Offset of field: v4l2_outputparm::outputmode"]
        [::core::mem::offset_of!(v4l2_outputparm, outputmode) - 4usize];
    ["Offset of field: v4l2_outputparm::timeperframe"]
        [::core::mem::offset_of!(v4l2_outputparm, timeperframe) - 8usize];
    ["Offset of field: v4l2_outputparm::extendedmode"]
        [::core::mem::offset_of!(v4l2_outputparm, extendedmode) - 16usize];
    ["Offset of field: v4l2_outputparm::writebuffers"]
        [::core::mem::offset_of!(v4l2_outputparm, writebuffers) - 20usize];
    ["Offset of field: v4l2_outputparm::reserved"]
        [::core::mem::offset_of!(v4l2_outputparm, reserved) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_cropcap {
    pub type_: __u32,
    pub bounds: v4l2_rect,
    pub defrect: v4l2_rect,
    pub pixelaspect: v4l2_fract,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_cropcap"][::core::mem::size_of::<v4l2_cropcap>() - 44usize];
    ["Alignment of v4l2_cropcap"][::core::mem::align_of::<v4l2_cropcap>() - 4usize];
    ["Offset of field: v4l2_cropcap::type_"][::core::mem::offset_of!(v4l2_cropcap, type_) - 0usize];
    ["Offset of field: v4l2_cropcap::bounds"]
        [::core::mem::offset_of!(v4l2_cropcap, bounds) - 4usize];
    ["Offset of field: v4l2_cropcap::defrect"]
        [::core::mem::offset_of!(v4l2_cropcap, defrect) - 20usize];
    ["Offset of field: v4l2_cropcap::pixelaspect"]
        [::core::mem::offset_of!(v4l2_cropcap, pixelaspect) - 36usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_crop {
    pub type_: __u32,
    pub c: v4l2_rect,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_crop"][::core::mem::size_of::<v4l2_crop>() - 20usize];
    ["Alignment of v4l2_crop"][::core::mem::align_of::<v4l2_crop>() - 4usize];
    ["Offset of field: v4l2_crop::type_"][::core::mem::offset_of!(v4l2_crop, type_) - 0usize];
    ["Offset of field: v4l2_crop::c"][::core::mem::offset_of!(v4l2_crop, c) - 4usize];
};
#[doc = " struct v4l2_selection - selection info\n @type:\tbuffer type (do not use *_MPLANE types)\n @target:\tSelection target, used to choose one of possible rectangles;\n\t\tdefined in v4l2-common.h; V4L2_SEL_TGT_* .\n @flags:\tconstraints flags, defined in v4l2-common.h; V4L2_SEL_FLAG_*.\n @r:\t\tcoordinates of selection window\n @reserved:\tfor future use, rounds structure size to 64 bytes, set to zero\n\n Hardware may use multiple helper windows to process a video stream.\n The structure is used to exchange this selection areas between\n an application and a driver."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_selection {
    pub type_: __u32,
    pub target: __u32,
    pub flags: __u32,
    pub r: v4l2_rect,
    pub reserved: [__u32; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_selection"][::core::mem::size_of::<v4l2_selection>() - 64usize];
    ["Alignment of v4l2_selection"][::core::mem::align_of::<v4l2_selection>() - 4usize];
    ["Offset of field: v4l2_selection::type_"]
        [::core::mem::offset_of!(v4l2_selection, type_) - 0usize];
    ["Offset of field: v4l2_selection::target"]
        [::core::mem::offset_of!(v4l2_selection, target) - 4usize];
    ["Offset of field: v4l2_selection::flags"]
        [::core::mem::offset_of!(v4l2_selection, flags) - 8usize];
    ["Offset of field: v4l2_selection::r"][::core::mem::offset_of!(v4l2_selection, r) - 12usize];
    ["Offset of field: v4l2_selection::reserved"]
        [::core::mem::offset_of!(v4l2_selection, reserved) - 28usize];
};
pub type v4l2_std_id = __u64;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_standard {
    pub index: __u32,
    pub id: v4l2_std_id,
    pub name: [__u8; 24usize],
    pub frameperiod: v4l2_fract,
    pub framelines: __u32,
    pub reserved: [__u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_standard"][::core::mem::size_of::<v4l2_standard>() - 72usize];
    ["Alignment of v4l2_standard"][::core::mem::align_of::<v4l2_standard>() - 8usize];
    ["Offset of field: v4l2_standard::index"]
        [::core::mem::offset_of!(v4l2_standard, index) - 0usize];
    ["Offset of field: v4l2_standard::id"][::core::mem::offset_of!(v4l2_standard, id) - 8usize];
    ["Offset of field: v4l2_standard::name"]
        [::core::mem::offset_of!(v4l2_standard, name) - 16usize];
    ["Offset of field: v4l2_standard::frameperiod"]
        [::core::mem::offset_of!(v4l2_standard, frameperiod) - 40usize];
    ["Offset of field: v4l2_standard::framelines"]
        [::core::mem::offset_of!(v4l2_standard, framelines) - 48usize];
    ["Offset of field: v4l2_standard::reserved"]
        [::core::mem::offset_of!(v4l2_standard, reserved) - 52usize];
};
#[doc = " struct v4l2_bt_timings - BT.656/BT.1120 timing data\n @width:\ttotal width of the active video in pixels\n @height:\ttotal height of the active video in lines\n @interlaced:\tInterlaced or progressive\n @polarities:\tPositive or negative polarities\n @pixelclock:\tPixel clock in HZ. Ex. 74.25MHz->74250000\n @hfrontporch:Horizontal front porch in pixels\n @hsync:\tHorizontal Sync length in pixels\n @hbackporch:\tHorizontal back porch in pixels\n @vfrontporch:Vertical front porch in lines\n @vsync:\tVertical Sync length in lines\n @vbackporch:\tVertical back porch in lines\n @il_vfrontporch:Vertical front porch for the even field\n\t\t(aka field 2) of interlaced field formats\n @il_vsync:\tVertical Sync length for the even field\n\t\t(aka field 2) of interlaced field formats\n @il_vbackporch:Vertical back porch for the even field\n\t\t(aka field 2) of interlaced field formats\n @standards:\tStandards the timing belongs to\n @flags:\tFlags\n @picture_aspect: The picture aspect ratio (hor/vert).\n @cea861_vic:\tVIC code as per the CEA-861 standard.\n @hdmi_vic:\tVIC code as per the HDMI standard.\n @reserved:\tReserved fields, must be zeroed.\n\n A note regarding vertical interlaced timings: height refers to the total\n height of the active video frame (= two fields). The blanking timings refer\n to the blanking of each field. So the height of the total frame is\n calculated as follows:\n\n tot_height = height + vfrontporch + vsync + vbackporch +\n                       il_vfrontporch + il_vsync + il_vbackporch\n\n The active height of each field is height / 2."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct v4l2_bt_timings {
    pub width: __u32,
    pub height: __u32,
    pub interlaced: __u32,
    pub polarities: __u32,
    pub pixelclock: __u64,
    pub hfrontporch: __u32,
    pub hsync: __u32,
    pub hbackporch: __u32,
    pub vfrontporch: __u32,
    pub vsync: __u32,
    pub vbackporch: __u32,
    pub il_vfrontporch: __u32,
    pub il_vsync: __u32,
    pub il_vbackporch: __u32,
    pub standards: __u32,
    pub flags: __u32,
    pub picture_aspect: v4l2_fract,
    pub cea861_vic: __u8,
    pub hdmi_vic: __u8,
    pub reserved: [__u8; 46usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_bt_timings"][::core::mem::size_of::<v4l2_bt_timings>() - 124usize];
    ["Alignment of v4l2_bt_timings"][::core::mem::align_of::<v4l2_bt_timings>() - 1usize];
    ["Offset of field: v4l2_bt_timings::width"]
        [::core::mem::offset_of!(v4l2_bt_timings, width) - 0usize];
    ["Offset of field: v4l2_bt_timings::height"]
        [::core::mem::offset_of!(v4l2_bt_timings, height) - 4usize];
    ["Offset of field: v4l2_bt_timings::interlaced"]
        [::core::mem::offset_of!(v4l2_bt_timings, interlaced) - 8usize];
    ["Offset of field: v4l2_bt_timings::polarities"]
        [::core::mem::offset_of!(v4l2_bt_timings, polarities) - 12usize];
    ["Offset of field: v4l2_bt_timings::pixelclock"]
        [::core::mem::offset_of!(v4l2_bt_timings, pixelclock) - 16usize];
    ["Offset of field: v4l2_bt_timings::hfrontporch"]
        [::core::mem::offset_of!(v4l2_bt_timings, hfrontporch) - 24usize];
    ["Offset of field: v4l2_bt_timings::hsync"]
        [::core::mem::offset_of!(v4l2_bt_timings, hsync) - 28usize];
    ["Offset of field: v4l2_bt_timings::hbackporch"]
        [::core::mem::offset_of!(v4l2_bt_timings, hbackporch) - 32usize];
    ["Offset of field: v4l2_bt_timings::vfrontporch"]
        [::core::mem::offset_of!(v4l2_bt_timings, vfrontporch) - 36usize];
    ["Offset of field: v4l2_bt_timings::vsync"]
        [::core::mem::offset_of!(v4l2_bt_timings, vsync) - 40usize];
    ["Offset of field: v4l2_bt_timings::vbackporch"]
        [::core::mem::offset_of!(v4l2_bt_timings, vbackporch) - 44usize];
    ["Offset of field: v4l2_bt_timings::il_vfrontporch"]
        [::core::mem::offset_of!(v4l2_bt_timings, il_vfrontporch) - 48usize];
    ["Offset of field: v4l2_bt_timings::il_vsync"]
        [::core::mem::offset_of!(v4l2_bt_timings, il_vsync) - 52usize];
    ["Offset of field: v4l2_bt_timings::il_vbackporch"]
        [::core::mem::offset_of!(v4l2_bt_timings, il_vbackporch) - 56usize];
    ["Offset of field: v4l2_bt_timings::standards"]
        [::core::mem::offset_of!(v4l2_bt_timings, standards) - 60usize];
    ["Offset of field: v4l2_bt_timings::flags"]
        [::core::mem::offset_of!(v4l2_bt_timings, flags) - 64usize];
    ["Offset of field: v4l2_bt_timings::picture_aspect"]
        [::core::mem::offset_of!(v4l2_bt_timings, picture_aspect) - 68usize];
    ["Offset of field: v4l2_bt_timings::cea861_vic"]
        [::core::mem::offset_of!(v4l2_bt_timings, cea861_vic) - 76usize];
    ["Offset of field: v4l2_bt_timings::hdmi_vic"]
        [::core::mem::offset_of!(v4l2_bt_timings, hdmi_vic) - 77usize];
    ["Offset of field: v4l2_bt_timings::reserved"]
        [::core::mem::offset_of!(v4l2_bt_timings, reserved) - 78usize];
};
impl Default for v4l2_bt_timings {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " struct v4l2_dv_timings - DV timings\n @type:\tthe type of the timings\n @bt:\tBT656/1120 timings"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct v4l2_dv_timings {
    pub type_: __u32,
    pub __anon1: v4l2_dv_timings__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_dv_timings__bindgen_ty_1 {
    pub bt: v4l2_bt_timings,
    pub reserved: [__u32; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_dv_timings__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_dv_timings__bindgen_ty_1>() - 128usize];
    ["Alignment of v4l2_dv_timings__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_dv_timings__bindgen_ty_1>() - 4usize];
    ["Offset of field: v4l2_dv_timings__bindgen_ty_1::bt"]
        [::core::mem::offset_of!(v4l2_dv_timings__bindgen_ty_1, bt) - 0usize];
    ["Offset of field: v4l2_dv_timings__bindgen_ty_1::reserved"]
        [::core::mem::offset_of!(v4l2_dv_timings__bindgen_ty_1, reserved) - 0usize];
};
impl Default for v4l2_dv_timings__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_dv_timings"][::core::mem::size_of::<v4l2_dv_timings>() - 132usize];
    ["Alignment of v4l2_dv_timings"][::core::mem::align_of::<v4l2_dv_timings>() - 1usize];
    ["Offset of field: v4l2_dv_timings::type_"]
        [::core::mem::offset_of!(v4l2_dv_timings, type_) - 0usize];
};
impl Default for v4l2_dv_timings {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " struct v4l2_enum_dv_timings - DV timings enumeration\n @index:\tenumeration index\n @pad:\tthe pad number for which to enumerate timings (used with\n\t\tv4l-subdev nodes only)\n @reserved:\tmust be zeroed\n @timings:\tthe timings for the given index"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct v4l2_enum_dv_timings {
    pub index: __u32,
    pub pad: __u32,
    pub reserved: [__u32; 2usize],
    pub timings: v4l2_dv_timings,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_enum_dv_timings"][::core::mem::size_of::<v4l2_enum_dv_timings>() - 148usize];
    ["Alignment of v4l2_enum_dv_timings"][::core::mem::align_of::<v4l2_enum_dv_timings>() - 4usize];
    ["Offset of field: v4l2_enum_dv_timings::index"]
        [::core::mem::offset_of!(v4l2_enum_dv_timings, index) - 0usize];
    ["Offset of field: v4l2_enum_dv_timings::pad"]
        [::core::mem::offset_of!(v4l2_enum_dv_timings, pad) - 4usize];
    ["Offset of field: v4l2_enum_dv_timings::reserved"]
        [::core::mem::offset_of!(v4l2_enum_dv_timings, reserved) - 8usize];
    ["Offset of field: v4l2_enum_dv_timings::timings"]
        [::core::mem::offset_of!(v4l2_enum_dv_timings, timings) - 16usize];
};
impl Default for v4l2_enum_dv_timings {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " struct v4l2_bt_timings_cap - BT.656/BT.1120 timing capabilities\n @min_width:\t\twidth in pixels\n @max_width:\t\twidth in pixels\n @min_height:\t\theight in lines\n @max_height:\t\theight in lines\n @min_pixelclock:\tPixel clock in HZ. Ex. 74.25MHz->74250000\n @max_pixelclock:\tPixel clock in HZ. Ex. 74.25MHz->74250000\n @standards:\t\tSupported standards\n @capabilities:\tSupported capabilities\n @reserved:\t\tMust be zeroed"]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_bt_timings_cap {
    pub min_width: __u32,
    pub max_width: __u32,
    pub min_height: __u32,
    pub max_height: __u32,
    pub min_pixelclock: __u64,
    pub max_pixelclock: __u64,
    pub standards: __u32,
    pub capabilities: __u32,
    pub reserved: [__u32; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_bt_timings_cap"][::core::mem::size_of::<v4l2_bt_timings_cap>() - 104usize];
    ["Alignment of v4l2_bt_timings_cap"][::core::mem::align_of::<v4l2_bt_timings_cap>() - 1usize];
    ["Offset of field: v4l2_bt_timings_cap::min_width"]
        [::core::mem::offset_of!(v4l2_bt_timings_cap, min_width) - 0usize];
    ["Offset of field: v4l2_bt_timings_cap::max_width"]
        [::core::mem::offset_of!(v4l2_bt_timings_cap, max_width) - 4usize];
    ["Offset of field: v4l2_bt_timings_cap::min_height"]
        [::core::mem::offset_of!(v4l2_bt_timings_cap, min_height) - 8usize];
    ["Offset of field: v4l2_bt_timings_cap::max_height"]
        [::core::mem::offset_of!(v4l2_bt_timings_cap, max_height) - 12usize];
    ["Offset of field: v4l2_bt_timings_cap::min_pixelclock"]
        [::core::mem::offset_of!(v4l2_bt_timings_cap, min_pixelclock) - 16usize];
    ["Offset of field: v4l2_bt_timings_cap::max_pixelclock"]
        [::core::mem::offset_of!(v4l2_bt_timings_cap, max_pixelclock) - 24usize];
    ["Offset of field: v4l2_bt_timings_cap::standards"]
        [::core::mem::offset_of!(v4l2_bt_timings_cap, standards) - 32usize];
    ["Offset of field: v4l2_bt_timings_cap::capabilities"]
        [::core::mem::offset_of!(v4l2_bt_timings_cap, capabilities) - 36usize];
    ["Offset of field: v4l2_bt_timings_cap::reserved"]
        [::core::mem::offset_of!(v4l2_bt_timings_cap, reserved) - 40usize];
};
#[doc = " struct v4l2_dv_timings_cap - DV timings capabilities\n @type:\tthe type of the timings (same as in struct v4l2_dv_timings)\n @pad:\tthe pad number for which to query capabilities (used with\n\t\tv4l-subdev nodes only)\n @bt:\t\tthe BT656/1120 timings capabilities"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct v4l2_dv_timings_cap {
    pub type_: __u32,
    pub pad: __u32,
    pub reserved: [__u32; 2usize],
    pub __anon1: v4l2_dv_timings_cap__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_dv_timings_cap__bindgen_ty_1 {
    pub bt: v4l2_bt_timings_cap,
    pub raw_data: [__u32; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_dv_timings_cap__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_dv_timings_cap__bindgen_ty_1>() - 128usize];
    ["Alignment of v4l2_dv_timings_cap__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_dv_timings_cap__bindgen_ty_1>() - 4usize];
    ["Offset of field: v4l2_dv_timings_cap__bindgen_ty_1::bt"]
        [::core::mem::offset_of!(v4l2_dv_timings_cap__bindgen_ty_1, bt) - 0usize];
    ["Offset of field: v4l2_dv_timings_cap__bindgen_ty_1::raw_data"]
        [::core::mem::offset_of!(v4l2_dv_timings_cap__bindgen_ty_1, raw_data) - 0usize];
};
impl Default for v4l2_dv_timings_cap__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_dv_timings_cap"][::core::mem::size_of::<v4l2_dv_timings_cap>() - 144usize];
    ["Alignment of v4l2_dv_timings_cap"][::core::mem::align_of::<v4l2_dv_timings_cap>() - 4usize];
    ["Offset of field: v4l2_dv_timings_cap::type_"]
        [::core::mem::offset_of!(v4l2_dv_timings_cap, type_) - 0usize];
    ["Offset of field: v4l2_dv_timings_cap::pad"]
        [::core::mem::offset_of!(v4l2_dv_timings_cap, pad) - 4usize];
    ["Offset of field: v4l2_dv_timings_cap::reserved"]
        [::core::mem::offset_of!(v4l2_dv_timings_cap, reserved) - 8usize];
};
impl Default for v4l2_dv_timings_cap {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_input {
    pub index: __u32,
    pub name: [__u8; 32usize],
    pub type_: __u32,
    pub audioset: __u32,
    pub tuner: __u32,
    pub std: v4l2_std_id,
    pub status: __u32,
    pub capabilities: __u32,
    pub reserved: [__u32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_input"][::core::mem::size_of::<v4l2_input>() - 80usize];
    ["Alignment of v4l2_input"][::core::mem::align_of::<v4l2_input>() - 8usize];
    ["Offset of field: v4l2_input::index"][::core::mem::offset_of!(v4l2_input, index) - 0usize];
    ["Offset of field: v4l2_input::name"][::core::mem::offset_of!(v4l2_input, name) - 4usize];
    ["Offset of field: v4l2_input::type_"][::core::mem::offset_of!(v4l2_input, type_) - 36usize];
    ["Offset of field: v4l2_input::audioset"]
        [::core::mem::offset_of!(v4l2_input, audioset) - 40usize];
    ["Offset of field: v4l2_input::tuner"][::core::mem::offset_of!(v4l2_input, tuner) - 44usize];
    ["Offset of field: v4l2_input::std"][::core::mem::offset_of!(v4l2_input, std) - 48usize];
    ["Offset of field: v4l2_input::status"][::core::mem::offset_of!(v4l2_input, status) - 56usize];
    ["Offset of field: v4l2_input::capabilities"]
        [::core::mem::offset_of!(v4l2_input, capabilities) - 60usize];
    ["Offset of field: v4l2_input::reserved"]
        [::core::mem::offset_of!(v4l2_input, reserved) - 64usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_output {
    pub index: __u32,
    pub name: [__u8; 32usize],
    pub type_: __u32,
    pub audioset: __u32,
    pub modulator: __u32,
    pub std: v4l2_std_id,
    pub capabilities: __u32,
    pub reserved: [__u32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_output"][::core::mem::size_of::<v4l2_output>() - 72usize];
    ["Alignment of v4l2_output"][::core::mem::align_of::<v4l2_output>() - 8usize];
    ["Offset of field: v4l2_output::index"][::core::mem::offset_of!(v4l2_output, index) - 0usize];
    ["Offset of field: v4l2_output::name"][::core::mem::offset_of!(v4l2_output, name) - 4usize];
    ["Offset of field: v4l2_output::type_"][::core::mem::offset_of!(v4l2_output, type_) - 36usize];
    ["Offset of field: v4l2_output::audioset"]
        [::core::mem::offset_of!(v4l2_output, audioset) - 40usize];
    ["Offset of field: v4l2_output::modulator"]
        [::core::mem::offset_of!(v4l2_output, modulator) - 44usize];
    ["Offset of field: v4l2_output::std"][::core::mem::offset_of!(v4l2_output, std) - 48usize];
    ["Offset of field: v4l2_output::capabilities"]
        [::core::mem::offset_of!(v4l2_output, capabilities) - 56usize];
    ["Offset of field: v4l2_output::reserved"]
        [::core::mem::offset_of!(v4l2_output, reserved) - 60usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_control {
    pub id: __u32,
    pub value: __s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_control"][::core::mem::size_of::<v4l2_control>() - 8usize];
    ["Alignment of v4l2_control"][::core::mem::align_of::<v4l2_control>() - 4usize];
    ["Offset of field: v4l2_control::id"][::core::mem::offset_of!(v4l2_control, id) - 0usize];
    ["Offset of field: v4l2_control::value"][::core::mem::offset_of!(v4l2_control, value) - 4usize];
};
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct v4l2_ext_control {
    pub id: __u32,
    pub size: __u32,
    pub reserved2: [__u32; 1usize],
    pub __anon1: v4l2_ext_control__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_ext_control__bindgen_ty_1 {
    pub value: __s32,
    pub value64: __s64,
    pub string: *mut libc::c_char,
    pub p_u8: *mut __u8,
    pub p_u16: *mut __u16,
    pub p_u32: *mut __u32,
    pub ptr: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_ext_control__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_ext_control__bindgen_ty_1>() - 8usize];
    ["Alignment of v4l2_ext_control__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_ext_control__bindgen_ty_1>() - 8usize];
    ["Offset of field: v4l2_ext_control__bindgen_ty_1::value"]
        [::core::mem::offset_of!(v4l2_ext_control__bindgen_ty_1, value) - 0usize];
    ["Offset of field: v4l2_ext_control__bindgen_ty_1::value64"]
        [::core::mem::offset_of!(v4l2_ext_control__bindgen_ty_1, value64) - 0usize];
    ["Offset of field: v4l2_ext_control__bindgen_ty_1::string"]
        [::core::mem::offset_of!(v4l2_ext_control__bindgen_ty_1, string) - 0usize];
    ["Offset of field: v4l2_ext_control__bindgen_ty_1::p_u8"]
        [::core::mem::offset_of!(v4l2_ext_control__bindgen_ty_1, p_u8) - 0usize];
    ["Offset of field: v4l2_ext_control__bindgen_ty_1::p_u16"]
        [::core::mem::offset_of!(v4l2_ext_control__bindgen_ty_1, p_u16) - 0usize];
    ["Offset of field: v4l2_ext_control__bindgen_ty_1::p_u32"]
        [::core::mem::offset_of!(v4l2_ext_control__bindgen_ty_1, p_u32) - 0usize];
    ["Offset of field: v4l2_ext_control__bindgen_ty_1::ptr"]
        [::core::mem::offset_of!(v4l2_ext_control__bindgen_ty_1, ptr) - 0usize];
};
impl Default for v4l2_ext_control__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_ext_control"][::core::mem::size_of::<v4l2_ext_control>() - 20usize];
    ["Alignment of v4l2_ext_control"][::core::mem::align_of::<v4l2_ext_control>() - 1usize];
    ["Offset of field: v4l2_ext_control::id"]
        [::core::mem::offset_of!(v4l2_ext_control, id) - 0usize];
    ["Offset of field: v4l2_ext_control::size"]
        [::core::mem::offset_of!(v4l2_ext_control, size) - 4usize];
    ["Offset of field: v4l2_ext_control::reserved2"]
        [::core::mem::offset_of!(v4l2_ext_control, reserved2) - 8usize];
};
impl Default for v4l2_ext_control {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct v4l2_ext_controls {
    pub __anon1: v4l2_ext_controls__bindgen_ty_1,
    pub count: __u32,
    pub error_idx: __u32,
    pub request_fd: __s32,
    pub reserved: [__u32; 1usize],
    pub controls: *mut v4l2_ext_control,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_ext_controls__bindgen_ty_1 {
    pub ctrl_class: __u32,
    pub which: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_ext_controls__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_ext_controls__bindgen_ty_1>() - 4usize];
    ["Alignment of v4l2_ext_controls__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_ext_controls__bindgen_ty_1>() - 4usize];
    ["Offset of field: v4l2_ext_controls__bindgen_ty_1::ctrl_class"]
        [::core::mem::offset_of!(v4l2_ext_controls__bindgen_ty_1, ctrl_class) - 0usize];
    ["Offset of field: v4l2_ext_controls__bindgen_ty_1::which"]
        [::core::mem::offset_of!(v4l2_ext_controls__bindgen_ty_1, which) - 0usize];
};
impl Default for v4l2_ext_controls__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_ext_controls"][::core::mem::size_of::<v4l2_ext_controls>() - 24usize];
    ["Alignment of v4l2_ext_controls"][::core::mem::align_of::<v4l2_ext_controls>() - 4usize];
    ["Offset of field: v4l2_ext_controls::count"]
        [::core::mem::offset_of!(v4l2_ext_controls, count) - 4usize];
    ["Offset of field: v4l2_ext_controls::error_idx"]
        [::core::mem::offset_of!(v4l2_ext_controls, error_idx) - 8usize];
    ["Offset of field: v4l2_ext_controls::request_fd"]
        [::core::mem::offset_of!(v4l2_ext_controls, request_fd) - 12usize];
    ["Offset of field: v4l2_ext_controls::reserved"]
        [::core::mem::offset_of!(v4l2_ext_controls, reserved) - 16usize];
    ["Offset of field: v4l2_ext_controls::controls"]
        [::core::mem::offset_of!(v4l2_ext_controls, controls) - 20usize];
};
impl Default for v4l2_ext_controls {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl v4l2_ctrl_type {
    pub const V4L2_CTRL_TYPE_U8: v4l2_ctrl_type = v4l2_ctrl_type::V4L2_CTRL_COMPOUND_TYPES;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum v4l2_ctrl_type {
    V4L2_CTRL_TYPE_INTEGER = 1,
    V4L2_CTRL_TYPE_BOOLEAN = 2,
    V4L2_CTRL_TYPE_MENU = 3,
    V4L2_CTRL_TYPE_BUTTON = 4,
    V4L2_CTRL_TYPE_INTEGER64 = 5,
    V4L2_CTRL_TYPE_CTRL_CLASS = 6,
    V4L2_CTRL_TYPE_STRING = 7,
    V4L2_CTRL_TYPE_BITMASK = 8,
    V4L2_CTRL_TYPE_INTEGER_MENU = 9,
    V4L2_CTRL_COMPOUND_TYPES = 256,
    V4L2_CTRL_TYPE_U16 = 257,
    V4L2_CTRL_TYPE_U32 = 258,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_queryctrl {
    pub id: __u32,
    pub type_: __u32,
    pub name: [__u8; 32usize],
    pub minimum: __s32,
    pub maximum: __s32,
    pub step: __s32,
    pub default_value: __s32,
    pub flags: __u32,
    pub reserved: [__u32; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_queryctrl"][::core::mem::size_of::<v4l2_queryctrl>() - 68usize];
    ["Alignment of v4l2_queryctrl"][::core::mem::align_of::<v4l2_queryctrl>() - 4usize];
    ["Offset of field: v4l2_queryctrl::id"][::core::mem::offset_of!(v4l2_queryctrl, id) - 0usize];
    ["Offset of field: v4l2_queryctrl::type_"]
        [::core::mem::offset_of!(v4l2_queryctrl, type_) - 4usize];
    ["Offset of field: v4l2_queryctrl::name"]
        [::core::mem::offset_of!(v4l2_queryctrl, name) - 8usize];
    ["Offset of field: v4l2_queryctrl::minimum"]
        [::core::mem::offset_of!(v4l2_queryctrl, minimum) - 40usize];
    ["Offset of field: v4l2_queryctrl::maximum"]
        [::core::mem::offset_of!(v4l2_queryctrl, maximum) - 44usize];
    ["Offset of field: v4l2_queryctrl::step"]
        [::core::mem::offset_of!(v4l2_queryctrl, step) - 48usize];
    ["Offset of field: v4l2_queryctrl::default_value"]
        [::core::mem::offset_of!(v4l2_queryctrl, default_value) - 52usize];
    ["Offset of field: v4l2_queryctrl::flags"]
        [::core::mem::offset_of!(v4l2_queryctrl, flags) - 56usize];
    ["Offset of field: v4l2_queryctrl::reserved"]
        [::core::mem::offset_of!(v4l2_queryctrl, reserved) - 60usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_query_ext_ctrl {
    pub id: __u32,
    pub type_: __u32,
    pub name: [libc::c_char; 32usize],
    pub minimum: __s64,
    pub maximum: __s64,
    pub step: __u64,
    pub default_value: __s64,
    pub flags: __u32,
    pub elem_size: __u32,
    pub elems: __u32,
    pub nr_of_dims: __u32,
    pub dims: [__u32; 4usize],
    pub reserved: [__u32; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_query_ext_ctrl"][::core::mem::size_of::<v4l2_query_ext_ctrl>() - 232usize];
    ["Alignment of v4l2_query_ext_ctrl"][::core::mem::align_of::<v4l2_query_ext_ctrl>() - 8usize];
    ["Offset of field: v4l2_query_ext_ctrl::id"]
        [::core::mem::offset_of!(v4l2_query_ext_ctrl, id) - 0usize];
    ["Offset of field: v4l2_query_ext_ctrl::type_"]
        [::core::mem::offset_of!(v4l2_query_ext_ctrl, type_) - 4usize];
    ["Offset of field: v4l2_query_ext_ctrl::name"]
        [::core::mem::offset_of!(v4l2_query_ext_ctrl, name) - 8usize];
    ["Offset of field: v4l2_query_ext_ctrl::minimum"]
        [::core::mem::offset_of!(v4l2_query_ext_ctrl, minimum) - 40usize];
    ["Offset of field: v4l2_query_ext_ctrl::maximum"]
        [::core::mem::offset_of!(v4l2_query_ext_ctrl, maximum) - 48usize];
    ["Offset of field: v4l2_query_ext_ctrl::step"]
        [::core::mem::offset_of!(v4l2_query_ext_ctrl, step) - 56usize];
    ["Offset of field: v4l2_query_ext_ctrl::default_value"]
        [::core::mem::offset_of!(v4l2_query_ext_ctrl, default_value) - 64usize];
    ["Offset of field: v4l2_query_ext_ctrl::flags"]
        [::core::mem::offset_of!(v4l2_query_ext_ctrl, flags) - 72usize];
    ["Offset of field: v4l2_query_ext_ctrl::elem_size"]
        [::core::mem::offset_of!(v4l2_query_ext_ctrl, elem_size) - 76usize];
    ["Offset of field: v4l2_query_ext_ctrl::elems"]
        [::core::mem::offset_of!(v4l2_query_ext_ctrl, elems) - 80usize];
    ["Offset of field: v4l2_query_ext_ctrl::nr_of_dims"]
        [::core::mem::offset_of!(v4l2_query_ext_ctrl, nr_of_dims) - 84usize];
    ["Offset of field: v4l2_query_ext_ctrl::dims"]
        [::core::mem::offset_of!(v4l2_query_ext_ctrl, dims) - 88usize];
    ["Offset of field: v4l2_query_ext_ctrl::reserved"]
        [::core::mem::offset_of!(v4l2_query_ext_ctrl, reserved) - 104usize];
};
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct v4l2_querymenu {
    pub id: __u32,
    pub index: __u32,
    pub __anon1: v4l2_querymenu__bindgen_ty_1,
    pub reserved: __u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_querymenu__bindgen_ty_1 {
    pub name: [__u8; 32usize],
    pub value: __s64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_querymenu__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_querymenu__bindgen_ty_1>() - 32usize];
    ["Alignment of v4l2_querymenu__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_querymenu__bindgen_ty_1>() - 8usize];
    ["Offset of field: v4l2_querymenu__bindgen_ty_1::name"]
        [::core::mem::offset_of!(v4l2_querymenu__bindgen_ty_1, name) - 0usize];
    ["Offset of field: v4l2_querymenu__bindgen_ty_1::value"]
        [::core::mem::offset_of!(v4l2_querymenu__bindgen_ty_1, value) - 0usize];
};
impl Default for v4l2_querymenu__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_querymenu"][::core::mem::size_of::<v4l2_querymenu>() - 44usize];
    ["Alignment of v4l2_querymenu"][::core::mem::align_of::<v4l2_querymenu>() - 1usize];
    ["Offset of field: v4l2_querymenu::id"][::core::mem::offset_of!(v4l2_querymenu, id) - 0usize];
    ["Offset of field: v4l2_querymenu::index"]
        [::core::mem::offset_of!(v4l2_querymenu, index) - 4usize];
    ["Offset of field: v4l2_querymenu::reserved"]
        [::core::mem::offset_of!(v4l2_querymenu, reserved) - 40usize];
};
impl Default for v4l2_querymenu {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_tuner {
    pub index: __u32,
    pub name: [__u8; 32usize],
    pub type_: __u32,
    pub capability: __u32,
    pub rangelow: __u32,
    pub rangehigh: __u32,
    pub rxsubchans: __u32,
    pub audmode: __u32,
    pub signal: __s32,
    pub afc: __s32,
    pub reserved: [__u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_tuner"][::core::mem::size_of::<v4l2_tuner>() - 84usize];
    ["Alignment of v4l2_tuner"][::core::mem::align_of::<v4l2_tuner>() - 4usize];
    ["Offset of field: v4l2_tuner::index"][::core::mem::offset_of!(v4l2_tuner, index) - 0usize];
    ["Offset of field: v4l2_tuner::name"][::core::mem::offset_of!(v4l2_tuner, name) - 4usize];
    ["Offset of field: v4l2_tuner::type_"][::core::mem::offset_of!(v4l2_tuner, type_) - 36usize];
    ["Offset of field: v4l2_tuner::capability"]
        [::core::mem::offset_of!(v4l2_tuner, capability) - 40usize];
    ["Offset of field: v4l2_tuner::rangelow"]
        [::core::mem::offset_of!(v4l2_tuner, rangelow) - 44usize];
    ["Offset of field: v4l2_tuner::rangehigh"]
        [::core::mem::offset_of!(v4l2_tuner, rangehigh) - 48usize];
    ["Offset of field: v4l2_tuner::rxsubchans"]
        [::core::mem::offset_of!(v4l2_tuner, rxsubchans) - 52usize];
    ["Offset of field: v4l2_tuner::audmode"]
        [::core::mem::offset_of!(v4l2_tuner, audmode) - 56usize];
    ["Offset of field: v4l2_tuner::signal"][::core::mem::offset_of!(v4l2_tuner, signal) - 60usize];
    ["Offset of field: v4l2_tuner::afc"][::core::mem::offset_of!(v4l2_tuner, afc) - 64usize];
    ["Offset of field: v4l2_tuner::reserved"]
        [::core::mem::offset_of!(v4l2_tuner, reserved) - 68usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_modulator {
    pub index: __u32,
    pub name: [__u8; 32usize],
    pub capability: __u32,
    pub rangelow: __u32,
    pub rangehigh: __u32,
    pub txsubchans: __u32,
    pub type_: __u32,
    pub reserved: [__u32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_modulator"][::core::mem::size_of::<v4l2_modulator>() - 68usize];
    ["Alignment of v4l2_modulator"][::core::mem::align_of::<v4l2_modulator>() - 4usize];
    ["Offset of field: v4l2_modulator::index"]
        [::core::mem::offset_of!(v4l2_modulator, index) - 0usize];
    ["Offset of field: v4l2_modulator::name"]
        [::core::mem::offset_of!(v4l2_modulator, name) - 4usize];
    ["Offset of field: v4l2_modulator::capability"]
        [::core::mem::offset_of!(v4l2_modulator, capability) - 36usize];
    ["Offset of field: v4l2_modulator::rangelow"]
        [::core::mem::offset_of!(v4l2_modulator, rangelow) - 40usize];
    ["Offset of field: v4l2_modulator::rangehigh"]
        [::core::mem::offset_of!(v4l2_modulator, rangehigh) - 44usize];
    ["Offset of field: v4l2_modulator::txsubchans"]
        [::core::mem::offset_of!(v4l2_modulator, txsubchans) - 48usize];
    ["Offset of field: v4l2_modulator::type_"]
        [::core::mem::offset_of!(v4l2_modulator, type_) - 52usize];
    ["Offset of field: v4l2_modulator::reserved"]
        [::core::mem::offset_of!(v4l2_modulator, reserved) - 56usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_frequency {
    pub tuner: __u32,
    pub type_: __u32,
    pub frequency: __u32,
    pub reserved: [__u32; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_frequency"][::core::mem::size_of::<v4l2_frequency>() - 44usize];
    ["Alignment of v4l2_frequency"][::core::mem::align_of::<v4l2_frequency>() - 4usize];
    ["Offset of field: v4l2_frequency::tuner"]
        [::core::mem::offset_of!(v4l2_frequency, tuner) - 0usize];
    ["Offset of field: v4l2_frequency::type_"]
        [::core::mem::offset_of!(v4l2_frequency, type_) - 4usize];
    ["Offset of field: v4l2_frequency::frequency"]
        [::core::mem::offset_of!(v4l2_frequency, frequency) - 8usize];
    ["Offset of field: v4l2_frequency::reserved"]
        [::core::mem::offset_of!(v4l2_frequency, reserved) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_frequency_band {
    pub tuner: __u32,
    pub type_: __u32,
    pub index: __u32,
    pub capability: __u32,
    pub rangelow: __u32,
    pub rangehigh: __u32,
    pub modulation: __u32,
    pub reserved: [__u32; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_frequency_band"][::core::mem::size_of::<v4l2_frequency_band>() - 64usize];
    ["Alignment of v4l2_frequency_band"][::core::mem::align_of::<v4l2_frequency_band>() - 4usize];
    ["Offset of field: v4l2_frequency_band::tuner"]
        [::core::mem::offset_of!(v4l2_frequency_band, tuner) - 0usize];
    ["Offset of field: v4l2_frequency_band::type_"]
        [::core::mem::offset_of!(v4l2_frequency_band, type_) - 4usize];
    ["Offset of field: v4l2_frequency_band::index"]
        [::core::mem::offset_of!(v4l2_frequency_band, index) - 8usize];
    ["Offset of field: v4l2_frequency_band::capability"]
        [::core::mem::offset_of!(v4l2_frequency_band, capability) - 12usize];
    ["Offset of field: v4l2_frequency_band::rangelow"]
        [::core::mem::offset_of!(v4l2_frequency_band, rangelow) - 16usize];
    ["Offset of field: v4l2_frequency_band::rangehigh"]
        [::core::mem::offset_of!(v4l2_frequency_band, rangehigh) - 20usize];
    ["Offset of field: v4l2_frequency_band::modulation"]
        [::core::mem::offset_of!(v4l2_frequency_band, modulation) - 24usize];
    ["Offset of field: v4l2_frequency_band::reserved"]
        [::core::mem::offset_of!(v4l2_frequency_band, reserved) - 28usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_hw_freq_seek {
    pub tuner: __u32,
    pub type_: __u32,
    pub seek_upward: __u32,
    pub wrap_around: __u32,
    pub spacing: __u32,
    pub rangelow: __u32,
    pub rangehigh: __u32,
    pub reserved: [__u32; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_hw_freq_seek"][::core::mem::size_of::<v4l2_hw_freq_seek>() - 48usize];
    ["Alignment of v4l2_hw_freq_seek"][::core::mem::align_of::<v4l2_hw_freq_seek>() - 4usize];
    ["Offset of field: v4l2_hw_freq_seek::tuner"]
        [::core::mem::offset_of!(v4l2_hw_freq_seek, tuner) - 0usize];
    ["Offset of field: v4l2_hw_freq_seek::type_"]
        [::core::mem::offset_of!(v4l2_hw_freq_seek, type_) - 4usize];
    ["Offset of field: v4l2_hw_freq_seek::seek_upward"]
        [::core::mem::offset_of!(v4l2_hw_freq_seek, seek_upward) - 8usize];
    ["Offset of field: v4l2_hw_freq_seek::wrap_around"]
        [::core::mem::offset_of!(v4l2_hw_freq_seek, wrap_around) - 12usize];
    ["Offset of field: v4l2_hw_freq_seek::spacing"]
        [::core::mem::offset_of!(v4l2_hw_freq_seek, spacing) - 16usize];
    ["Offset of field: v4l2_hw_freq_seek::rangelow"]
        [::core::mem::offset_of!(v4l2_hw_freq_seek, rangelow) - 20usize];
    ["Offset of field: v4l2_hw_freq_seek::rangehigh"]
        [::core::mem::offset_of!(v4l2_hw_freq_seek, rangehigh) - 24usize];
    ["Offset of field: v4l2_hw_freq_seek::reserved"]
        [::core::mem::offset_of!(v4l2_hw_freq_seek, reserved) - 28usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_rds_data {
    pub lsb: __u8,
    pub msb: __u8,
    pub block: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_rds_data"][::core::mem::size_of::<v4l2_rds_data>() - 3usize];
    ["Alignment of v4l2_rds_data"][::core::mem::align_of::<v4l2_rds_data>() - 1usize];
    ["Offset of field: v4l2_rds_data::lsb"][::core::mem::offset_of!(v4l2_rds_data, lsb) - 0usize];
    ["Offset of field: v4l2_rds_data::msb"][::core::mem::offset_of!(v4l2_rds_data, msb) - 1usize];
    ["Offset of field: v4l2_rds_data::block"]
        [::core::mem::offset_of!(v4l2_rds_data, block) - 2usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_audio {
    pub index: __u32,
    pub name: [__u8; 32usize],
    pub capability: __u32,
    pub mode: __u32,
    pub reserved: [__u32; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_audio"][::core::mem::size_of::<v4l2_audio>() - 52usize];
    ["Alignment of v4l2_audio"][::core::mem::align_of::<v4l2_audio>() - 4usize];
    ["Offset of field: v4l2_audio::index"][::core::mem::offset_of!(v4l2_audio, index) - 0usize];
    ["Offset of field: v4l2_audio::name"][::core::mem::offset_of!(v4l2_audio, name) - 4usize];
    ["Offset of field: v4l2_audio::capability"]
        [::core::mem::offset_of!(v4l2_audio, capability) - 36usize];
    ["Offset of field: v4l2_audio::mode"][::core::mem::offset_of!(v4l2_audio, mode) - 40usize];
    ["Offset of field: v4l2_audio::reserved"]
        [::core::mem::offset_of!(v4l2_audio, reserved) - 44usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_audioout {
    pub index: __u32,
    pub name: [__u8; 32usize],
    pub capability: __u32,
    pub mode: __u32,
    pub reserved: [__u32; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_audioout"][::core::mem::size_of::<v4l2_audioout>() - 52usize];
    ["Alignment of v4l2_audioout"][::core::mem::align_of::<v4l2_audioout>() - 4usize];
    ["Offset of field: v4l2_audioout::index"]
        [::core::mem::offset_of!(v4l2_audioout, index) - 0usize];
    ["Offset of field: v4l2_audioout::name"][::core::mem::offset_of!(v4l2_audioout, name) - 4usize];
    ["Offset of field: v4l2_audioout::capability"]
        [::core::mem::offset_of!(v4l2_audioout, capability) - 36usize];
    ["Offset of field: v4l2_audioout::mode"]
        [::core::mem::offset_of!(v4l2_audioout, mode) - 40usize];
    ["Offset of field: v4l2_audioout::reserved"]
        [::core::mem::offset_of!(v4l2_audioout, reserved) - 44usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_enc_idx_entry {
    pub offset: __u64,
    pub pts: __u64,
    pub length: __u32,
    pub flags: __u32,
    pub reserved: [__u32; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_enc_idx_entry"][::core::mem::size_of::<v4l2_enc_idx_entry>() - 32usize];
    ["Alignment of v4l2_enc_idx_entry"][::core::mem::align_of::<v4l2_enc_idx_entry>() - 8usize];
    ["Offset of field: v4l2_enc_idx_entry::offset"]
        [::core::mem::offset_of!(v4l2_enc_idx_entry, offset) - 0usize];
    ["Offset of field: v4l2_enc_idx_entry::pts"]
        [::core::mem::offset_of!(v4l2_enc_idx_entry, pts) - 8usize];
    ["Offset of field: v4l2_enc_idx_entry::length"]
        [::core::mem::offset_of!(v4l2_enc_idx_entry, length) - 16usize];
    ["Offset of field: v4l2_enc_idx_entry::flags"]
        [::core::mem::offset_of!(v4l2_enc_idx_entry, flags) - 20usize];
    ["Offset of field: v4l2_enc_idx_entry::reserved"]
        [::core::mem::offset_of!(v4l2_enc_idx_entry, reserved) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct v4l2_enc_idx {
    pub entries: __u32,
    pub entries_cap: __u32,
    pub reserved: [__u32; 4usize],
    pub entry: [v4l2_enc_idx_entry; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_enc_idx"][::core::mem::size_of::<v4l2_enc_idx>() - 2072usize];
    ["Alignment of v4l2_enc_idx"][::core::mem::align_of::<v4l2_enc_idx>() - 8usize];
    ["Offset of field: v4l2_enc_idx::entries"]
        [::core::mem::offset_of!(v4l2_enc_idx, entries) - 0usize];
    ["Offset of field: v4l2_enc_idx::entries_cap"]
        [::core::mem::offset_of!(v4l2_enc_idx, entries_cap) - 4usize];
    ["Offset of field: v4l2_enc_idx::reserved"]
        [::core::mem::offset_of!(v4l2_enc_idx, reserved) - 8usize];
    ["Offset of field: v4l2_enc_idx::entry"]
        [::core::mem::offset_of!(v4l2_enc_idx, entry) - 24usize];
};
impl Default for v4l2_enc_idx {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct v4l2_encoder_cmd {
    pub cmd: __u32,
    pub flags: __u32,
    pub __anon1: v4l2_encoder_cmd__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_encoder_cmd__bindgen_ty_1 {
    pub raw: v4l2_encoder_cmd__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_encoder_cmd__bindgen_ty_1__bindgen_ty_1 {
    pub data: [__u32; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_encoder_cmd__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_encoder_cmd__bindgen_ty_1__bindgen_ty_1>() - 32usize];
    ["Alignment of v4l2_encoder_cmd__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_encoder_cmd__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: v4l2_encoder_cmd__bindgen_ty_1__bindgen_ty_1::data"]
        [::core::mem::offset_of!(v4l2_encoder_cmd__bindgen_ty_1__bindgen_ty_1, data) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_encoder_cmd__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_encoder_cmd__bindgen_ty_1>() - 32usize];
    ["Alignment of v4l2_encoder_cmd__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_encoder_cmd__bindgen_ty_1>() - 4usize];
    ["Offset of field: v4l2_encoder_cmd__bindgen_ty_1::raw"]
        [::core::mem::offset_of!(v4l2_encoder_cmd__bindgen_ty_1, raw) - 0usize];
};
impl Default for v4l2_encoder_cmd__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_encoder_cmd"][::core::mem::size_of::<v4l2_encoder_cmd>() - 40usize];
    ["Alignment of v4l2_encoder_cmd"][::core::mem::align_of::<v4l2_encoder_cmd>() - 4usize];
    ["Offset of field: v4l2_encoder_cmd::cmd"]
        [::core::mem::offset_of!(v4l2_encoder_cmd, cmd) - 0usize];
    ["Offset of field: v4l2_encoder_cmd::flags"]
        [::core::mem::offset_of!(v4l2_encoder_cmd, flags) - 4usize];
};
impl Default for v4l2_encoder_cmd {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct v4l2_decoder_cmd {
    pub cmd: __u32,
    pub flags: __u32,
    pub __anon1: v4l2_decoder_cmd__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_decoder_cmd__bindgen_ty_1 {
    pub stop: v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_1,
    pub start: v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_2,
    pub raw: v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_1 {
    pub pts: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_1::pts"]
        [::core::mem::offset_of!(v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_1, pts) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_2 {
    pub speed: __s32,
    pub format: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Alignment of v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Offset of field: v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_2::speed"]
        [::core::mem::offset_of!(v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_2, speed) - 0usize];
    ["Offset of field: v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_2::format"]
        [::core::mem::offset_of!(v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_2, format) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_3 {
    pub data: [__u32; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::size_of::<v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_3>() - 64usize];
    ["Alignment of v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::align_of::<v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_3>() - 4usize];
    ["Offset of field: v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_3::data"]
        [::core::mem::offset_of!(v4l2_decoder_cmd__bindgen_ty_1__bindgen_ty_3, data) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_decoder_cmd__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_decoder_cmd__bindgen_ty_1>() - 64usize];
    ["Alignment of v4l2_decoder_cmd__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_decoder_cmd__bindgen_ty_1>() - 8usize];
    ["Offset of field: v4l2_decoder_cmd__bindgen_ty_1::stop"]
        [::core::mem::offset_of!(v4l2_decoder_cmd__bindgen_ty_1, stop) - 0usize];
    ["Offset of field: v4l2_decoder_cmd__bindgen_ty_1::start"]
        [::core::mem::offset_of!(v4l2_decoder_cmd__bindgen_ty_1, start) - 0usize];
    ["Offset of field: v4l2_decoder_cmd__bindgen_ty_1::raw"]
        [::core::mem::offset_of!(v4l2_decoder_cmd__bindgen_ty_1, raw) - 0usize];
};
impl Default for v4l2_decoder_cmd__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_decoder_cmd"][::core::mem::size_of::<v4l2_decoder_cmd>() - 72usize];
    ["Alignment of v4l2_decoder_cmd"][::core::mem::align_of::<v4l2_decoder_cmd>() - 8usize];
    ["Offset of field: v4l2_decoder_cmd::cmd"]
        [::core::mem::offset_of!(v4l2_decoder_cmd, cmd) - 0usize];
    ["Offset of field: v4l2_decoder_cmd::flags"]
        [::core::mem::offset_of!(v4l2_decoder_cmd, flags) - 4usize];
};
impl Default for v4l2_decoder_cmd {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_vbi_format {
    pub sampling_rate: __u32,
    pub offset: __u32,
    pub samples_per_line: __u32,
    pub sample_format: __u32,
    pub start: [__s32; 2usize],
    pub count: [__u32; 2usize],
    pub flags: __u32,
    pub reserved: [__u32; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_vbi_format"][::core::mem::size_of::<v4l2_vbi_format>() - 44usize];
    ["Alignment of v4l2_vbi_format"][::core::mem::align_of::<v4l2_vbi_format>() - 4usize];
    ["Offset of field: v4l2_vbi_format::sampling_rate"]
        [::core::mem::offset_of!(v4l2_vbi_format, sampling_rate) - 0usize];
    ["Offset of field: v4l2_vbi_format::offset"]
        [::core::mem::offset_of!(v4l2_vbi_format, offset) - 4usize];
    ["Offset of field: v4l2_vbi_format::samples_per_line"]
        [::core::mem::offset_of!(v4l2_vbi_format, samples_per_line) - 8usize];
    ["Offset of field: v4l2_vbi_format::sample_format"]
        [::core::mem::offset_of!(v4l2_vbi_format, sample_format) - 12usize];
    ["Offset of field: v4l2_vbi_format::start"]
        [::core::mem::offset_of!(v4l2_vbi_format, start) - 16usize];
    ["Offset of field: v4l2_vbi_format::count"]
        [::core::mem::offset_of!(v4l2_vbi_format, count) - 24usize];
    ["Offset of field: v4l2_vbi_format::flags"]
        [::core::mem::offset_of!(v4l2_vbi_format, flags) - 32usize];
    ["Offset of field: v4l2_vbi_format::reserved"]
        [::core::mem::offset_of!(v4l2_vbi_format, reserved) - 36usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_sliced_vbi_format {
    pub service_set: __u16,
    pub service_lines: [[__u16; 24usize]; 2usize],
    pub io_size: __u32,
    pub reserved: [__u32; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_sliced_vbi_format"][::core::mem::size_of::<v4l2_sliced_vbi_format>() - 112usize];
    ["Alignment of v4l2_sliced_vbi_format"]
        [::core::mem::align_of::<v4l2_sliced_vbi_format>() - 4usize];
    ["Offset of field: v4l2_sliced_vbi_format::service_set"]
        [::core::mem::offset_of!(v4l2_sliced_vbi_format, service_set) - 0usize];
    ["Offset of field: v4l2_sliced_vbi_format::service_lines"]
        [::core::mem::offset_of!(v4l2_sliced_vbi_format, service_lines) - 2usize];
    ["Offset of field: v4l2_sliced_vbi_format::io_size"]
        [::core::mem::offset_of!(v4l2_sliced_vbi_format, io_size) - 100usize];
    ["Offset of field: v4l2_sliced_vbi_format::reserved"]
        [::core::mem::offset_of!(v4l2_sliced_vbi_format, reserved) - 104usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_sliced_vbi_cap {
    pub service_set: __u16,
    pub service_lines: [[__u16; 24usize]; 2usize],
    pub type_: __u32,
    pub reserved: [__u32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_sliced_vbi_cap"][::core::mem::size_of::<v4l2_sliced_vbi_cap>() - 116usize];
    ["Alignment of v4l2_sliced_vbi_cap"][::core::mem::align_of::<v4l2_sliced_vbi_cap>() - 4usize];
    ["Offset of field: v4l2_sliced_vbi_cap::service_set"]
        [::core::mem::offset_of!(v4l2_sliced_vbi_cap, service_set) - 0usize];
    ["Offset of field: v4l2_sliced_vbi_cap::service_lines"]
        [::core::mem::offset_of!(v4l2_sliced_vbi_cap, service_lines) - 2usize];
    ["Offset of field: v4l2_sliced_vbi_cap::type_"]
        [::core::mem::offset_of!(v4l2_sliced_vbi_cap, type_) - 100usize];
    ["Offset of field: v4l2_sliced_vbi_cap::reserved"]
        [::core::mem::offset_of!(v4l2_sliced_vbi_cap, reserved) - 104usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct v4l2_sliced_vbi_data {
    pub id: __u32,
    pub field: __u32,
    pub line: __u32,
    pub reserved: __u32,
    pub data: [__u8; 48usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_sliced_vbi_data"][::core::mem::size_of::<v4l2_sliced_vbi_data>() - 64usize];
    ["Alignment of v4l2_sliced_vbi_data"][::core::mem::align_of::<v4l2_sliced_vbi_data>() - 4usize];
    ["Offset of field: v4l2_sliced_vbi_data::id"]
        [::core::mem::offset_of!(v4l2_sliced_vbi_data, id) - 0usize];
    ["Offset of field: v4l2_sliced_vbi_data::field"]
        [::core::mem::offset_of!(v4l2_sliced_vbi_data, field) - 4usize];
    ["Offset of field: v4l2_sliced_vbi_data::line"]
        [::core::mem::offset_of!(v4l2_sliced_vbi_data, line) - 8usize];
    ["Offset of field: v4l2_sliced_vbi_data::reserved"]
        [::core::mem::offset_of!(v4l2_sliced_vbi_data, reserved) - 12usize];
    ["Offset of field: v4l2_sliced_vbi_data::data"]
        [::core::mem::offset_of!(v4l2_sliced_vbi_data, data) - 16usize];
};
impl Default for v4l2_sliced_vbi_data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct v4l2_mpeg_vbi_itv0_line {
    pub id: __u8,
    pub data: [__u8; 42usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_mpeg_vbi_itv0_line"]
        [::core::mem::size_of::<v4l2_mpeg_vbi_itv0_line>() - 43usize];
    ["Alignment of v4l2_mpeg_vbi_itv0_line"]
        [::core::mem::align_of::<v4l2_mpeg_vbi_itv0_line>() - 1usize];
    ["Offset of field: v4l2_mpeg_vbi_itv0_line::id"]
        [::core::mem::offset_of!(v4l2_mpeg_vbi_itv0_line, id) - 0usize];
    ["Offset of field: v4l2_mpeg_vbi_itv0_line::data"]
        [::core::mem::offset_of!(v4l2_mpeg_vbi_itv0_line, data) - 1usize];
};
impl Default for v4l2_mpeg_vbi_itv0_line {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct v4l2_mpeg_vbi_itv0 {
    pub linemask: [__le32; 2usize],
    pub line: [v4l2_mpeg_vbi_itv0_line; 35usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_mpeg_vbi_itv0"][::core::mem::size_of::<v4l2_mpeg_vbi_itv0>() - 1513usize];
    ["Alignment of v4l2_mpeg_vbi_itv0"][::core::mem::align_of::<v4l2_mpeg_vbi_itv0>() - 1usize];
    ["Offset of field: v4l2_mpeg_vbi_itv0::linemask"]
        [::core::mem::offset_of!(v4l2_mpeg_vbi_itv0, linemask) - 0usize];
    ["Offset of field: v4l2_mpeg_vbi_itv0::line"]
        [::core::mem::offset_of!(v4l2_mpeg_vbi_itv0, line) - 8usize];
};
impl Default for v4l2_mpeg_vbi_itv0 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct v4l2_mpeg_vbi_ITV0 {
    pub line: [v4l2_mpeg_vbi_itv0_line; 36usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_mpeg_vbi_ITV0"][::core::mem::size_of::<v4l2_mpeg_vbi_ITV0>() - 1548usize];
    ["Alignment of v4l2_mpeg_vbi_ITV0"][::core::mem::align_of::<v4l2_mpeg_vbi_ITV0>() - 1usize];
    ["Offset of field: v4l2_mpeg_vbi_ITV0::line"]
        [::core::mem::offset_of!(v4l2_mpeg_vbi_ITV0, line) - 0usize];
};
impl Default for v4l2_mpeg_vbi_ITV0 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct v4l2_mpeg_vbi_fmt_ivtv {
    pub magic: [__u8; 4usize],
    pub __anon1: v4l2_mpeg_vbi_fmt_ivtv__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_mpeg_vbi_fmt_ivtv__bindgen_ty_1 {
    pub itv0: v4l2_mpeg_vbi_itv0,
    pub ITV0: v4l2_mpeg_vbi_ITV0,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_mpeg_vbi_fmt_ivtv__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_mpeg_vbi_fmt_ivtv__bindgen_ty_1>() - 1548usize];
    ["Alignment of v4l2_mpeg_vbi_fmt_ivtv__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_mpeg_vbi_fmt_ivtv__bindgen_ty_1>() - 1usize];
    ["Offset of field: v4l2_mpeg_vbi_fmt_ivtv__bindgen_ty_1::itv0"]
        [::core::mem::offset_of!(v4l2_mpeg_vbi_fmt_ivtv__bindgen_ty_1, itv0) - 0usize];
    ["Offset of field: v4l2_mpeg_vbi_fmt_ivtv__bindgen_ty_1::ITV0"]
        [::core::mem::offset_of!(v4l2_mpeg_vbi_fmt_ivtv__bindgen_ty_1, ITV0) - 0usize];
};
impl Default for v4l2_mpeg_vbi_fmt_ivtv__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_mpeg_vbi_fmt_ivtv"]
        [::core::mem::size_of::<v4l2_mpeg_vbi_fmt_ivtv>() - 1552usize];
    ["Alignment of v4l2_mpeg_vbi_fmt_ivtv"]
        [::core::mem::align_of::<v4l2_mpeg_vbi_fmt_ivtv>() - 1usize];
    ["Offset of field: v4l2_mpeg_vbi_fmt_ivtv::magic"]
        [::core::mem::offset_of!(v4l2_mpeg_vbi_fmt_ivtv, magic) - 0usize];
};
impl Default for v4l2_mpeg_vbi_fmt_ivtv {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " struct v4l2_plane_pix_format - additional, per-plane format definition\n @sizeimage:\t\tmaximum size in bytes required for data, for which\n\t\t\tthis plane will be used\n @bytesperline:\tdistance in bytes between the leftmost pixels in two\n\t\t\tadjacent lines"]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_plane_pix_format {
    pub sizeimage: __u32,
    pub bytesperline: __u32,
    pub reserved: [__u16; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_plane_pix_format"][::core::mem::size_of::<v4l2_plane_pix_format>() - 20usize];
    ["Alignment of v4l2_plane_pix_format"]
        [::core::mem::align_of::<v4l2_plane_pix_format>() - 1usize];
    ["Offset of field: v4l2_plane_pix_format::sizeimage"]
        [::core::mem::offset_of!(v4l2_plane_pix_format, sizeimage) - 0usize];
    ["Offset of field: v4l2_plane_pix_format::bytesperline"]
        [::core::mem::offset_of!(v4l2_plane_pix_format, bytesperline) - 4usize];
    ["Offset of field: v4l2_plane_pix_format::reserved"]
        [::core::mem::offset_of!(v4l2_plane_pix_format, reserved) - 8usize];
};
#[doc = " struct v4l2_pix_format_mplane - multiplanar format definition\n @width:\t\timage width in pixels\n @height:\t\timage height in pixels\n @pixelformat:\tlittle endian four character code (fourcc)\n @field:\t\tenum v4l2_field; field order (for interlaced video)\n @colorspace:\t\tenum v4l2_colorspace; supplemental to pixelformat\n @plane_fmt:\t\tper-plane information\n @num_planes:\t\tnumber of planes for this format\n @flags:\t\tformat flags (V4L2_PIX_FMT_FLAG_*)\n @ycbcr_enc:\t\tenum v4l2_ycbcr_encoding, Y'CbCr encoding\n @quantization:\tenum v4l2_quantization, colorspace quantization\n @xfer_func:\t\tenum v4l2_xfer_func, colorspace transfer function"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct v4l2_pix_format_mplane {
    pub width: __u32,
    pub height: __u32,
    pub pixelformat: __u32,
    pub field: __u32,
    pub colorspace: __u32,
    pub plane_fmt: [v4l2_plane_pix_format; 8usize],
    pub num_planes: __u8,
    pub flags: __u8,
    pub __anon1: v4l2_pix_format_mplane__bindgen_ty_1,
    pub quantization: __u8,
    pub xfer_func: __u8,
    pub reserved: [__u8; 7usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_pix_format_mplane__bindgen_ty_1 {
    pub ycbcr_enc: __u8,
    pub hsv_enc: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_pix_format_mplane__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_pix_format_mplane__bindgen_ty_1>() - 1usize];
    ["Alignment of v4l2_pix_format_mplane__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_pix_format_mplane__bindgen_ty_1>() - 1usize];
    ["Offset of field: v4l2_pix_format_mplane__bindgen_ty_1::ycbcr_enc"]
        [::core::mem::offset_of!(v4l2_pix_format_mplane__bindgen_ty_1, ycbcr_enc) - 0usize];
    ["Offset of field: v4l2_pix_format_mplane__bindgen_ty_1::hsv_enc"]
        [::core::mem::offset_of!(v4l2_pix_format_mplane__bindgen_ty_1, hsv_enc) - 0usize];
};
impl Default for v4l2_pix_format_mplane__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_pix_format_mplane"][::core::mem::size_of::<v4l2_pix_format_mplane>() - 192usize];
    ["Alignment of v4l2_pix_format_mplane"]
        [::core::mem::align_of::<v4l2_pix_format_mplane>() - 1usize];
    ["Offset of field: v4l2_pix_format_mplane::width"]
        [::core::mem::offset_of!(v4l2_pix_format_mplane, width) - 0usize];
    ["Offset of field: v4l2_pix_format_mplane::height"]
        [::core::mem::offset_of!(v4l2_pix_format_mplane, height) - 4usize];
    ["Offset of field: v4l2_pix_format_mplane::pixelformat"]
        [::core::mem::offset_of!(v4l2_pix_format_mplane, pixelformat) - 8usize];
    ["Offset of field: v4l2_pix_format_mplane::field"]
        [::core::mem::offset_of!(v4l2_pix_format_mplane, field) - 12usize];
    ["Offset of field: v4l2_pix_format_mplane::colorspace"]
        [::core::mem::offset_of!(v4l2_pix_format_mplane, colorspace) - 16usize];
    ["Offset of field: v4l2_pix_format_mplane::plane_fmt"]
        [::core::mem::offset_of!(v4l2_pix_format_mplane, plane_fmt) - 20usize];
    ["Offset of field: v4l2_pix_format_mplane::num_planes"]
        [::core::mem::offset_of!(v4l2_pix_format_mplane, num_planes) - 180usize];
    ["Offset of field: v4l2_pix_format_mplane::flags"]
        [::core::mem::offset_of!(v4l2_pix_format_mplane, flags) - 181usize];
    ["Offset of field: v4l2_pix_format_mplane::quantization"]
        [::core::mem::offset_of!(v4l2_pix_format_mplane, quantization) - 183usize];
    ["Offset of field: v4l2_pix_format_mplane::xfer_func"]
        [::core::mem::offset_of!(v4l2_pix_format_mplane, xfer_func) - 184usize];
    ["Offset of field: v4l2_pix_format_mplane::reserved"]
        [::core::mem::offset_of!(v4l2_pix_format_mplane, reserved) - 185usize];
};
impl Default for v4l2_pix_format_mplane {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " struct v4l2_sdr_format - SDR format definition\n @pixelformat:\tlittle endian four character code (fourcc)\n @buffersize:\t\tmaximum size in bytes required for data"]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_sdr_format {
    pub pixelformat: __u32,
    pub buffersize: __u32,
    pub reserved: [__u8; 24usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_sdr_format"][::core::mem::size_of::<v4l2_sdr_format>() - 32usize];
    ["Alignment of v4l2_sdr_format"][::core::mem::align_of::<v4l2_sdr_format>() - 1usize];
    ["Offset of field: v4l2_sdr_format::pixelformat"]
        [::core::mem::offset_of!(v4l2_sdr_format, pixelformat) - 0usize];
    ["Offset of field: v4l2_sdr_format::buffersize"]
        [::core::mem::offset_of!(v4l2_sdr_format, buffersize) - 4usize];
    ["Offset of field: v4l2_sdr_format::reserved"]
        [::core::mem::offset_of!(v4l2_sdr_format, reserved) - 8usize];
};
#[doc = " struct v4l2_meta_format - metadata format definition\n @dataformat:\t\tlittle endian four character code (fourcc)\n @buffersize:\t\tmaximum size in bytes required for data"]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_meta_format {
    pub dataformat: __u32,
    pub buffersize: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_meta_format"][::core::mem::size_of::<v4l2_meta_format>() - 8usize];
    ["Alignment of v4l2_meta_format"][::core::mem::align_of::<v4l2_meta_format>() - 1usize];
    ["Offset of field: v4l2_meta_format::dataformat"]
        [::core::mem::offset_of!(v4l2_meta_format, dataformat) - 0usize];
    ["Offset of field: v4l2_meta_format::buffersize"]
        [::core::mem::offset_of!(v4l2_meta_format, buffersize) - 4usize];
};
#[doc = " struct v4l2_format - stream data format\n @type:\tenum v4l2_buf_type; type of the data stream\n @pix:\tdefinition of an image format\n @pix_mp:\tdefinition of a multiplanar image format\n @win:\tdefinition of an overlaid image\n @vbi:\traw VBI capture or output parameters\n @sliced:\tsliced VBI capture or output parameters\n @raw_data:\tplaceholder for future extensions and custom formats"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct v4l2_format {
    pub type_: __u32,
    pub fmt: v4l2_format__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_format__bindgen_ty_1 {
    pub pix: v4l2_pix_format,
    pub pix_mp: v4l2_pix_format_mplane,
    pub win: v4l2_window,
    pub vbi: v4l2_vbi_format,
    pub sliced: v4l2_sliced_vbi_format,
    pub sdr: v4l2_sdr_format,
    pub meta: v4l2_meta_format,
    pub raw_data: [__u8; 200usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_format__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_format__bindgen_ty_1>() - 200usize];
    ["Alignment of v4l2_format__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_format__bindgen_ty_1>() - 4usize];
    ["Offset of field: v4l2_format__bindgen_ty_1::pix"]
        [::core::mem::offset_of!(v4l2_format__bindgen_ty_1, pix) - 0usize];
    ["Offset of field: v4l2_format__bindgen_ty_1::pix_mp"]
        [::core::mem::offset_of!(v4l2_format__bindgen_ty_1, pix_mp) - 0usize];
    ["Offset of field: v4l2_format__bindgen_ty_1::win"]
        [::core::mem::offset_of!(v4l2_format__bindgen_ty_1, win) - 0usize];
    ["Offset of field: v4l2_format__bindgen_ty_1::vbi"]
        [::core::mem::offset_of!(v4l2_format__bindgen_ty_1, vbi) - 0usize];
    ["Offset of field: v4l2_format__bindgen_ty_1::sliced"]
        [::core::mem::offset_of!(v4l2_format__bindgen_ty_1, sliced) - 0usize];
    ["Offset of field: v4l2_format__bindgen_ty_1::sdr"]
        [::core::mem::offset_of!(v4l2_format__bindgen_ty_1, sdr) - 0usize];
    ["Offset of field: v4l2_format__bindgen_ty_1::meta"]
        [::core::mem::offset_of!(v4l2_format__bindgen_ty_1, meta) - 0usize];
    ["Offset of field: v4l2_format__bindgen_ty_1::raw_data"]
        [::core::mem::offset_of!(v4l2_format__bindgen_ty_1, raw_data) - 0usize];
};
impl Default for v4l2_format__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_format"][::core::mem::size_of::<v4l2_format>() - 204usize];
    ["Alignment of v4l2_format"][::core::mem::align_of::<v4l2_format>() - 4usize];
    ["Offset of field: v4l2_format::type_"][::core::mem::offset_of!(v4l2_format, type_) - 0usize];
    ["Offset of field: v4l2_format::fmt"][::core::mem::offset_of!(v4l2_format, fmt) - 4usize];
};
impl Default for v4l2_format {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct v4l2_streamparm {
    pub type_: __u32,
    pub parm: v4l2_streamparm__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_streamparm__bindgen_ty_1 {
    pub capture: v4l2_captureparm,
    pub output: v4l2_outputparm,
    pub raw_data: [__u8; 200usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_streamparm__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_streamparm__bindgen_ty_1>() - 200usize];
    ["Alignment of v4l2_streamparm__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_streamparm__bindgen_ty_1>() - 4usize];
    ["Offset of field: v4l2_streamparm__bindgen_ty_1::capture"]
        [::core::mem::offset_of!(v4l2_streamparm__bindgen_ty_1, capture) - 0usize];
    ["Offset of field: v4l2_streamparm__bindgen_ty_1::output"]
        [::core::mem::offset_of!(v4l2_streamparm__bindgen_ty_1, output) - 0usize];
    ["Offset of field: v4l2_streamparm__bindgen_ty_1::raw_data"]
        [::core::mem::offset_of!(v4l2_streamparm__bindgen_ty_1, raw_data) - 0usize];
};
impl Default for v4l2_streamparm__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_streamparm"][::core::mem::size_of::<v4l2_streamparm>() - 204usize];
    ["Alignment of v4l2_streamparm"][::core::mem::align_of::<v4l2_streamparm>() - 4usize];
    ["Offset of field: v4l2_streamparm::type_"]
        [::core::mem::offset_of!(v4l2_streamparm, type_) - 0usize];
    ["Offset of field: v4l2_streamparm::parm"]
        [::core::mem::offset_of!(v4l2_streamparm, parm) - 4usize];
};
impl Default for v4l2_streamparm {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_event_vsync {
    pub field: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_event_vsync"][::core::mem::size_of::<v4l2_event_vsync>() - 1usize];
    ["Alignment of v4l2_event_vsync"][::core::mem::align_of::<v4l2_event_vsync>() - 1usize];
    ["Offset of field: v4l2_event_vsync::field"]
        [::core::mem::offset_of!(v4l2_event_vsync, field) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct v4l2_event_ctrl {
    pub changes: __u32,
    pub type_: __u32,
    pub __anon1: v4l2_event_ctrl__bindgen_ty_1,
    pub flags: __u32,
    pub minimum: __s32,
    pub maximum: __s32,
    pub step: __s32,
    pub default_value: __s32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_event_ctrl__bindgen_ty_1 {
    pub value: __s32,
    pub value64: __s64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_event_ctrl__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_event_ctrl__bindgen_ty_1>() - 8usize];
    ["Alignment of v4l2_event_ctrl__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_event_ctrl__bindgen_ty_1>() - 8usize];
    ["Offset of field: v4l2_event_ctrl__bindgen_ty_1::value"]
        [::core::mem::offset_of!(v4l2_event_ctrl__bindgen_ty_1, value) - 0usize];
    ["Offset of field: v4l2_event_ctrl__bindgen_ty_1::value64"]
        [::core::mem::offset_of!(v4l2_event_ctrl__bindgen_ty_1, value64) - 0usize];
};
impl Default for v4l2_event_ctrl__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_event_ctrl"][::core::mem::size_of::<v4l2_event_ctrl>() - 40usize];
    ["Alignment of v4l2_event_ctrl"][::core::mem::align_of::<v4l2_event_ctrl>() - 8usize];
    ["Offset of field: v4l2_event_ctrl::changes"]
        [::core::mem::offset_of!(v4l2_event_ctrl, changes) - 0usize];
    ["Offset of field: v4l2_event_ctrl::type_"]
        [::core::mem::offset_of!(v4l2_event_ctrl, type_) - 4usize];
    ["Offset of field: v4l2_event_ctrl::flags"]
        [::core::mem::offset_of!(v4l2_event_ctrl, flags) - 16usize];
    ["Offset of field: v4l2_event_ctrl::minimum"]
        [::core::mem::offset_of!(v4l2_event_ctrl, minimum) - 20usize];
    ["Offset of field: v4l2_event_ctrl::maximum"]
        [::core::mem::offset_of!(v4l2_event_ctrl, maximum) - 24usize];
    ["Offset of field: v4l2_event_ctrl::step"]
        [::core::mem::offset_of!(v4l2_event_ctrl, step) - 28usize];
    ["Offset of field: v4l2_event_ctrl::default_value"]
        [::core::mem::offset_of!(v4l2_event_ctrl, default_value) - 32usize];
};
impl Default for v4l2_event_ctrl {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_event_frame_sync {
    pub frame_sequence: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_event_frame_sync"][::core::mem::size_of::<v4l2_event_frame_sync>() - 4usize];
    ["Alignment of v4l2_event_frame_sync"]
        [::core::mem::align_of::<v4l2_event_frame_sync>() - 4usize];
    ["Offset of field: v4l2_event_frame_sync::frame_sequence"]
        [::core::mem::offset_of!(v4l2_event_frame_sync, frame_sequence) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_event_src_change {
    pub changes: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_event_src_change"][::core::mem::size_of::<v4l2_event_src_change>() - 4usize];
    ["Alignment of v4l2_event_src_change"]
        [::core::mem::align_of::<v4l2_event_src_change>() - 4usize];
    ["Offset of field: v4l2_event_src_change::changes"]
        [::core::mem::offset_of!(v4l2_event_src_change, changes) - 0usize];
};
#[doc = " struct v4l2_event_motion_det - motion detection event\n @flags:             if V4L2_EVENT_MD_FL_HAVE_FRAME_SEQ is set, then the\n                     frame_sequence field is valid.\n @frame_sequence:    the frame sequence number associated with this event.\n @region_mask:       which regions detected motion."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_event_motion_det {
    pub flags: __u32,
    pub frame_sequence: __u32,
    pub region_mask: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_event_motion_det"][::core::mem::size_of::<v4l2_event_motion_det>() - 12usize];
    ["Alignment of v4l2_event_motion_det"]
        [::core::mem::align_of::<v4l2_event_motion_det>() - 4usize];
    ["Offset of field: v4l2_event_motion_det::flags"]
        [::core::mem::offset_of!(v4l2_event_motion_det, flags) - 0usize];
    ["Offset of field: v4l2_event_motion_det::frame_sequence"]
        [::core::mem::offset_of!(v4l2_event_motion_det, frame_sequence) - 4usize];
    ["Offset of field: v4l2_event_motion_det::region_mask"]
        [::core::mem::offset_of!(v4l2_event_motion_det, region_mask) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct v4l2_event {
    pub type_: __u32,
    pub u: v4l2_event__bindgen_ty_1,
    pub pending: __u32,
    pub sequence: __u32,
    pub timestamp: timespec,
    pub id: __u32,
    pub reserved: [__u32; 8usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_event__bindgen_ty_1 {
    pub vsync: v4l2_event_vsync,
    pub ctrl: v4l2_event_ctrl,
    pub frame_sync: v4l2_event_frame_sync,
    pub src_change: v4l2_event_src_change,
    pub motion_det: v4l2_event_motion_det,
    pub data: [__u8; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_event__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_event__bindgen_ty_1>() - 64usize];
    ["Alignment of v4l2_event__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_event__bindgen_ty_1>() - 8usize];
    ["Offset of field: v4l2_event__bindgen_ty_1::vsync"]
        [::core::mem::offset_of!(v4l2_event__bindgen_ty_1, vsync) - 0usize];
    ["Offset of field: v4l2_event__bindgen_ty_1::ctrl"]
        [::core::mem::offset_of!(v4l2_event__bindgen_ty_1, ctrl) - 0usize];
    ["Offset of field: v4l2_event__bindgen_ty_1::frame_sync"]
        [::core::mem::offset_of!(v4l2_event__bindgen_ty_1, frame_sync) - 0usize];
    ["Offset of field: v4l2_event__bindgen_ty_1::src_change"]
        [::core::mem::offset_of!(v4l2_event__bindgen_ty_1, src_change) - 0usize];
    ["Offset of field: v4l2_event__bindgen_ty_1::motion_det"]
        [::core::mem::offset_of!(v4l2_event__bindgen_ty_1, motion_det) - 0usize];
    ["Offset of field: v4l2_event__bindgen_ty_1::data"]
        [::core::mem::offset_of!(v4l2_event__bindgen_ty_1, data) - 0usize];
};
impl Default for v4l2_event__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_event"][::core::mem::size_of::<v4l2_event>() - 128usize];
    ["Alignment of v4l2_event"][::core::mem::align_of::<v4l2_event>() - 8usize];
    ["Offset of field: v4l2_event::type_"][::core::mem::offset_of!(v4l2_event, type_) - 0usize];
    ["Offset of field: v4l2_event::u"][::core::mem::offset_of!(v4l2_event, u) - 8usize];
    ["Offset of field: v4l2_event::pending"]
        [::core::mem::offset_of!(v4l2_event, pending) - 72usize];
    ["Offset of field: v4l2_event::sequence"]
        [::core::mem::offset_of!(v4l2_event, sequence) - 76usize];
    ["Offset of field: v4l2_event::timestamp"]
        [::core::mem::offset_of!(v4l2_event, timestamp) - 80usize];
    ["Offset of field: v4l2_event::id"][::core::mem::offset_of!(v4l2_event, id) - 88usize];
    ["Offset of field: v4l2_event::reserved"]
        [::core::mem::offset_of!(v4l2_event, reserved) - 92usize];
};
impl Default for v4l2_event {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct v4l2_event_subscription {
    pub type_: __u32,
    pub id: __u32,
    pub flags: __u32,
    pub reserved: [__u32; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_event_subscription"]
        [::core::mem::size_of::<v4l2_event_subscription>() - 32usize];
    ["Alignment of v4l2_event_subscription"]
        [::core::mem::align_of::<v4l2_event_subscription>() - 4usize];
    ["Offset of field: v4l2_event_subscription::type_"]
        [::core::mem::offset_of!(v4l2_event_subscription, type_) - 0usize];
    ["Offset of field: v4l2_event_subscription::id"]
        [::core::mem::offset_of!(v4l2_event_subscription, id) - 4usize];
    ["Offset of field: v4l2_event_subscription::flags"]
        [::core::mem::offset_of!(v4l2_event_subscription, flags) - 8usize];
    ["Offset of field: v4l2_event_subscription::reserved"]
        [::core::mem::offset_of!(v4l2_event_subscription, reserved) - 12usize];
};
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct v4l2_dbg_match {
    pub type_: __u32,
    pub __anon1: v4l2_dbg_match__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v4l2_dbg_match__bindgen_ty_1 {
    pub addr: __u32,
    pub name: [libc::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_dbg_match__bindgen_ty_1"]
        [::core::mem::size_of::<v4l2_dbg_match__bindgen_ty_1>() - 32usize];
    ["Alignment of v4l2_dbg_match__bindgen_ty_1"]
        [::core::mem::align_of::<v4l2_dbg_match__bindgen_ty_1>() - 4usize];
    ["Offset of field: v4l2_dbg_match__bindgen_ty_1::addr"]
        [::core::mem::offset_of!(v4l2_dbg_match__bindgen_ty_1, addr) - 0usize];
    ["Offset of field: v4l2_dbg_match__bindgen_ty_1::name"]
        [::core::mem::offset_of!(v4l2_dbg_match__bindgen_ty_1, name) - 0usize];
};
impl Default for v4l2_dbg_match__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_dbg_match"][::core::mem::size_of::<v4l2_dbg_match>() - 36usize];
    ["Alignment of v4l2_dbg_match"][::core::mem::align_of::<v4l2_dbg_match>() - 1usize];
    ["Offset of field: v4l2_dbg_match::type_"]
        [::core::mem::offset_of!(v4l2_dbg_match, type_) - 0usize];
};
impl Default for v4l2_dbg_match {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct v4l2_dbg_register {
    pub match_: v4l2_dbg_match,
    pub size: __u32,
    pub reg: __u64,
    pub val: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_dbg_register"][::core::mem::size_of::<v4l2_dbg_register>() - 56usize];
    ["Alignment of v4l2_dbg_register"][::core::mem::align_of::<v4l2_dbg_register>() - 1usize];
    ["Offset of field: v4l2_dbg_register::match_"]
        [::core::mem::offset_of!(v4l2_dbg_register, match_) - 0usize];
    ["Offset of field: v4l2_dbg_register::size"]
        [::core::mem::offset_of!(v4l2_dbg_register, size) - 36usize];
    ["Offset of field: v4l2_dbg_register::reg"]
        [::core::mem::offset_of!(v4l2_dbg_register, reg) - 40usize];
    ["Offset of field: v4l2_dbg_register::val"]
        [::core::mem::offset_of!(v4l2_dbg_register, val) - 48usize];
};
impl Default for v4l2_dbg_register {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct v4l2_dbg_chip_info {
    pub match_: v4l2_dbg_match,
    pub name: [libc::c_char; 32usize],
    pub flags: __u32,
    pub reserved: [__u32; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_dbg_chip_info"][::core::mem::size_of::<v4l2_dbg_chip_info>() - 200usize];
    ["Alignment of v4l2_dbg_chip_info"][::core::mem::align_of::<v4l2_dbg_chip_info>() - 1usize];
    ["Offset of field: v4l2_dbg_chip_info::match_"]
        [::core::mem::offset_of!(v4l2_dbg_chip_info, match_) - 0usize];
    ["Offset of field: v4l2_dbg_chip_info::name"]
        [::core::mem::offset_of!(v4l2_dbg_chip_info, name) - 36usize];
    ["Offset of field: v4l2_dbg_chip_info::flags"]
        [::core::mem::offset_of!(v4l2_dbg_chip_info, flags) - 68usize];
    ["Offset of field: v4l2_dbg_chip_info::reserved"]
        [::core::mem::offset_of!(v4l2_dbg_chip_info, reserved) - 72usize];
};
impl Default for v4l2_dbg_chip_info {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " struct v4l2_create_buffers - VIDIOC_CREATE_BUFS argument\n @index:\ton return, index of the first created buffer\n @count:\tentry: number of requested buffers,\n\t\treturn: number of created buffers\n @memory:\tenum v4l2_memory; buffer memory type\n @format:\tframe format, for which buffers are requested\n @capabilities: capabilities of this buffer type.\n @reserved:\tfuture extensions"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct v4l2_create_buffers {
    pub index: __u32,
    pub count: __u32,
    pub memory: __u32,
    pub format: v4l2_format,
    pub capabilities: __u32,
    pub reserved: [__u32; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of v4l2_create_buffers"][::core::mem::size_of::<v4l2_create_buffers>() - 248usize];
    ["Alignment of v4l2_create_buffers"][::core::mem::align_of::<v4l2_create_buffers>() - 4usize];
    ["Offset of field: v4l2_create_buffers::index"]
        [::core::mem::offset_of!(v4l2_create_buffers, index) - 0usize];
    ["Offset of field: v4l2_create_buffers::count"]
        [::core::mem::offset_of!(v4l2_create_buffers, count) - 4usize];
    ["Offset of field: v4l2_create_buffers::memory"]
        [::core::mem::offset_of!(v4l2_create_buffers, memory) - 8usize];
    ["Offset of field: v4l2_create_buffers::format"]
        [::core::mem::offset_of!(v4l2_create_buffers, format) - 12usize];
    ["Offset of field: v4l2_create_buffers::capabilities"]
        [::core::mem::offset_of!(v4l2_create_buffers, capabilities) - 216usize];
    ["Offset of field: v4l2_create_buffers::reserved"]
        [::core::mem::offset_of!(v4l2_create_buffers, reserved) - 220usize];
};
impl Default for v4l2_create_buffers {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: libc::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: libc::c_uint,
    pub __wchb: [libc::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::core::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::core::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::core::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::core::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
impl Default for __mbstate_t__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::core::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::core::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::core::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::core::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
impl Default for __mbstate_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::core::mem::size_of::<_G_fpos_t>() - 12usize];
    ["Alignment of _G_fpos_t"][::core::mem::align_of::<_G_fpos_t>() - 4usize];
    ["Offset of field: _G_fpos_t::__pos"][::core::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::core::mem::offset_of!(_G_fpos_t, __state) - 4usize];
};
impl Default for _G_fpos_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::core::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::core::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"][::core::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::core::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
impl Default for _G_fpos64_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = libc::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: libc::c_int,
    pub _IO_read_ptr: *mut libc::c_char,
    pub _IO_read_end: *mut libc::c_char,
    pub _IO_read_base: *mut libc::c_char,
    pub _IO_write_base: *mut libc::c_char,
    pub _IO_write_ptr: *mut libc::c_char,
    pub _IO_write_end: *mut libc::c_char,
    pub _IO_buf_base: *mut libc::c_char,
    pub _IO_buf_end: *mut libc::c_char,
    pub _IO_save_base: *mut libc::c_char,
    pub _IO_backup_base: *mut libc::c_char,
    pub _IO_save_end: *mut libc::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: libc::c_int,
    pub _flags2: libc::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: libc::c_ushort,
    pub _vtable_offset: libc::c_schar,
    pub _shortbuf: [libc::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut libc::c_void,
    pub __pad5: usize,
    pub _mode: libc::c_int,
    pub _unused2: [libc::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::core::mem::size_of::<_IO_FILE>() - 152usize];
    ["Alignment of _IO_FILE"][::core::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::core::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::core::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 4usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::core::mem::offset_of!(_IO_FILE, _IO_read_end) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::core::mem::offset_of!(_IO_FILE, _IO_read_base) - 12usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::core::mem::offset_of!(_IO_FILE, _IO_write_base) - 16usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::core::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 20usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::core::mem::offset_of!(_IO_FILE, _IO_write_end) - 24usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::core::mem::offset_of!(_IO_FILE, _IO_buf_base) - 28usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::core::mem::offset_of!(_IO_FILE, _IO_buf_end) - 32usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::core::mem::offset_of!(_IO_FILE, _IO_save_base) - 36usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::core::mem::offset_of!(_IO_FILE, _IO_backup_base) - 40usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::core::mem::offset_of!(_IO_FILE, _IO_save_end) - 44usize];
    ["Offset of field: _IO_FILE::_markers"][::core::mem::offset_of!(_IO_FILE, _markers) - 48usize];
    ["Offset of field: _IO_FILE::_chain"][::core::mem::offset_of!(_IO_FILE, _chain) - 52usize];
    ["Offset of field: _IO_FILE::_fileno"][::core::mem::offset_of!(_IO_FILE, _fileno) - 56usize];
    ["Offset of field: _IO_FILE::_flags2"][::core::mem::offset_of!(_IO_FILE, _flags2) - 60usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::core::mem::offset_of!(_IO_FILE, _old_offset) - 64usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::core::mem::offset_of!(_IO_FILE, _cur_column) - 68usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::core::mem::offset_of!(_IO_FILE, _vtable_offset) - 70usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::core::mem::offset_of!(_IO_FILE, _shortbuf) - 71usize];
    ["Offset of field: _IO_FILE::_lock"][::core::mem::offset_of!(_IO_FILE, _lock) - 72usize];
    ["Offset of field: _IO_FILE::_offset"][::core::mem::offset_of!(_IO_FILE, _offset) - 80usize];
    ["Offset of field: _IO_FILE::_codecvt"][::core::mem::offset_of!(_IO_FILE, _codecvt) - 88usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::core::mem::offset_of!(_IO_FILE, _wide_data) - 92usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::core::mem::offset_of!(_IO_FILE, _freeres_list) - 96usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::core::mem::offset_of!(_IO_FILE, _freeres_buf) - 100usize];
    ["Offset of field: _IO_FILE::__pad5"][::core::mem::offset_of!(_IO_FILE, __pad5) - 104usize];
    ["Offset of field: _IO_FILE::_mode"][::core::mem::offset_of!(_IO_FILE, _mode) - 108usize];
    ["Offset of field: _IO_FILE::_unused2"][::core::mem::offset_of!(_IO_FILE, _unused2) - 112usize];
};
impl Default for _IO_FILE {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type off_t = __off_t;
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn rename(__old: *const libc::c_char, __new: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: libc::c_int,
        __old: *const libc::c_char,
        __newfd: libc::c_int,
        __new: *const libc::c_char,
    ) -> libc::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn tempnam(__dir: *const libc::c_char, __pfx: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fopen(__filename: *const libc::c_char, __modes: *const libc::c_char) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const libc::c_char,
        __modes: *const libc::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: libc::c_int, __modes: *const libc::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut libc::c_void,
        __len: usize,
        __modes: *const libc::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(__bufloc: *mut *mut libc::c_char, __sizeloc: *mut usize) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut libc::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut libc::c_char,
        __modes: libc::c_int,
        __n: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut libc::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(__stream: *mut FILE, __format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn printf(__format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn sprintf(__s: *mut libc::c_char, __format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const libc::c_char,
        __arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn vprintf(__format: *const libc::c_char, __arg: __builtin_va_list) -> libc::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut libc::c_char,
        __format: *const libc::c_char,
        __arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut libc::c_char,
        __maxlen: libc::c_uint,
        __format: *const libc::c_char,
        ...
    ) -> libc::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut libc::c_char,
        __maxlen: libc::c_uint,
        __format: *const libc::c_char,
        __arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: libc::c_int,
        __fmt: *const libc::c_char,
        __arg: __gnuc_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn dprintf(__fd: libc::c_int, __fmt: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn fscanf(__stream: *mut FILE, __format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn scanf(__format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn sscanf(__s: *const libc::c_char, __format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(__stream: *mut FILE, __format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(__s: *const libc::c_char, __format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const libc::c_char,
        __arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn vscanf(__format: *const libc::c_char, __arg: __builtin_va_list) -> libc::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const libc::c_char,
        __format: *const libc::c_char,
        __arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const libc::c_char,
        __arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(__format: *const libc::c_char, __arg: __builtin_va_list) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const libc::c_char,
        __format: *const libc::c_char,
        __arg: __builtin_va_list,
    ) -> libc::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn getchar() -> libc::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> libc::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fputc(__c: libc::c_int, __stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn putc(__c: libc::c_int, __stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn putchar(__c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: libc::c_int, __stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: libc::c_int, __stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn putw(__w: libc::c_int, __stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut libc::c_char,
        __n: libc::c_int,
        __stream: *mut FILE,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut libc::c_char,
        __n: *mut usize,
        __delimiter: libc::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut libc::c_char,
        __n: *mut usize,
        __delimiter: libc::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut libc::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const libc::c_char, __stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn puts(__s: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn ungetc(__c: libc::c_int, __stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut libc::c_void,
        __size: libc::c_uint,
        __n: libc::c_uint,
        __stream: *mut FILE,
    ) -> libc::c_uint;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const libc::c_void,
        __size: libc::c_uint,
        __n: libc::c_uint,
        __s: *mut FILE,
    ) -> libc::c_uint;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut libc::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const libc::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(__stream: *mut FILE, __off: libc::c_long, __whence: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> libc::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(__stream: *mut FILE, __off: __off_t, __whence: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> libc::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> libc::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn perror(__s: *const libc::c_char);
}
extern "C" {
    pub static mut sys_nerr: libc::c_int;
}
extern "C" {
    pub static sys_errlist: [*const libc::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn popen(__command: *const libc::c_char, __modes: *const libc::c_char) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: libc::c_int) -> libc::c_int;
}
#[repr(u32)]
#[doc = " IMP ID."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum IMPDeviceID {
    #[doc = "< "]
    DEV_ID_FS = 0,
    #[doc = "< "]
    DEV_ID_ENC = 1,
    #[doc = "< "]
    DEV_ID_DEC = 2,
    #[doc = "< "]
    DEV_ID_IVS = 3,
    #[doc = "< "]
    DEV_ID_OSD = 4,
    #[doc = "< FB FG1Direct"]
    DEV_ID_FG1DIRECT = 5,
    DEV_ID_RESERVED_START = 6,
    DEV_ID_RESERVED_END = 23,
    NR_MAX_DEVICES = 24,
}
#[doc = " IMPCell."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMPCell {
    #[doc = "< ID"]
    pub deviceID: IMPDeviceID,
    #[doc = "< ID"]
    pub groupID: libc::c_int,
    #[doc = "< ID"]
    pub outputID: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMPCell"][::core::mem::size_of::<IMPCell>() - 12usize];
    ["Alignment of IMPCell"][::core::mem::align_of::<IMPCell>() - 4usize];
    ["Offset of field: IMPCell::deviceID"][::core::mem::offset_of!(IMPCell, deviceID) - 0usize];
    ["Offset of field: IMPCell::groupID"][::core::mem::offset_of!(IMPCell, groupID) - 4usize];
    ["Offset of field: IMPCell::outputID"][::core::mem::offset_of!(IMPCell, outputID) - 8usize];
};
impl Default for IMPCell {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " IMP."]
#[repr(C)]
#[derive(Debug, Default)]
pub struct IMPFrameInfo {
    #[doc = "< "]
    pub index: libc::c_int,
    #[doc = "< PoolID"]
    pub pool_idx: libc::c_int,
    #[doc = "< "]
    pub width: u32,
    #[doc = "< "]
    pub height: u32,
    #[doc = "< "]
    pub pixfmt: u32,
    #[doc = "< "]
    pub size: u32,
    #[doc = "< "]
    pub phyAddr: u32,
    #[doc = "< "]
    pub virAddr: u32,
    #[doc = "< "]
    pub direct_phyAddr: u32,
    #[doc = "< "]
    pub timeStamp: i64,
    #[doc = "< dq"]
    pub timeStamp_ivdc: i64,
    #[doc = "< "]
    pub priv_: __IncompleteArrayField<u32>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMPFrameInfo"][::core::mem::size_of::<IMPFrameInfo>() - 56usize];
    ["Alignment of IMPFrameInfo"][::core::mem::align_of::<IMPFrameInfo>() - 8usize];
    ["Offset of field: IMPFrameInfo::index"][::core::mem::offset_of!(IMPFrameInfo, index) - 0usize];
    ["Offset of field: IMPFrameInfo::pool_idx"]
        [::core::mem::offset_of!(IMPFrameInfo, pool_idx) - 4usize];
    ["Offset of field: IMPFrameInfo::width"][::core::mem::offset_of!(IMPFrameInfo, width) - 8usize];
    ["Offset of field: IMPFrameInfo::height"]
        [::core::mem::offset_of!(IMPFrameInfo, height) - 12usize];
    ["Offset of field: IMPFrameInfo::pixfmt"]
        [::core::mem::offset_of!(IMPFrameInfo, pixfmt) - 16usize];
    ["Offset of field: IMPFrameInfo::size"][::core::mem::offset_of!(IMPFrameInfo, size) - 20usize];
    ["Offset of field: IMPFrameInfo::phyAddr"]
        [::core::mem::offset_of!(IMPFrameInfo, phyAddr) - 24usize];
    ["Offset of field: IMPFrameInfo::virAddr"]
        [::core::mem::offset_of!(IMPFrameInfo, virAddr) - 28usize];
    ["Offset of field: IMPFrameInfo::direct_phyAddr"]
        [::core::mem::offset_of!(IMPFrameInfo, direct_phyAddr) - 32usize];
    ["Offset of field: IMPFrameInfo::timeStamp"]
        [::core::mem::offset_of!(IMPFrameInfo, timeStamp) - 40usize];
    ["Offset of field: IMPFrameInfo::timeStamp_ivdc"]
        [::core::mem::offset_of!(IMPFrameInfo, timeStamp_ivdc) - 48usize];
    ["Offset of field: IMPFrameInfo::priv_"]
        [::core::mem::offset_of!(IMPFrameInfo, priv_) - 56usize];
};
#[doc = " IMP."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct IMPFrameTimestamp {
    #[doc = "< "]
    pub ts: u64,
    #[doc = "< "]
    pub minus: u64,
    #[doc = "< "]
    pub plus: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMPFrameTimestamp"][::core::mem::size_of::<IMPFrameTimestamp>() - 24usize];
    ["Alignment of IMPFrameTimestamp"][::core::mem::align_of::<IMPFrameTimestamp>() - 8usize];
    ["Offset of field: IMPFrameTimestamp::ts"]
        [::core::mem::offset_of!(IMPFrameTimestamp, ts) - 0usize];
    ["Offset of field: IMPFrameTimestamp::minus"]
        [::core::mem::offset_of!(IMPFrameTimestamp, minus) - 8usize];
    ["Offset of field: IMPFrameTimestamp::plus"]
        [::core::mem::offset_of!(IMPFrameTimestamp, plus) - 16usize];
};
#[repr(u32)]
#[doc = " "]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum IMPPayloadType {
    #[doc = "< JPEG"]
    PT_JPEG = 0,
    #[doc = "< H264"]
    PT_H264 = 1,
    #[doc = "< H265"]
    PT_H265 = 2,
}
#[repr(u32)]
#[doc = " IMP."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum IMPPixelFormat {
    #[doc = "< planar YUV 4:2:0, 12bpp, (1 Cr & Cb sample per 2x2 Y samples)"]
    PIX_FMT_YUV420P = 0,
    #[doc = "< packed YUV 4:2:2, 16bpp, Y0 Cb Y1 Cr"]
    PIX_FMT_YUYV422 = 1,
    #[doc = "< packed YUV 4:2:2, 16bpp, Cb Y0 Cr Y1"]
    PIX_FMT_UYVY422 = 2,
    #[doc = "< planar YUV 4:2:2, 16bpp, (1 Cr & Cb sample per 2x1 Y samples)"]
    PIX_FMT_YUV422P = 3,
    #[doc = "< planar YUV 4:4:4, 24bpp, (1 Cr & Cb sample per 1x1 Y samples)"]
    PIX_FMT_YUV444P = 4,
    #[doc = "< planar YUV 4:1:0,  9bpp, (1 Cr & Cb sample per 4x4 Y samples)"]
    PIX_FMT_YUV410P = 5,
    #[doc = "< planar YUV 4:1:1, 12bpp, (1 Cr & Cb sample per 4x1 Y samples)"]
    PIX_FMT_YUV411P = 6,
    #[doc = "<\t   Y\t    ,  8bpp"]
    PIX_FMT_GRAY8 = 7,
    #[doc = "<\t   Y\t    ,  1bpp, 0 is white, 1 is black, in each byte pixels are ordered from the msb to the lsb"]
    PIX_FMT_MONOWHITE = 8,
    #[doc = "<\t   Y\t    ,  1bpp, 0 is black, 1 is white, in each byte pixels are ordered from the msb to the lsb"]
    PIX_FMT_MONOBLACK = 9,
    #[doc = "< planar YUV 4:2:0, 12bpp, 1 plane for Y and 1 plane for the UV components, which are interleaved (first byte U and the following byte V)"]
    PIX_FMT_NV12 = 10,
    #[doc = "< as above, but U and V bytes are swapped"]
    PIX_FMT_NV21 = 11,
    #[doc = "< packed RGB 8:8:8, 24bpp, RGBRGB..."]
    PIX_FMT_RGB24 = 12,
    #[doc = "< packed RGB 8:8:8, 24bpp, BGRBGR..."]
    PIX_FMT_BGR24 = 13,
    #[doc = "< packed ARGB 8:8:8:8, 32bpp, ARGBARGB..."]
    PIX_FMT_ARGB = 14,
    #[doc = "< packed RGBA 8:8:8:8, 32bpp, RGBARGBA..."]
    PIX_FMT_RGBA = 15,
    #[doc = "< packed ABGR 8:8:8:8, 32bpp, ABGRABGR..."]
    PIX_FMT_ABGR = 16,
    #[doc = "< packed BGRA 8:8:8:8, 32bpp, BGRABGRA..."]
    PIX_FMT_BGRA = 17,
    #[doc = "< packed RGB 5:6:5, 16bpp, (msb)\t  5R 6G 5B(lsb), big-endian"]
    PIX_FMT_RGB565BE = 18,
    #[doc = "< packed RGB 5:6:5, 16bpp, (msb)\t  5R 6G 5B(lsb), little-endian"]
    PIX_FMT_RGB565LE = 19,
    #[doc = "< packed RGB 5:5:5, 16bpp, (msb)1A 5R 5G 5B(lsb), big-endian, most significant bit to 0"]
    PIX_FMT_RGB555BE = 20,
    #[doc = "< packed RGB 5:5:5, 16bpp, (msb)1A 5R 5G 5B(lsb), little-endian, most significant bit to 0"]
    PIX_FMT_RGB555LE = 21,
    #[doc = "< packed BGR 5:6:5, 16bpp, (msb)\t 5B 6G 5R(lsb), big-endian"]
    PIX_FMT_BGR565BE = 22,
    #[doc = "< packed BGR 5:6:5, 16bpp, (msb)\t 5B 6G 5R(lsb), little-endian"]
    PIX_FMT_BGR565LE = 23,
    #[doc = "< packed BGR 5:5:5, 16bpp, (msb)1A 5B 5G 5R(lsb), big-endian, most significant bit to 1"]
    PIX_FMT_BGR555BE = 24,
    #[doc = "< packed BGR 5:5:5, 16bpp, (msb)1A 5B 5G 5R(lsb), little-endian, most significant bit to 1"]
    PIX_FMT_BGR555LE = 25,
    #[doc = "< packed RGB 8:8:8, 32bpp, 0RGB0RGB..."]
    PIX_FMT_0RGB = 26,
    #[doc = "< packed RGB 8:8:8, 32bpp, RGB0RGB0..."]
    PIX_FMT_RGB0 = 27,
    #[doc = "< packed BGR 8:8:8, 32bpp, 0BGR0BGR..."]
    PIX_FMT_0BGR = 28,
    #[doc = "< packed BGR 8:8:8, 32bpp, BGR0BGR0..."]
    PIX_FMT_BGR0 = 29,
    #[doc = "< bayer, BGBG..(odd line), GRGR..(even line), 8-bit samples"]
    PIX_FMT_BAYER_BGGR8 = 30,
    #[doc = "< bayer, RGRG..(odd line), GBGB..(even line), 8-bit samples"]
    PIX_FMT_BAYER_RGGB8 = 31,
    #[doc = "< bayer, GBGB..(odd line), RGRG..(even line), 8-bit samples"]
    PIX_FMT_BAYER_GBRG8 = 32,
    #[doc = "< bayer, GRGR..(odd line), BGBG..(even line), 8-bit samples"]
    PIX_FMT_BAYER_GRBG8 = 33,
    PIX_FMT_RAW = 34,
    PIX_FMT_HSV = 35,
    #[doc = "< number of pixel formats."]
    PIX_FMT_NB = 36,
}
#[doc = " IMP."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct IMPPoint {
    #[doc = "<"]
    pub x: libc::c_int,
    #[doc = "<"]
    pub y: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMPPoint"][::core::mem::size_of::<IMPPoint>() - 8usize];
    ["Alignment of IMPPoint"][::core::mem::align_of::<IMPPoint>() - 4usize];
    ["Offset of field: IMPPoint::x"][::core::mem::offset_of!(IMPPoint, x) - 0usize];
    ["Offset of field: IMPPoint::y"][::core::mem::offset_of!(IMPPoint, y) - 4usize];
};
#[doc = " IMP .\n\n p0(100,100)widthheight100p1(199,199)\n width = abs(p1.x-p0.x)+1   height = abs(p1.y-p0.y)+1  +1\n p0(100,100) _____100______\n            |              |\n            |              |\n         100|              |\n            |              |\n            |______________|\n                           p1(199,199)\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct IMPRect {
    #[doc = "<"]
    pub p0: IMPPoint,
    #[doc = "<"]
    pub p1: IMPPoint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMPRect"][::core::mem::size_of::<IMPRect>() - 16usize];
    ["Alignment of IMPRect"][::core::mem::align_of::<IMPRect>() - 4usize];
    ["Offset of field: IMPRect::p0"][::core::mem::offset_of!(IMPRect, p0) - 0usize];
    ["Offset of field: IMPRect::p1"][::core::mem::offset_of!(IMPRect, p1) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct IMPLine {
    #[doc = "< "]
    pub p0: IMPPoint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMPLine"][::core::mem::size_of::<IMPLine>() - 8usize];
    ["Alignment of IMPLine"][::core::mem::align_of::<IMPLine>() - 4usize];
    ["Offset of field: IMPLine::p0"][::core::mem::offset_of!(IMPLine, p0) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMPIVSInterface {
    #[doc = "< "]
    pub param: *mut libc::c_void,
    #[doc = "< "]
    pub paramSize: libc::c_int,
    #[doc = "< "]
    pub pixfmt: IMPPixelFormat,
    #[doc = "< "]
    pub init:
        ::core::option::Option<unsafe extern "C" fn(inf: *mut IMPIVSInterface) -> libc::c_int>,
    #[doc = "< "]
    pub exit: ::core::option::Option<unsafe extern "C" fn(inf: *mut IMPIVSInterface)>,
    #[doc = "< framefree frame>=0 <0"]
    pub preProcessSync: ::core::option::Option<
        unsafe extern "C" fn(inf: *mut IMPIVSInterface, frame: *mut IMPFrameInfo) -> libc::c_int,
    >,
    #[doc = "< , SDK IVS frame framefree_data; ,;:0->,1->,-1->"]
    pub processAsync: ::core::option::Option<
        unsafe extern "C" fn(inf: *mut IMPIVSInterface, frame: *mut IMPFrameInfo) -> libc::c_int,
    >,
    #[doc = "< "]
    pub getResult: ::core::option::Option<
        unsafe extern "C" fn(
            inf: *mut IMPIVSInterface,
            result: *mut *mut libc::c_void,
        ) -> libc::c_int,
    >,
    #[doc = "< "]
    pub releaseResult: ::core::option::Option<
        unsafe extern "C" fn(inf: *mut IMPIVSInterface, result: *mut libc::c_void) -> libc::c_int,
    >,
    #[doc = "< "]
    pub getParam: ::core::option::Option<
        unsafe extern "C" fn(inf: *mut IMPIVSInterface, param: *mut libc::c_void) -> libc::c_int,
    >,
    #[doc = "< "]
    pub setParam: ::core::option::Option<
        unsafe extern "C" fn(inf: *mut IMPIVSInterface, param: *mut libc::c_void) -> libc::c_int,
    >,
    #[doc = "< processAsyncframe"]
    pub flushFrame:
        ::core::option::Option<unsafe extern "C" fn(inf: *mut IMPIVSInterface) -> libc::c_int>,
    #[doc = "< "]
    pub priv_: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMPIVSInterface"][::core::mem::size_of::<IMPIVSInterface>() - 52usize];
    ["Alignment of IMPIVSInterface"][::core::mem::align_of::<IMPIVSInterface>() - 4usize];
    ["Offset of field: IMPIVSInterface::param"]
        [::core::mem::offset_of!(IMPIVSInterface, param) - 0usize];
    ["Offset of field: IMPIVSInterface::paramSize"]
        [::core::mem::offset_of!(IMPIVSInterface, paramSize) - 4usize];
    ["Offset of field: IMPIVSInterface::pixfmt"]
        [::core::mem::offset_of!(IMPIVSInterface, pixfmt) - 8usize];
    ["Offset of field: IMPIVSInterface::init"]
        [::core::mem::offset_of!(IMPIVSInterface, init) - 12usize];
    ["Offset of field: IMPIVSInterface::exit"]
        [::core::mem::offset_of!(IMPIVSInterface, exit) - 16usize];
    ["Offset of field: IMPIVSInterface::preProcessSync"]
        [::core::mem::offset_of!(IMPIVSInterface, preProcessSync) - 20usize];
    ["Offset of field: IMPIVSInterface::processAsync"]
        [::core::mem::offset_of!(IMPIVSInterface, processAsync) - 24usize];
    ["Offset of field: IMPIVSInterface::getResult"]
        [::core::mem::offset_of!(IMPIVSInterface, getResult) - 28usize];
    ["Offset of field: IMPIVSInterface::releaseResult"]
        [::core::mem::offset_of!(IMPIVSInterface, releaseResult) - 32usize];
    ["Offset of field: IMPIVSInterface::getParam"]
        [::core::mem::offset_of!(IMPIVSInterface, getParam) - 36usize];
    ["Offset of field: IMPIVSInterface::setParam"]
        [::core::mem::offset_of!(IMPIVSInterface, setParam) - 40usize];
    ["Offset of field: IMPIVSInterface::flushFrame"]
        [::core::mem::offset_of!(IMPIVSInterface, flushFrame) - 44usize];
    ["Offset of field: IMPIVSInterface::priv_"]
        [::core::mem::offset_of!(IMPIVSInterface, priv_) - 48usize];
};
impl Default for IMPIVSInterface {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    #[doc = " \n\n @fn int IMP_IVS_CreateGroup(int GrpNum);\n\n @param[in] GrpNum IVS\n\n @retval 0 \n @retval -1 \n\n @remark \n\n @attention "]
    pub fn IMP_IVS_CreateGroup(GrpNum: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = " \n\n @fn int IMP_IVS_DestroyGroup(int GrpNum);\n\n @param[in] GrpNum IVS\n\n @retval 0 \n @retval -1 \n\n @remark \n\n @attention "]
    pub fn IMP_IVS_DestroyGroup(GrpNum: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = " IVS\n\n @fn int IMP_IVS_CreateChn(int ChnNum, IMPIVSInterface *handler);\n\n @param[in] ChnNum \n\n @param[in] handler IVS\n\n @retval 0 \n @retval -1 \n\n @remark .\n\n @attention "]
    pub fn IMP_IVS_CreateChn(ChnNum: libc::c_int, handler: *mut IMPIVSInterface) -> libc::c_int;
}
extern "C" {
    #[doc = " IVS\n\n @fn int IMP_IVS_DestroyChn(int ChnNum);\n\n @param[in] ChnNum \n\n @retval 0 \n @retval -1 \n\n @remark \n\n @attention "]
    pub fn IMP_IVS_DestroyChn(ChnNum: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = " \n\n @fn int IMP_IVS_RegisterChn(int GrpNum, int ChnNum);\n\n @param[in] GrpNum IVS\n @param[in] ChnNum IVS\n\n @retval 0 \n @retval -1 \n\n @remark ChnnumGrpnum\n\n @attention "]
    pub fn IMP_IVS_RegisterChn(GrpNum: libc::c_int, ChnNum: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = " \n\n @fn int IMP_IVS_UnRegisterChn(int ChnNum);\n\n @param[in] ChnNum IVS\n\n @retval 0 \n @retval -1 \n\n @remark GrpnumChnnum\n\n @attention "]
    pub fn IMP_IVS_UnRegisterChn(ChnNum: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = " \n\n @fn int IMP_IVS_StartRecvPic(int ChnNum);\n\n @param[in] ChnNum \n\n @retval 0 \n @retval -1 \n\n @remark ChnnumIVS\n\n @attention "]
    pub fn IMP_IVS_StartRecvPic(ChnNum: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = " \n\n @fn int IMP_IVS_StopRecvPic(int ChnNum);\n\n @param[in] ChnNum \n\n @retval 0 \n @retval -1 \n\n @remark ChnnumIVS\n\n @attention "]
    pub fn IMP_IVS_StopRecvPic(ChnNum: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = " IVS\n\n @fn int IMP_IVS_PollingResult(int ChnNum, int timeoutMs);\n\n @param[in] ChnNum IVS\n @param[in] timeout ms; IMP_IVS_DEFAULT_TIMEOUTMS:,0:,>0:\n\n @retval 0 \n @retval -1 \n\n @remark IMPIVSInterfaceProcessAsync0Polling\n\n @attention "]
    pub fn IMP_IVS_PollingResult(ChnNum: libc::c_int, timeoutMs: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[doc = " IVS\n\n @fn int IMP_IVS_GetResult(int ChnNum, void **result);\n\n @param[in] ChnNum IVS\n @param[in] result IVS\n\n @retval 0 \n @retval -1 \n\n @remark IVS,.\n\n @attention "]
    pub fn IMP_IVS_GetResult(ChnNum: libc::c_int, result: *mut *mut libc::c_void) -> libc::c_int;
}
extern "C" {
    #[doc = " IVS\n\n @fn int IMP_IVS_ReleaseResult(int ChnNum, void *result);\n\n @param[in] GrpNum \n @param[in] ChnNum IVS\n @param[in] result IVS\n\n @retval 0 \n @retval -1 \n\n @remark IVS,.\n\n @attention "]
    pub fn IMP_IVS_ReleaseResult(ChnNum: libc::c_int, result: *mut libc::c_void) -> libc::c_int;
}
extern "C" {
    #[doc = " Datacallbackframe\n\n @fn int IMP_IVS_ReleaseData(void *vaddr);\n\n @param[in] vaddr \n\n @retval 0 \n @retval -1 \n\n @remark Datacallbackframe\n @remark \n\n @attention "]
    pub fn IMP_IVS_ReleaseData(vaddr: *mut libc::c_void) -> libc::c_int;
}
extern "C" {
    #[doc = " \n\n @fn int IMP_IVS_GetParam(int chnNum, void *param);\n\n @param[in] ChnNum IVS\n @param[in] param \n\n @retval 0 \n @retval -1 \n\n @attention "]
    pub fn IMP_IVS_GetParam(chnNum: libc::c_int, param: *mut libc::c_void) -> libc::c_int;
}
extern "C" {
    #[doc = " \n\n @fn int IMP_IVS_SetParam(int chnNum, void *param);\n\n @param[in] ChnNum IVS\n @param[in] param \n\n @retval 0 \n @retval -1 \n\n @attention "]
    pub fn IMP_IVS_SetParam(chnNum: libc::c_int, param: *mut libc::c_void) -> libc::c_int;
}
#[doc = " "]
#[repr(C)]
#[derive(Debug)]
pub struct IMP_IVS_MoveParam {
    #[doc = "< , 0-40-8"]
    pub sense: [libc::c_int; 52usize],
    pub skipFrameCnt: libc::c_int,
    #[doc = "< ,widthheight"]
    pub frameInfo: IMPFrameInfo,
    pub roiRect: [IMPRect; 52usize],
    pub roiRectCnt: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMP_IVS_MoveParam"][::core::mem::size_of::<IMP_IVS_MoveParam>() - 1112usize];
    ["Alignment of IMP_IVS_MoveParam"][::core::mem::align_of::<IMP_IVS_MoveParam>() - 8usize];
    ["Offset of field: IMP_IVS_MoveParam::sense"]
        [::core::mem::offset_of!(IMP_IVS_MoveParam, sense) - 0usize];
    ["Offset of field: IMP_IVS_MoveParam::skipFrameCnt"]
        [::core::mem::offset_of!(IMP_IVS_MoveParam, skipFrameCnt) - 208usize];
    ["Offset of field: IMP_IVS_MoveParam::frameInfo"]
        [::core::mem::offset_of!(IMP_IVS_MoveParam, frameInfo) - 216usize];
    ["Offset of field: IMP_IVS_MoveParam::roiRect"]
        [::core::mem::offset_of!(IMP_IVS_MoveParam, roiRect) - 272usize];
    ["Offset of field: IMP_IVS_MoveParam::roiRectCnt"]
        [::core::mem::offset_of!(IMP_IVS_MoveParam, roiRectCnt) - 1104usize];
};
impl Default for IMP_IVS_MoveParam {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMP_IVS_MoveOutput {
    pub retRoi: [libc::c_int; 52usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMP_IVS_MoveOutput"][::core::mem::size_of::<IMP_IVS_MoveOutput>() - 208usize];
    ["Alignment of IMP_IVS_MoveOutput"][::core::mem::align_of::<IMP_IVS_MoveOutput>() - 4usize];
    ["Offset of field: IMP_IVS_MoveOutput::retRoi"]
        [::core::mem::offset_of!(IMP_IVS_MoveOutput, retRoi) - 0usize];
};
impl Default for IMP_IVS_MoveOutput {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    #[doc = " \n\n @fn IMPIVSInterface *IMP_IVS_CreateMoveInterface(IMP_IVS_MoveParam *param);\n\n @param[in] param \n\n @retval NULL ,\n @retval NULL \n\n @attention "]
    pub fn IMP_IVS_CreateMoveInterface(param: *mut IMP_IVS_MoveParam) -> *mut IMPIVSInterface;
}
extern "C" {
    #[doc = " \n\n @fn void IMP_IVS_DestroyMoveInterface(IMPIVSInterface *moveInterface);\n\n @param[in] moveInterface \n\n @retval \n\n @attention "]
    pub fn IMP_IVS_DestroyMoveInterface(moveInterface: *mut IMPIVSInterface);
}
#[doc = " IMP."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMPVersion {
    #[doc = "< IMP"]
    pub aVersion: [libc::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMPVersion"][::core::mem::size_of::<IMPVersion>() - 64usize];
    ["Alignment of IMPVersion"][::core::mem::align_of::<IMPVersion>() - 1usize];
    ["Offset of field: IMPVersion::aVersion"]
        [::core::mem::offset_of!(IMPVersion, aVersion) - 0usize];
};
impl Default for IMPVersion {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    #[doc = " @fn int IMP_System_Init(void)\n\n IMP.\n\n @param .\n\n @retval 0 .\n @retval 0 .\n\n @remark API.\n\n @attention IMP."]
    pub fn IMP_System_Init() -> libc::c_int;
}
extern "C" {
    #[doc = " @fn int IMP_System_Exit(void)\n\n IMP.\n\n @param .\n\n @retval 0 .\n @retval 0 .\n\n @remark IMP.\n\n @attention APIIMPIMP."]
    pub fn IMP_System_Exit() -> libc::c_int;
}
extern "C" {
    #[doc = " @fn int64_t IMP_System_GetTimeStamp(void)\n\n IMP\n\n @param \n\n @retval (usec)\n\n @remark \n\n @attention "]
    pub fn IMP_System_GetTimeStamp() -> i64;
}
extern "C" {
    #[doc = " @fn int IMP_System_RebaseTimeStamp(int64_t basets)\n\n IMP\n\n @param[in] basets \n\n @retval 0 .\n @retval 0 .\n\n @remark \n\n @attention "]
    pub fn IMP_System_RebaseTimeStamp(basets: i64) -> libc::c_int;
}
extern "C" {
    #[doc = " @fn uint32_t IMP_System_ReadReg32(uint32_t u32Addr)\n\n 32\n\n @param[in] regAddr \n\n @retval 32\n\n @remark \n\n @attention "]
    pub fn IMP_System_ReadReg32(regAddr: u32) -> u32;
}
extern "C" {
    #[doc = " @fn void IMP_System_WriteReg32(uint32_t regAddr, uint32_t value)\n\n 32\n\n @param[in] regAddr \n @param[in] value \n\n @retval \n\n @remark \n\n @attention API"]
    pub fn IMP_System_WriteReg32(regAddr: u32, value: u32);
}
extern "C" {
    #[doc = " @fn int IMP_System_GetVersion(IMPVersion *pstVersion)\n\n IMP.\n\n @param[out] pstVersion IMP.\n\n @retval 0 .\n @retval 0 .\n\n @remark .\n\n @attention ."]
    pub fn IMP_System_GetVersion(pstVersion: *mut IMPVersion) -> libc::c_int;
}
extern "C" {
    #[doc = " @fn const char* IMP_System_GetCPUInfo(void)\n\n CPU.\n\n @param .\n\n @retval CPU.\n\n @remark CPU,T10,\"T10\"\"T10-Lite\".\n\n @attention ."]
    pub fn IMP_System_GetCPUInfo() -> *const libc::c_char;
}
extern "C" {
    #[doc = " @fn int IMP_System_Bind(IMPCell *srcCell, IMPCell *dstCell)\n\n CellCell.\n\n @param[in] srcCell Cell.\n @param[in] dstCell Cell.\n\n @retval 0 .\n @retval 0 .\n\n @remark DeviceGroupOutputDeviceGroupGroupOutput\\n\n GroupDeviceOutputDevice.Device \\n\n OutputDeviceGroup.\n @remark Cell(Output)Cell(Group).\n\n @attention "]
    pub fn IMP_System_Bind(srcCell: *mut IMPCell, dstCell: *mut IMPCell) -> libc::c_int;
}
extern "C" {
    #[doc = " @fn int IMP_System_UnBind(IMPCell *srcCell, IMPCell *dstCell)\n\n CellCell.\n\n @param[in] srcCell Cell.\n @param[in] dstCell Cell.\n\n\n @retval 0 .\n @retval 0 .\n\n @remark .\n\n @attention "]
    pub fn IMP_System_UnBind(srcCell: *mut IMPCell, dstCell: *mut IMPCell) -> libc::c_int;
}
extern "C" {
    #[doc = " @fn int IMP_System_GetBindbyDest(IMPCell *dstCell, IMPCell *srcCell)\n\n CellCell.\n\n @param[in] dstCell Cell.\n @param[out] srcCell Cell.\n\n\n @retval 0 .\n @retval 0 .\n\n @remark .\n\n @attention "]
    pub fn IMP_System_GetBindbyDest(dstCell: *mut IMPCell, srcCell: *mut IMPCell) -> libc::c_int;
}
extern "C" {
    #[doc = " @brief IMP_System_MemPoolRequest(int poolId, size_t size, const char *name);\n\n Rmemmempool\n\n @param[in] poolId     poolID.\n @param[in] size       .\n @param[in] name       pool.\n\n @retval    0          .\n @retval    0        .\n\n @remarks\n ,,\n ,.\n RMEM,\n .\n ,\n \n\n @attention ."]
    pub fn IMP_System_MemPoolRequest(
        poolId: libc::c_int,
        size: usize,
        name: *mut libc::c_char,
    ) -> libc::c_int;
}
pub const IMP_LOG_LEVEL_UNKNOWN: _bindgen_ty_11 = _bindgen_ty_11::IMP_LOG_LEVEL_UNKNOWN;
pub const IMP_LOG_LEVEL_RESERVED: _bindgen_ty_11 = _bindgen_ty_11::IMP_LOG_LEVEL_RESERVED;
pub const IMP_LOG_LEVEL_VERBOSE: _bindgen_ty_11 = _bindgen_ty_11::IMP_LOG_LEVEL_VERBOSE;
pub const IMP_LOG_LEVEL_DEBUG: _bindgen_ty_11 = _bindgen_ty_11::IMP_LOG_LEVEL_DEBUG;
pub const IMP_LOG_LEVEL_INFO: _bindgen_ty_11 = _bindgen_ty_11::IMP_LOG_LEVEL_INFO;
pub const IMP_LOG_LEVEL_WARN: _bindgen_ty_11 = _bindgen_ty_11::IMP_LOG_LEVEL_WARN;
pub const IMP_LOG_LEVEL_ERROR: _bindgen_ty_11 = _bindgen_ty_11::IMP_LOG_LEVEL_ERROR;
pub const IMP_LOG_LEVEL_FATAL: _bindgen_ty_11 = _bindgen_ty_11::IMP_LOG_LEVEL_FATAL;
pub const IMP_LOG_LEVEL_SILENT: _bindgen_ty_11 = _bindgen_ty_11::IMP_LOG_LEVEL_SILENT;
#[repr(u32)]
#[doc = " define log level"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_11 {
    IMP_LOG_LEVEL_UNKNOWN = 0,
    IMP_LOG_LEVEL_RESERVED = 1,
    IMP_LOG_LEVEL_VERBOSE = 2,
    IMP_LOG_LEVEL_DEBUG = 3,
    IMP_LOG_LEVEL_INFO = 4,
    IMP_LOG_LEVEL_WARN = 5,
    IMP_LOG_LEVEL_ERROR = 6,
    IMP_LOG_LEVEL_FATAL = 7,
    IMP_LOG_LEVEL_SILENT = 8,
}
extern "C" {
    #[doc = " used internal"]
    pub fn imp_log_fun(
        le: libc::c_int,
        op: libc::c_int,
        out: libc::c_int,
        tag: *const libc::c_char,
        file: *const libc::c_char,
        line: libc::c_int,
        func: *const libc::c_char,
        fmt: *const libc::c_char,
        ...
    );
}
extern "C" {
    #[doc = " \n\n @fn void IMP_Log_Set_Option(int op);\n\n @param[in] op \n"]
    pub fn IMP_Log_Set_Option(op: libc::c_int);
}
extern "C" {
    #[doc = " \n\n @fn int IMP_Log_Get_Option(void );\n\n @retval \n"]
    pub fn IMP_Log_Get_Option() -> libc::c_int;
}
extern "C" {
    pub fn memcpy(
        __dest: *mut libc::c_void,
        __src: *const libc::c_void,
        __n: libc::c_uint,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut libc::c_void,
        __src: *const libc::c_void,
        __n: libc::c_uint,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut libc::c_void,
        __src: *const libc::c_void,
        __c: libc::c_int,
        __n: libc::c_uint,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn memset(__s: *mut libc::c_void, __c: libc::c_int, __n: libc::c_uint)
        -> *mut libc::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const libc::c_void,
        __s2: *const libc::c_void,
        __n: libc::c_uint,
    ) -> libc::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const libc::c_void,
        __c: libc::c_int,
        __n: libc::c_uint,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn strcpy(__dest: *mut libc::c_char, __src: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut libc::c_char,
        __src: *const libc::c_char,
        __n: libc::c_uint,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strcat(__dest: *mut libc::c_char, __src: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut libc::c_char,
        __src: *const libc::c_char,
        __n: libc::c_uint,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strcmp(__s1: *const libc::c_char, __s2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const libc::c_char,
        __s2: *const libc::c_char,
        __n: libc::c_uint,
    ) -> libc::c_int;
}
extern "C" {
    pub fn strcoll(__s1: *const libc::c_char, __s2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut libc::c_char,
        __src: *const libc::c_char,
        __n: libc::c_uint,
    ) -> libc::c_uint;
}
extern "C" {
    pub fn strcoll_l(
        __s1: *const libc::c_char,
        __s2: *const libc::c_char,
        __l: locale_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut libc::c_char,
        __src: *const libc::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strdup(__s: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strndup(__string: *const libc::c_char, __n: libc::c_uint) -> *mut libc::c_char;
}
extern "C" {
    pub fn strchr(__s: *const libc::c_char, __c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn strrchr(__s: *const libc::c_char, __c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn strcspn(__s: *const libc::c_char, __reject: *const libc::c_char) -> libc::c_uint;
}
extern "C" {
    pub fn strspn(__s: *const libc::c_char, __accept: *const libc::c_char) -> libc::c_uint;
}
extern "C" {
    pub fn strpbrk(__s: *const libc::c_char, __accept: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const libc::c_char,
        __needle: *const libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strtok(__s: *mut libc::c_char, __delim: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut libc::c_char,
        __delim: *const libc::c_char,
        __save_ptr: *mut *mut libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut libc::c_char,
        __delim: *const libc::c_char,
        __save_ptr: *mut *mut libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strlen(__s: *const libc::c_char) -> libc::c_uint;
}
extern "C" {
    pub fn strnlen(__string: *const libc::c_char, __maxlen: usize) -> usize;
}
extern "C" {
    pub fn strerror(__errnum: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: libc::c_int,
        __buf: *mut libc::c_char,
        __buflen: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn strerror_l(__errnum: libc::c_int, __l: locale_t) -> *mut libc::c_char;
}
extern "C" {
    pub fn bcmp(
        __s1: *const libc::c_void,
        __s2: *const libc::c_void,
        __n: libc::c_uint,
    ) -> libc::c_int;
}
extern "C" {
    pub fn bcopy(__src: *const libc::c_void, __dest: *mut libc::c_void, __n: usize);
}
extern "C" {
    pub fn bzero(__s: *mut libc::c_void, __n: libc::c_uint);
}
extern "C" {
    pub fn index(__s: *const libc::c_char, __c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn rindex(__s: *const libc::c_char, __c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn ffs(__i: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn ffsl(__l: libc::c_long) -> libc::c_int;
}
extern "C" {
    pub fn ffsll(__ll: libc::c_longlong) -> libc::c_int;
}
extern "C" {
    pub fn strcasecmp(__s1: *const libc::c_char, __s2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const libc::c_char,
        __s2: *const libc::c_char,
        __n: libc::c_uint,
    ) -> libc::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        __s1: *const libc::c_char,
        __s2: *const libc::c_char,
        __loc: locale_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        __s1: *const libc::c_char,
        __s2: *const libc::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut libc::c_void, __n: usize);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut libc::c_char,
        __delim: *const libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strsignal(__sig: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn __stpcpy(__dest: *mut libc::c_char, __src: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn stpcpy(__dest: *mut libc::c_char, __src: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut libc::c_char,
        __src: *const libc::c_char,
        __n: usize,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut libc::c_char,
        __src: *const libc::c_char,
        __n: libc::c_uint,
    ) -> *mut libc::c_char;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type ulong = libc::c_ulong;
pub type ushort = libc::c_ushort;
pub type uint = libc::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = libc::c_int;
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union sem_t {
    pub __size: [libc::c_char; 16usize],
    pub __align: libc::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sem_t"][::core::mem::size_of::<sem_t>() - 16usize];
    ["Alignment of sem_t"][::core::mem::align_of::<sem_t>() - 4usize];
    ["Offset of field: sem_t::__size"][::core::mem::offset_of!(sem_t, __size) - 0usize];
    ["Offset of field: sem_t::__align"][::core::mem::offset_of!(sem_t, __align) - 0usize];
};
impl Default for sem_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn sem_init(
        __sem: *mut sem_t,
        __pshared: libc::c_int,
        __value: libc::c_uint,
    ) -> libc::c_int;
}
extern "C" {
    pub fn sem_destroy(__sem: *mut sem_t) -> libc::c_int;
}
extern "C" {
    pub fn sem_open(__name: *const libc::c_char, __oflag: libc::c_int, ...) -> *mut sem_t;
}
extern "C" {
    pub fn sem_close(__sem: *mut sem_t) -> libc::c_int;
}
extern "C" {
    pub fn sem_unlink(__name: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn sem_wait(__sem: *mut sem_t) -> libc::c_int;
}
extern "C" {
    pub fn sem_timedwait(__sem: *mut sem_t, __abstime: *const timespec) -> libc::c_int;
}
extern "C" {
    pub fn sem_trywait(__sem: *mut sem_t) -> libc::c_int;
}
extern "C" {
    pub fn sem_post(__sem: *mut sem_t) -> libc::c_int;
}
extern "C" {
    pub fn sem_getvalue(__sem: *mut sem_t, __sval: *mut libc::c_int) -> libc::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type float_t = f32;
pub type double_t = f64;
extern "C" {
    pub fn __fpclassify(__value: f64) -> libc::c_int;
}
extern "C" {
    pub fn __signbit(__value: f64) -> libc::c_int;
}
extern "C" {
    pub fn __isinf(__value: f64) -> libc::c_int;
}
extern "C" {
    pub fn __finite(__value: f64) -> libc::c_int;
}
extern "C" {
    pub fn __isnan(__value: f64) -> libc::c_int;
}
extern "C" {
    pub fn __iseqsig(__x: f64, __y: f64) -> libc::c_int;
}
extern "C" {
    pub fn __issignaling(__value: f64) -> libc::c_int;
}
extern "C" {
    pub fn acos(__x: f64) -> f64;
}
extern "C" {
    pub fn __acos(__x: f64) -> f64;
}
extern "C" {
    pub fn asin(__x: f64) -> f64;
}
extern "C" {
    pub fn __asin(__x: f64) -> f64;
}
extern "C" {
    pub fn atan(__x: f64) -> f64;
}
extern "C" {
    pub fn __atan(__x: f64) -> f64;
}
extern "C" {
    pub fn atan2(__y: f64, __x: f64) -> f64;
}
extern "C" {
    pub fn __atan2(__y: f64, __x: f64) -> f64;
}
extern "C" {
    pub fn cos(__x: f64) -> f64;
}
extern "C" {
    pub fn __cos(__x: f64) -> f64;
}
extern "C" {
    pub fn sin(__x: f64) -> f64;
}
extern "C" {
    pub fn __sin(__x: f64) -> f64;
}
extern "C" {
    pub fn tan(__x: f64) -> f64;
}
extern "C" {
    pub fn __tan(__x: f64) -> f64;
}
extern "C" {
    pub fn cosh(__x: f64) -> f64;
}
extern "C" {
    pub fn __cosh(__x: f64) -> f64;
}
extern "C" {
    pub fn sinh(__x: f64) -> f64;
}
extern "C" {
    pub fn __sinh(__x: f64) -> f64;
}
extern "C" {
    pub fn tanh(__x: f64) -> f64;
}
extern "C" {
    pub fn __tanh(__x: f64) -> f64;
}
extern "C" {
    pub fn acosh(__x: f64) -> f64;
}
extern "C" {
    pub fn __acosh(__x: f64) -> f64;
}
extern "C" {
    pub fn asinh(__x: f64) -> f64;
}
extern "C" {
    pub fn __asinh(__x: f64) -> f64;
}
extern "C" {
    pub fn atanh(__x: f64) -> f64;
}
extern "C" {
    pub fn __atanh(__x: f64) -> f64;
}
extern "C" {
    pub fn exp(__x: f64) -> f64;
}
extern "C" {
    pub fn __exp(__x: f64) -> f64;
}
extern "C" {
    pub fn frexp(__x: f64, __exponent: *mut libc::c_int) -> f64;
}
extern "C" {
    pub fn __frexp(__x: f64, __exponent: *mut libc::c_int) -> f64;
}
extern "C" {
    pub fn ldexp(__x: f64, __exponent: libc::c_int) -> f64;
}
extern "C" {
    pub fn __ldexp(__x: f64, __exponent: libc::c_int) -> f64;
}
extern "C" {
    pub fn log(__x: f64) -> f64;
}
extern "C" {
    pub fn __log(__x: f64) -> f64;
}
extern "C" {
    pub fn log10(__x: f64) -> f64;
}
extern "C" {
    pub fn __log10(__x: f64) -> f64;
}
extern "C" {
    pub fn modf(__x: f64, __iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn __modf(__x: f64, __iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn expm1(__x: f64) -> f64;
}
extern "C" {
    pub fn __expm1(__x: f64) -> f64;
}
extern "C" {
    pub fn log1p(__x: f64) -> f64;
}
extern "C" {
    pub fn __log1p(__x: f64) -> f64;
}
extern "C" {
    pub fn logb(__x: f64) -> f64;
}
extern "C" {
    pub fn __logb(__x: f64) -> f64;
}
extern "C" {
    pub fn exp2(__x: f64) -> f64;
}
extern "C" {
    pub fn __exp2(__x: f64) -> f64;
}
extern "C" {
    pub fn log2(__x: f64) -> f64;
}
extern "C" {
    pub fn __log2(__x: f64) -> f64;
}
extern "C" {
    pub fn pow(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __pow(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn sqrt(__x: f64) -> f64;
}
extern "C" {
    pub fn __sqrt(__x: f64) -> f64;
}
extern "C" {
    pub fn hypot(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __hypot(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn cbrt(__x: f64) -> f64;
}
extern "C" {
    pub fn __cbrt(__x: f64) -> f64;
}
extern "C" {
    pub fn ceil(__x: f64) -> f64;
}
extern "C" {
    pub fn __ceil(__x: f64) -> f64;
}
extern "C" {
    pub fn fabs(__x: f64) -> f64;
}
extern "C" {
    pub fn __fabs(__x: f64) -> f64;
}
extern "C" {
    pub fn floor(__x: f64) -> f64;
}
extern "C" {
    pub fn __floor(__x: f64) -> f64;
}
extern "C" {
    pub fn fmod(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmod(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn isinf(__value: f64) -> libc::c_int;
}
extern "C" {
    pub fn finite(__value: f64) -> libc::c_int;
}
extern "C" {
    pub fn drem(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __drem(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn significand(__x: f64) -> f64;
}
extern "C" {
    pub fn __significand(__x: f64) -> f64;
}
extern "C" {
    pub fn copysign(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __copysign(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nan(__tagb: *const libc::c_char) -> f64;
}
extern "C" {
    pub fn __nan(__tagb: *const libc::c_char) -> f64;
}
extern "C" {
    pub fn isnan(__value: f64) -> libc::c_int;
}
extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn __j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn __j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn jn(arg1: libc::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn __jn(arg1: libc::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn __y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn __y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn yn(arg1: libc::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn __yn(arg1: libc::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn __erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn __erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn gamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __gamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma_r(arg1: f64, __signgamp: *mut libc::c_int) -> f64;
}
extern "C" {
    pub fn __lgamma_r(arg1: f64, __signgamp: *mut libc::c_int) -> f64;
}
extern "C" {
    pub fn rint(__x: f64) -> f64;
}
extern "C" {
    pub fn __rint(__x: f64) -> f64;
}
extern "C" {
    pub fn nextafter(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __nextafter(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nexttoward(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __nexttoward(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn remainder(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __remainder(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn scalbn(__x: f64, __n: libc::c_int) -> f64;
}
extern "C" {
    pub fn __scalbn(__x: f64, __n: libc::c_int) -> f64;
}
extern "C" {
    pub fn ilogb(__x: f64) -> libc::c_int;
}
extern "C" {
    pub fn __ilogb(__x: f64) -> libc::c_int;
}
extern "C" {
    pub fn scalbln(__x: f64, __n: libc::c_long) -> f64;
}
extern "C" {
    pub fn __scalbln(__x: f64, __n: libc::c_long) -> f64;
}
extern "C" {
    pub fn nearbyint(__x: f64) -> f64;
}
extern "C" {
    pub fn __nearbyint(__x: f64) -> f64;
}
extern "C" {
    pub fn round(__x: f64) -> f64;
}
extern "C" {
    pub fn __round(__x: f64) -> f64;
}
extern "C" {
    pub fn trunc(__x: f64) -> f64;
}
extern "C" {
    pub fn __trunc(__x: f64) -> f64;
}
extern "C" {
    pub fn remquo(__x: f64, __y: f64, __quo: *mut libc::c_int) -> f64;
}
extern "C" {
    pub fn __remquo(__x: f64, __y: f64, __quo: *mut libc::c_int) -> f64;
}
extern "C" {
    pub fn lrint(__x: f64) -> libc::c_long;
}
extern "C" {
    pub fn __lrint(__x: f64) -> libc::c_long;
}
extern "C" {
    pub fn llrint(__x: f64) -> libc::c_longlong;
}
extern "C" {
    pub fn __llrint(__x: f64) -> libc::c_longlong;
}
extern "C" {
    pub fn lround(__x: f64) -> libc::c_long;
}
extern "C" {
    pub fn __lround(__x: f64) -> libc::c_long;
}
extern "C" {
    pub fn llround(__x: f64) -> libc::c_longlong;
}
extern "C" {
    pub fn __llround(__x: f64) -> libc::c_longlong;
}
extern "C" {
    pub fn fdim(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fdim(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fmax(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmax(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fmin(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmin(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fma(__x: f64, __y: f64, __z: f64) -> f64;
}
extern "C" {
    pub fn __fma(__x: f64, __y: f64, __z: f64) -> f64;
}
extern "C" {
    pub fn scalb(__x: f64, __n: f64) -> f64;
}
extern "C" {
    pub fn __scalb(__x: f64, __n: f64) -> f64;
}
extern "C" {
    pub fn __fpclassifyf(__value: f32) -> libc::c_int;
}
extern "C" {
    pub fn __signbitf(__value: f32) -> libc::c_int;
}
extern "C" {
    pub fn __isinff(__value: f32) -> libc::c_int;
}
extern "C" {
    pub fn __finitef(__value: f32) -> libc::c_int;
}
extern "C" {
    pub fn __isnanf(__value: f32) -> libc::c_int;
}
extern "C" {
    pub fn __iseqsigf(__x: f32, __y: f32) -> libc::c_int;
}
extern "C" {
    pub fn __issignalingf(__value: f32) -> libc::c_int;
}
extern "C" {
    pub fn acosf(__x: f32) -> f32;
}
extern "C" {
    pub fn __acosf(__x: f32) -> f32;
}
extern "C" {
    pub fn asinf(__x: f32) -> f32;
}
extern "C" {
    pub fn __asinf(__x: f32) -> f32;
}
extern "C" {
    pub fn atanf(__x: f32) -> f32;
}
extern "C" {
    pub fn __atanf(__x: f32) -> f32;
}
extern "C" {
    pub fn atan2f(__y: f32, __x: f32) -> f32;
}
extern "C" {
    pub fn __atan2f(__y: f32, __x: f32) -> f32;
}
extern "C" {
    pub fn cosf(__x: f32) -> f32;
}
extern "C" {
    pub fn __cosf(__x: f32) -> f32;
}
extern "C" {
    pub fn sinf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sinf(__x: f32) -> f32;
}
extern "C" {
    pub fn tanf(__x: f32) -> f32;
}
extern "C" {
    pub fn __tanf(__x: f32) -> f32;
}
extern "C" {
    pub fn coshf(__x: f32) -> f32;
}
extern "C" {
    pub fn __coshf(__x: f32) -> f32;
}
extern "C" {
    pub fn sinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn tanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __tanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn acoshf(__x: f32) -> f32;
}
extern "C" {
    pub fn __acoshf(__x: f32) -> f32;
}
extern "C" {
    pub fn asinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __asinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn atanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __atanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn expf(__x: f32) -> f32;
}
extern "C" {
    pub fn __expf(__x: f32) -> f32;
}
extern "C" {
    pub fn frexpf(__x: f32, __exponent: *mut libc::c_int) -> f32;
}
extern "C" {
    pub fn __frexpf(__x: f32, __exponent: *mut libc::c_int) -> f32;
}
extern "C" {
    pub fn ldexpf(__x: f32, __exponent: libc::c_int) -> f32;
}
extern "C" {
    pub fn __ldexpf(__x: f32, __exponent: libc::c_int) -> f32;
}
extern "C" {
    pub fn logf(__x: f32) -> f32;
}
extern "C" {
    pub fn __logf(__x: f32) -> f32;
}
extern "C" {
    pub fn log10f(__x: f32) -> f32;
}
extern "C" {
    pub fn __log10f(__x: f32) -> f32;
}
extern "C" {
    pub fn modff(__x: f32, __iptr: *mut f32) -> f32;
}
extern "C" {
    pub fn __modff(__x: f32, __iptr: *mut f32) -> f32;
}
extern "C" {
    pub fn expm1f(__x: f32) -> f32;
}
extern "C" {
    pub fn __expm1f(__x: f32) -> f32;
}
extern "C" {
    pub fn log1pf(__x: f32) -> f32;
}
extern "C" {
    pub fn __log1pf(__x: f32) -> f32;
}
extern "C" {
    pub fn logbf(__x: f32) -> f32;
}
extern "C" {
    pub fn __logbf(__x: f32) -> f32;
}
extern "C" {
    pub fn exp2f(__x: f32) -> f32;
}
extern "C" {
    pub fn __exp2f(__x: f32) -> f32;
}
extern "C" {
    pub fn log2f(__x: f32) -> f32;
}
extern "C" {
    pub fn __log2f(__x: f32) -> f32;
}
extern "C" {
    pub fn powf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __powf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn sqrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sqrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn hypotf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __hypotf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn cbrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn __cbrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn ceilf(__x: f32) -> f32;
}
extern "C" {
    pub fn __ceilf(__x: f32) -> f32;
}
extern "C" {
    pub fn fabsf(__x: f32) -> f32;
}
extern "C" {
    pub fn __fabsf(__x: f32) -> f32;
}
extern "C" {
    pub fn floorf(__x: f32) -> f32;
}
extern "C" {
    pub fn __floorf(__x: f32) -> f32;
}
extern "C" {
    pub fn fmodf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fmodf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn isinff(__value: f32) -> libc::c_int;
}
extern "C" {
    pub fn finitef(__value: f32) -> libc::c_int;
}
extern "C" {
    pub fn dremf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __dremf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn significandf(__x: f32) -> f32;
}
extern "C" {
    pub fn __significandf(__x: f32) -> f32;
}
extern "C" {
    pub fn copysignf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __copysignf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn nanf(__tagb: *const libc::c_char) -> f32;
}
extern "C" {
    pub fn __nanf(__tagb: *const libc::c_char) -> f32;
}
extern "C" {
    pub fn isnanf(__value: f32) -> libc::c_int;
}
extern "C" {
    pub fn j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn jnf(arg1: libc::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn __jnf(arg1: libc::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn ynf(arg1: libc::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn __ynf(arg1: libc::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn __erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn gammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __gammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf_r(arg1: f32, __signgamp: *mut libc::c_int) -> f32;
}
extern "C" {
    pub fn __lgammaf_r(arg1: f32, __signgamp: *mut libc::c_int) -> f32;
}
extern "C" {
    pub fn rintf(__x: f32) -> f32;
}
extern "C" {
    pub fn __rintf(__x: f32) -> f32;
}
extern "C" {
    pub fn nextafterf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __nextafterf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn nexttowardf(__x: f32, __y: f64) -> f32;
}
extern "C" {
    pub fn __nexttowardf(__x: f32, __y: f64) -> f32;
}
extern "C" {
    pub fn remainderf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __remainderf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn scalbnf(__x: f32, __n: libc::c_int) -> f32;
}
extern "C" {
    pub fn __scalbnf(__x: f32, __n: libc::c_int) -> f32;
}
extern "C" {
    pub fn ilogbf(__x: f32) -> libc::c_int;
}
extern "C" {
    pub fn __ilogbf(__x: f32) -> libc::c_int;
}
extern "C" {
    pub fn scalblnf(__x: f32, __n: libc::c_long) -> f32;
}
extern "C" {
    pub fn __scalblnf(__x: f32, __n: libc::c_long) -> f32;
}
extern "C" {
    pub fn nearbyintf(__x: f32) -> f32;
}
extern "C" {
    pub fn __nearbyintf(__x: f32) -> f32;
}
extern "C" {
    pub fn roundf(__x: f32) -> f32;
}
extern "C" {
    pub fn __roundf(__x: f32) -> f32;
}
extern "C" {
    pub fn truncf(__x: f32) -> f32;
}
extern "C" {
    pub fn __truncf(__x: f32) -> f32;
}
extern "C" {
    pub fn remquof(__x: f32, __y: f32, __quo: *mut libc::c_int) -> f32;
}
extern "C" {
    pub fn __remquof(__x: f32, __y: f32, __quo: *mut libc::c_int) -> f32;
}
extern "C" {
    pub fn lrintf(__x: f32) -> libc::c_long;
}
extern "C" {
    pub fn __lrintf(__x: f32) -> libc::c_long;
}
extern "C" {
    pub fn llrintf(__x: f32) -> libc::c_longlong;
}
extern "C" {
    pub fn __llrintf(__x: f32) -> libc::c_longlong;
}
extern "C" {
    pub fn lroundf(__x: f32) -> libc::c_long;
}
extern "C" {
    pub fn __lroundf(__x: f32) -> libc::c_long;
}
extern "C" {
